
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: CoreUObject
/// dependency: Engine

#pragma pack(push, 0x1)

/// Class /Game/CameraAnim/Shake/AddWalkShake.AddWalkShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UAddWalkShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/VEPRShake.VEPRShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UVEPRShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/VEPRShakeAdd_Mult.VEPRShakeAdd_Mult_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UVEPRShakeAdd_Mult_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/VEPRShakeAdd_Single.VEPRShakeAdd_Single_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UVEPRShakeAdd_Single_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/Metel92Shake.Metel92Shake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UMetel92Shake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/Metel92ShakeAdd.Metel92ShakeAdd_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UMetel92ShakeAdd_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/MetaShake.MetaShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UMetaShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/MetaShakeAdd_Mult.MetaShakeAdd_Mult_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UMetaShakeAdd_Mult_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/MetaShakeAdd_Single.MetaShakeAdd_Single_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UMetaShakeAdd_Single_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/MetaLastBoomShake.MetaLastBoomShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UMetaLastBoomShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/BoomBoat.BoomBoat_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UBoomBoat_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/GERShake.GERShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UGERShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/GERShakeAdd_Single.GERShakeAdd_Single_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UGERShakeAdd_Single_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/IOPRShake.IOPRShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UIOPRShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/IOPRShakeAdd_Single.IOPRShakeAdd_Single_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UIOPRShakeAdd_Single_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/FlyInter_NoEngineShake.FlyInter_NoEngineShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UFlyInter_NoEngineShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/FlyInter_Shake.FlyInter_Shake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UFlyInter_Shake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/JiangLuoSanFly_Sequence.JiangLuoSanFly_Sequence_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UJiangLuoSanFly_Sequence_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/AirBag_Shake.AirBag_Shake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UAirBag_Shake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/AirBag_Shake_TPS.AirBag_Shake_TPS_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UAirBag_Shake_TPS_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/RunShake.RunShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class URunShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/RunWallLoop.RunWallLoop_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class URunWallLoop_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/Shun_Backward.Shun_Backward_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UShun_Backward_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/Shun_Backward_L.Shun_Backward_L_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UShun_Backward_L_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/Shun_Backward_R.Shun_Backward_R_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UShun_Backward_R_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/Shun_Left.Shun_Left_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UShun_Left_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/Shun_Right.Shun_Right_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UShun_Right_C : public UShun_Left_C
{ 
public:
};

/// Class /Game/CameraAnim/Shake/SprintAttackMove.SprintAttackMove_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class USprintAttackMove_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/SprintAttackShake.SprintAttackShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class USprintAttackShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/UpLightMove.UpLightMove_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UUpLightMove_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/UpLightSwordHitShake.UpLightSwordHitShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UUpLightSwordHitShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/UpSword_Shake.UpSword_Shake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UUpSword_Shake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/VEPR_Check_Shake.VEPR_Check_Shake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UVEPR_Check_Shake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/VEPR_ReloadShake03.VEPR_ReloadShake03_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UVEPR_ReloadShake03_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/WalkShake.WalkShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UWalkShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/WaterDown.WaterDown_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UWaterDown_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/XuLi_Loop.XuLi_Loop_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UXuLi_Loop_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/BMI_EMPShake.BMI_EMPShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UBMI_EMPShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/Dead_Shake.Dead_Shake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UDead_Shake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/Defu_LightSwordShake.Defu_LightSwordShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UDefu_LightSwordShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/DefuPutUp_LightSwordShake.DefuPutUp_LightSwordShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UDefuPutUp_LightSwordShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/FallGroundShake.FallGroundShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UFallGroundShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/FallGroundShakeLoop.FallGroundShakeLoop_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UFallGroundShakeLoop_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/GERLastFireShake.GERLastFireShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UGERLastFireShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/HuaChanMove.HuaChanMove_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UHuaChanMove_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/HuaDown2Shake.HuaDown2Shake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UHuaDown2Shake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/EMP_QTE2_Shake.EMP_QTE2_Shake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UEMP_QTE2_Shake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/AmmoDefu_Normal.AmmoDefu_Normal_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UAmmoDefu_Normal_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/LightDefu_Normal.LightDefu_Normal_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class ULightDefu_Normal_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/KisType45Shake.KisType45Shake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UKisType45Shake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/KisType45ShakeAdd.KisType45ShakeAdd_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UKisType45ShakeAdd_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/GER_ReloadShake01.GER_ReloadShake01_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UGER_ReloadShake01_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/GER_ReloadShake02.GER_ReloadShake02_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UGER_ReloadShake02_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/GER_ReloadShake03.GER_ReloadShake03_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UGER_ReloadShake03_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/GER_ReloadShake04.GER_ReloadShake04_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UGER_ReloadShake04_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/IOPR_ReloadShake01.IOPR_ReloadShake01_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UIOPR_ReloadShake01_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/IOPR_ReloadShake02.IOPR_ReloadShake02_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UIOPR_ReloadShake02_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/IOPR_ReloadShake03.IOPR_ReloadShake03_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UIOPR_ReloadShake03_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/Meta_ReloadShake01.Meta_ReloadShake01_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UMeta_ReloadShake01_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/Meta_ReloadShake02.Meta_ReloadShake02_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UMeta_ReloadShake02_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/Meta_ReloadShake03.Meta_ReloadShake03_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UMeta_ReloadShake03_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/MetaLastFireShake.MetaLastFireShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UMetaLastFireShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/VEPR_ReloadShake01.VEPR_ReloadShake01_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UVEPR_ReloadShake01_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/VEPR_ReloadShake02.VEPR_ReloadShake02_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UVEPR_ReloadShake02_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/VEPR_ReloadShake04.VEPR_ReloadShake04_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UVEPR_ReloadShake04_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/Weapon_PutDown.Weapon_PutDown_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UWeapon_PutDown_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/Weapon_ReloadRest.Weapon_ReloadRest_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UWeapon_ReloadRest_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/Weapon_ReloadShakeGuoDu.Weapon_ReloadShakeGuoDu_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UWeapon_ReloadShakeGuoDu_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/KillGod_FireGroundShake2.KillGod_FireGroundShake2_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UKillGod_FireGroundShake2_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/LightDefu_Perfact.LightDefu_Perfact_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class ULightDefu_Perfact_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/Melee_PowerShake_HitBody.Melee_PowerShake_HitBody_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UMelee_PowerShake_HitBody_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/JumpAttackHit_Shake.JumpAttackHit_Shake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UJumpAttackHit_Shake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/JumpAttackLightJump.JumpAttackLightJump_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UJumpAttackLightJump_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/LightSword_QTE2_Shake.LightSword_QTE2_Shake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class ULightSword_QTE2_Shake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/LightSwordHitShake.LightSwordHitShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class ULightSwordHitShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/LightSwordShake.LightSwordShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class ULightSwordShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/LightSwordZhaDi_FireGroundShake.LightSwordZhaDi_FireGroundShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class ULightSwordZhaDi_FireGroundShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/Melee_PowerShake.Melee_PowerShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UMelee_PowerShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/MeleePower_Start.MeleePower_Start_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UMeleePower_Start_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/MeleeShake.MeleeShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UMeleeShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/PlayerAmmoHitShake_AR.PlayerAmmoHitShake_AR_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UPlayerAmmoHitShake_AR_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/PlayerAmmoHitShake_ShotGun.PlayerAmmoHitShake_ShotGun_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UPlayerAmmoHitShake_ShotGun_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/PlayerJump.PlayerJump_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UPlayerJump_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/PlayerMeleeHitShake.PlayerMeleeHitShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UPlayerMeleeHitShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/QYQ_AI_EndShake.QYQ_AI_EndShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UQYQ_AI_EndShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/Car_Run_LoopShake.Car_Run_LoopShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UCar_Run_LoopShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/Car_ShaChe_Shake.Car_ShaChe_Shake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UCar_ShaChe_Shake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/CarHitWall_ForwardShake.CarHitWall_ForwardShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UCarHitWall_ForwardShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/CarTanShe_Shake.CarTanShe_Shake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UCarTanShe_Shake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/ACP-SuperShake.ACP-SuperShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UACP_SuperShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/ACP-SuperShakeAdd.ACP-SuperShakeAdd_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UACP_SuperShakeAdd_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/FilmCamera_ToFast.FilmCamera_ToFast_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UFilmCamera_ToFast_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/FlyInterIdleShake_Loop.FlyInterIdleShake_Loop_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UFlyInterIdleShake_Loop_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/FlyInterIdleShake.FlyInterIdleShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UFlyInterIdleShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/BoomShake_SmallerSpeedOutLong.BoomShake_SmallerSpeedOutLong_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UBoomShake_SmallerSpeedOutLong_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/BoomShake_SmallerSpeed.BoomShake_SmallerSpeed_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UBoomShake_SmallerSpeed_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/QYQ_AI_StartShake.QYQ_AI_StartShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UQYQ_AI_StartShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/QYQ_FOV.QYQ_FOV_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UQYQ_FOV_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/QYQ_Jump.QYQ_Jump_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UQYQ_Jump_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/QYQ_StartShake.QYQ_StartShake_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UQYQ_StartShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/LoopShake_BossHandAXE.LoopShake_BossHandAXE_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class ULoopShake_BossHandAXE_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/LoopShake_BossHandJzz.LoopShake_BossHandJzz_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class ULoopShake_BossHandJzz_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/BoomShake_SmallerSpeedLoopEnd.BoomShake_SmallerSpeedLoopEnd_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UBoomShake_SmallerSpeedLoopEnd_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/CameraAnim/Shake/BoomShake_Smaller.BoomShake_Smaller_C
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 16 MaxSize: 0x0180
class UBoomShake_Smaller_C : public UMatineeCameraShake
{ 
public:
};

#pragma pack(pop)


static_assert(sizeof(UAddWalkShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UVEPRShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UVEPRShakeAdd_Mult_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UVEPRShakeAdd_Single_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UMetel92Shake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UMetel92ShakeAdd_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UMetaShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UMetaShakeAdd_Mult_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UMetaShakeAdd_Single_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UMetaLastBoomShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UBoomBoat_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UGERShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UGERShakeAdd_Single_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UIOPRShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UIOPRShakeAdd_Single_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UFlyInter_NoEngineShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UFlyInter_Shake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UJiangLuoSanFly_Sequence_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UAirBag_Shake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UAirBag_Shake_TPS_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(URunShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(URunWallLoop_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UShun_Backward_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UShun_Backward_L_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UShun_Backward_R_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UShun_Left_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UShun_Right_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(USprintAttackMove_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(USprintAttackShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UUpLightMove_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UUpLightSwordHitShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UUpSword_Shake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UVEPR_Check_Shake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UVEPR_ReloadShake03_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UWalkShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UWaterDown_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UXuLi_Loop_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UBMI_EMPShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UDead_Shake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UDefu_LightSwordShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UDefuPutUp_LightSwordShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UFallGroundShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UFallGroundShakeLoop_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UGERLastFireShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UHuaChanMove_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UHuaDown2Shake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UEMP_QTE2_Shake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UAmmoDefu_Normal_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(ULightDefu_Normal_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UKisType45Shake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UKisType45ShakeAdd_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UGER_ReloadShake01_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UGER_ReloadShake02_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UGER_ReloadShake03_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UGER_ReloadShake04_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UIOPR_ReloadShake01_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UIOPR_ReloadShake02_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UIOPR_ReloadShake03_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UMeta_ReloadShake01_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UMeta_ReloadShake02_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UMeta_ReloadShake03_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UMetaLastFireShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UVEPR_ReloadShake01_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UVEPR_ReloadShake02_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UVEPR_ReloadShake04_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UWeapon_PutDown_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UWeapon_ReloadRest_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UWeapon_ReloadShakeGuoDu_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UKillGod_FireGroundShake2_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(ULightDefu_Perfact_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UMelee_PowerShake_HitBody_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UJumpAttackHit_Shake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UJumpAttackLightJump_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(ULightSword_QTE2_Shake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(ULightSwordHitShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(ULightSwordShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(ULightSwordZhaDi_FireGroundShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UMelee_PowerShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UMeleePower_Start_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UMeleeShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UPlayerAmmoHitShake_AR_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UPlayerAmmoHitShake_ShotGun_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UPlayerJump_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UPlayerMeleeHitShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UQYQ_AI_EndShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UCar_Run_LoopShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UCar_ShaChe_Shake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UCarHitWall_ForwardShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UCarTanShe_Shake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UACP_SuperShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UACP_SuperShakeAdd_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UFilmCamera_ToFast_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UFlyInterIdleShake_Loop_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UFlyInterIdleShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UBoomShake_SmallerSpeedOutLong_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UBoomShake_SmallerSpeed_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UQYQ_AI_StartShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UQYQ_FOV_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UQYQ_Jump_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UQYQ_StartShake_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(ULoopShake_BossHandAXE_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(ULoopShake_BossHandJzz_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UBoomShake_SmallerSpeedLoopEnd_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
static_assert(sizeof(UBoomShake_Smaller_C) == 0x0180); // 384 bytes (0x000180 - 0x000180)
