
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: ActorSequence
/// dependency: AnimGraphRuntime
/// dependency: BP
/// dependency: BPBMI
/// dependency: CableComponent
/// dependency: CircleDamageIndicator
/// dependency: CoreUObject
/// dependency: Crosshair_UMG
/// dependency: Engine
/// dependency: InputCore
/// dependency: MediaAssets
/// dependency: NPC_AI
/// dependency: OnlineSubsystemBlueprints
/// dependency: PhysXVehicles
/// dependency: Slate
/// dependency: SlateCore
/// dependency: SteamCore
/// dependency: UISystem
/// dependency: UMG

#pragma pack(push, 0x1)

/// Enum /Game/PlayerBP/Blueprints/VRChapter.VRChapter
/// Size: 0x01 (1 bytes)
enum class VRChapter : uint8_t
{
	VRChapter__NewEnumerator0                                                        = 0,
	VRChapter__NewEnumerator1                                                        = 1,
	VRChapter__NewEnumerator2                                                        = 2,
	VRChapter__NewEnumerator3                                                        = 3,
	VRChapter__NewEnumerator4                                                        = 4,
	VRChapter__NewEnumerator5                                                        = 5
};

/// Enum /Game/UISystem_BMI/TextUI/UMG/BMI_Create_Subtitles.BMI_Create_Subtitles
/// Size: 0x01 (1 bytes)
enum class BMI_Create_Subtitles : uint8_t
{
	BMI_Create_Subtitles__NewEnumerator0                                             = 0,
	BMI_Create_Subtitles__NewEnumerator1                                             = 1,
	BMI_Create_Subtitles__NewEnumerator2                                             = 2,
	BMI_Create_Subtitles__NewEnumerator3                                             = 3,
	BMI_Create_Subtitles__NewEnumerator4                                             = 4,
	BMI_Create_Subtitles__NewEnumerator5                                             = 5,
	BMI_Create_Subtitles__NewEnumerator6                                             = 6,
	BMI_Create_Subtitles__NewEnumerator7                                             = 7
};

/// Class /Game/PlayerBP/Blueprints/BMI_GameInstance.BMI_GameInstance_C
/// Class /Game/PlayerBP/Blueprints/BMI_GameInstance.BMI_GameInstance_C
/// Size: 0x020B (523 bytes) (0x0001A8 - 0x00020B) align 8 MaxSize: 0x020B
// 這是一個遊戲自訂的 GameInstance 藍圖類別。
// 它的主要作用是在整個遊戲執行期間，作為一個全域性的資料庫，管理 MOD 或外觀替換的資源和狀態。
class UBMI_GameInstance_C : public UGameInstance
{
public:
	// --- MOD 模型資源引用 ---
	// 指向“舒雅”角色的自訂身體骨骼網格體模型。
	class USkeletalMesh*                               MOD_SuYa_Mesh;                                              // 0x01A8   (0x0008)

	// 指向 'VEPR' 武器的自訂骨骼網格體模型。
	class USkeletalMesh*                               MOD_VEPR_Mesh;                                              // 0x01B0   (0x0008)

	// 指向 'GER' 武器的自訂骨骼網格體模型。
	class USkeletalMesh*                               MOD_GER_Mesh;                                               // 0x01B8   (0x0008)

	// 指向 'META' 武器的自訂骨骼網格體模型。
	class USkeletalMesh*                               MOD_META_Mesh;                                              // 0x01C0   (0x0008)

	// 指向 'IOPR' 武器的自訂骨骼網格體模型。
	class USkeletalMesh*                               MOD_IOPR_Mesh;                                              // 0x01C8   (0x0008)

	// 指向 'VEPR' 武器的自訂彈匣模型。
	class USkeletalMesh*                               MOD_VEPR_MAG;                                               // 0x01D0   (0x0008)

	// 指向 'GER' 武器的自訂彈匣模型。
	class USkeletalMesh*                               MOD_GER_MAG;                                                // 0x01D8   (0x0008)

	// 指向 'META' 武器的自訂彈匣模型。
	class USkeletalMesh*                               MOD_META_MAG;                                               // 0x01E0   (0x0008)

	// 指向 'IOPR' 武器的自訂彈匣模型。
	class USkeletalMesh*                               MOD_IOPR_MAG;                                               // 0x01E8   (0x0008)

	// 指向“舒雅”角色的自訂腳部模型。
	class USkeletalMesh*                               MOD_SuYa_Foot;                                              // 0x01F0   (0x0008)

	// 指向“舒雅”角色的自訂手部模型（用於第一人稱視角）。
	class USkeletalMesh*                               MOD_SuYa_Hand;                                              // 0x01F8   (0x0008)

	// --- MOD 啟用狀態旗標 ---
	// 如果為 true，則啟用“舒雅”角色模型的替換。
	bool                                               MOD_SuYa_;                                                  // 0x0200   (0x0001)

	// 如果為 true，則啟用 'VEPR' 武器模型的替換。
	bool                                               MOD_VEPR;                                                   // 0x0201   (0x0001)

	// 如果為 true，則啟用 'GER' 武器模型的替換。
	bool                                               MOD_GER;                                                    // 0x0202   (0x0001)

	// 如果為 true，則啟用 'META' 武器模型的替換。
	bool                                               MOD_META;                                                   // 0x0203   (0x0001)

	// 如果為 true，則啟用 'IOPR' 武器模型的替換。
	bool                                               MOD_IOPR;                                                   // 0x0204   (0x0001)

	// 如果為 true，則啟用 'VEPR' 武器彈匣模型的替換。
	bool                                               MOD_VEPR_MAGS;                                              // 0x0205   (0x0001)

	// 如果為 true，則啟用 'GER' 武器彈匣模型的替換。
	bool                                               MOD_GER_MAGS;                                               // 0x0206   (0x0001)

	// 如果為 true，則啟用 'META' 武器彈匣模型的替換。
	bool                                               MOD_META_MAGS;                                              // 0x0207   (0x0001)

	// 如果為 true，則啟用 'IOPR' 武器彈匣模型的替換。
	bool                                               MOD_IOPR_MAGS;                                              // 0x0208   (0x0001)

	// 如果為 true，則啟用腳部模型的替換。
	bool                                               MOD_FOOT;                                                   // 0x0209   (0x0001)

	// 如果為 true，則啟用手部模型的替換。
	bool                                               MOD_HAND;                                                   // 0x020A   (0x0001)
};

/// Class /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000028) align 8 MaxSize: 0x0028
class USend_BMIAI_C : public UInterface
{ 
public:


	/// Functions
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_GuLouHand_Hit
	// void Send_GuLouHand_Hit(float Hit);                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_XuLiMelee
	// void Send_XuLiMelee(float Hit);                                                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_HealthUIVis
	// void Send_HealthUIVis();                                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_GERFire
	// void Send_GERFire();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_PlayerQYQAI
	// void Send_PlayerQYQAI(int32_t Number);                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_PlayerHitCarAI
	// void Send_PlayerHitCarAI();                                                                                              // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_SprintAttack
	// void Send_SprintAttack(float Hit);                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_ShunAI_Alert
	// void Send_ShunAI_Alert();                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_BackSeePlayer
	// void Send_BackSeePlayer();                                                                                               // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_FootAI_Alert
	// void Send_FootAI_Alert();                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_ForwardSeePlayer
	// void Send_ForwardSeePlayer();                                                                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_Dee_Alert
	// void Send_Dee_Alert();                                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_Add_Alerts
	// void Send_Add_Alerts(float DS);                                                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_DefuHK
	// void Send_DefuHK();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_BloodHK
	// void Send_BloodHK();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_ForceAIHit
	// void Send_ForceAIHit();                                                                                                  // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_DisPlayAIHealthUI
	// void Send_DisPlayAIHealthUI(bool Vis_);                                                                                  // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_AIDEFUHealths
	// void Send_AIDEFUHealths(float DEFUHealth, float BloddHealth, bool HaveDefu_);                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_AIBoat
	// void Send_AIBoat(class UPrimitiveComponent* HitBox, float Hit);                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_AIFlyQYQ
	// void Send_AIFlyQYQ();                                                                                                    // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_PerfectDefu
	// void Send_PerfectDefu(int32_t FireType);                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_NearDefu
	// void Send_NearDefu(int32_t FireType);                                                                                    // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_AIQYQ
	// void Send_AIQYQ();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_ShieldHitMeleeOrSword
	// void Send_ShieldHitMeleeOrSword(int32_t Hit);                                                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_ZhaDi
	// void Send_ZhaDi();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_KanJi
	// void Send_KanJi(float Hit);                                                                                              // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_HuaChan
	// void Send_HuaChan();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_UpLightSword
	// void Send_UpLightSword(float Hit);                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_MeleePower
	// void Send_MeleePower(float Hit);                                                                                         // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_EMP
	// void Send_EMP(float Hit);                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_HitSword
	// void Send_HitSword(float Hit, int32_t FiretType);                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_BMIAI.Send_BMIAI_C.Send_ShieldHit
	// void Send_ShieldHit();                                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C
/// Class /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C
/// Size: 0x0382 (898 bytes) (0x000308 - 0x000382) align 8 MaxSize: 0x0382
// 這是遊戲的核心規則管理器，定義了關卡的玩法、重生規則和勝利條件等。
class ABMIGameMode_C : public AGameMode
{
public:
	// 指向藍圖事件圖（Event Graph）的執行框架，是所有藍圖類別的標準成員。
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0308   (0x0008)

	// 一個場景組件，通常作為 Actor 在世界中的根。對於 GameMode 來說這比較少見，可能是藍圖創建時的預設殘留，通常不會使用。
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0310   (0x0008)

	// 一個由時間軸（Timeline）控制的浮點數值。從變數名推斷，這用於控制“身體擊破時的慢動作”效果的強度。
	float                                              BodyBokenTimeSlow_SlowTime_ECDE5672447A877818E91E91F41A429A; // 0x0318   (0x0004)

	// 時間軸的播放方向（前進、後退等）。
	TEnumAsByte<ETimelineDirection>                    BodyBokenTimeSlow__Direction_ECDE5672447A877818E91E91F41A429A; // 0x031C   (0x0001)

	// 未知數據，記憶體對齊。
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x031D   (0x0003)  MISSED

	// 這是一個時間軸（Timeline）組件，用於實現“子彈時間”或慢動作效果。當觸發特定條件（如擊破敵人身體）時，它會平滑地改變遊戲時間流速。
	class UTimelineComponent*                          BodyBokenTimeSlow;                                          // 0x0320   (0x0008)

	// 一個字串，名稱中的 'VR' 可能與 VR 模式的存檔有關，或者是一個存檔槽的名稱。
	FString                                            VRSave;                                                     // 0x0328   (0x0010)

	// 指向 USaveGame 物件的指標，用於處理遊戲存檔，特別是玩家相關的數據。
	class USaveGame*                                   savePlayerSubClass;                                         // 0x0338   (0x0008)

	// 指向“武器商店”的 UMG 控件（UI 介面）的引用。
	class UObject*                                     WeaponShop_Right_UMG;                                       // 0x0340   (0x0008)

	// 指向另一種風格的準星 UI。
	class UCrosshair_X_C*                              Crosshair_X;                                                // 0x0348   (0x0008)

	// 指向“技能 HUD”的 UI 介面。
	class UObject*                                     SkillHUD_UMG;                                               // 0x0350   (0x0008)

	// 指向主要的準星 UI。
	class UCrosshair_UMG_C*                            Crosshair_UMG;                                              // 0x0358   (0x0008)

	// 指向“技能運行時”的 UI 介面，可能用於顯示技能冷卻時間等。
	class UObject*                                     Skill_RunTime_UMG;                                          // 0x0360   (0x0008)

	// 指向顯示“經驗值”的 UI 介面。
	class UHeadXP_UMG_C*                               HeadXP_UMG;                                                 // 0x0368   (0x0008)

	// 指向顯示“任務目標”的 UI 介面。
	class UHeadMission_UMG_C*                          HeadMission_UMG;                                            // 0x0370   (0x0008)

	// 一個布林標記，可能用於控制某個全域效果的可見性，從名字推測可能與“雨”或某種深度效果有關。
	bool                                               UnHideDepthRainBox;                                         // 0x0378   (0x0001)

	// 未知數據。
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0379   (0x0003)  MISSED

	// 一個浮點數，用於記錄當前遊戲的總遊玩時間。
	float                                              NowGamePlayTime;                                            // 0x037C   (0x0004)

	// 布林標記，'CG' 通常指過場動畫（Cutscene）。這個變數很可能用於標記遊戲是否正在播放特定（可能是在太空場景）的過場動畫，此時應禁用玩家輸入。
	bool                                               IsSpaceCG;                                                  // 0x0380   (0x0001)

	// 布林標記，可能用於觸發“最終擊殺”時的特殊效果，例如慢動作或鏡頭特寫。
	bool                                               IsKillFinalTime;                                            // 0x0381   (0x0001)


	/// Functions
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.UpDataBaseSound
	// void UpDataBaseSound();                                                                                                  // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.DefuAddAmmo
	// void DefuAddAmmo();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.GiveAmmo3
	// void GiveAmmo3();                                                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.HideHUD
	// void HideHUD();                                                                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.XCrossAnim_HeadShot
	// void XCrossAnim_HeadShot();                                                                                              // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.Initialize_Setting
	// void Initialize_Setting();                                                                                               // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.KillBots
	// void KillBots();                                                                                                         // [0x148e900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.XCrossAnim
	// void XCrossAnim();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.GiveAmmo2
	// void GiveAmmo2();                                                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.GiveAmmo1
	// void GiveAmmo1();                                                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.SetCGMode
	// void SetCGMode(bool IsCG_, bool LockMouse_, bool HiddenPlayerMod_, bool PlayerCanMove_);                                 // [0x148e900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.BodyBokenTimeSlow__FinishedFunc
	// void BodyBokenTimeSlow__FinishedFunc();                                                                                  // [0x148e900] BlueprintEvent       
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.BodyBokenTimeSlow__UpdateFunc
	// void BodyBokenTimeSlow__UpdateFunc();                                                                                    // [0x148e900] BlueprintEvent       
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnFailure_7209F7E646777AC355A176AF92E90B70
	// void OnFailure_7209F7E646777AC355A176AF92E90B70(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnSuccess_7209F7E646777AC355A176AF92E90B70
	// void OnSuccess_7209F7E646777AC355A176AF92E90B70(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnFailure_7B6CFB86419B8C97E28C22A268394C0F
	// void OnFailure_7B6CFB86419B8C97E28C22A268394C0F();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnSuccess_7B6CFB86419B8C97E28C22A268394C0F
	// void OnSuccess_7B6CFB86419B8C97E28C22A268394C0F();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.Completed_BAD1428D49E55A5B57FCDEB2FEDE0F6D
	// void Completed_BAD1428D49E55A5B57FCDEB2FEDE0F6D(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.Completed_B365026A43C8B13D76D941A065E94C3B
	// void Completed_B365026A43C8B13D76D941A065E94C3B(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnFailure_E03F6CB74FAC93190885A89B13C18253
	// void OnFailure_E03F6CB74FAC93190885A89B13C18253(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnSuccess_E03F6CB74FAC93190885A89B13C18253
	// void OnSuccess_E03F6CB74FAC93190885A89B13C18253(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnFailure_09EFD63541E931DF70C220A387FC80BD
	// void OnFailure_09EFD63541E931DF70C220A387FC80BD();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnSuccess_09EFD63541E931DF70C220A387FC80BD
	// void OnSuccess_09EFD63541E931DF70C220A387FC80BD();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.Completed_9F6B9334486A807C4A8615926B213C01
	// void Completed_9F6B9334486A807C4A8615926B213C01(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.Completed_4882E7C14AC221D9B0F3508DBBBD433C
	// void Completed_4882E7C14AC221D9B0F3508DBBBD433C(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnFailure_4C3A40654BB48ACE06515984A6A8678E
	// void OnFailure_4C3A40654BB48ACE06515984A6A8678E(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnSuccess_4C3A40654BB48ACE06515984A6A8678E
	// void OnSuccess_4C3A40654BB48ACE06515984A6A8678E(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnFailure_FD6F0191434B2197DCEA47BC140D7D20
	// void OnFailure_FD6F0191434B2197DCEA47BC140D7D20();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnSuccess_FD6F0191434B2197DCEA47BC140D7D20
	// void OnSuccess_FD6F0191434B2197DCEA47BC140D7D20();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.Completed_5AAA1C1A415F064FA2808E8F890229A2
	// void Completed_5AAA1C1A415F064FA2808E8F890229A2(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.Completed_B79EE0D44BDB2316A8BD13A32F7535E5
	// void Completed_B79EE0D44BDB2316A8BD13A32F7535E5(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnFailure_FFA5B9384F842DA43FA69A9B05041339
	// void OnFailure_FFA5B9384F842DA43FA69A9B05041339(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnSuccess_FFA5B9384F842DA43FA69A9B05041339
	// void OnSuccess_FFA5B9384F842DA43FA69A9B05041339(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnFailure_9552271F46009E67ADC74A89542652ED
	// void OnFailure_9552271F46009E67ADC74A89542652ED();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnSuccess_9552271F46009E67ADC74A89542652ED
	// void OnSuccess_9552271F46009E67ADC74A89542652ED();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.Completed_3F64E44441383C6899811C8B5EB71F03
	// void Completed_3F64E44441383C6899811C8B5EB71F03(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.Completed_CF350CF441ED7D5BC7225BAE628A613A
	// void Completed_CF350CF441ED7D5BC7225BAE628A613A(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnFailure_36162220439BF4210F1A8084491F9373
	// void OnFailure_36162220439BF4210F1A8084491F9373(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnSuccess_36162220439BF4210F1A8084491F9373
	// void OnSuccess_36162220439BF4210F1A8084491F9373(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnFailure_8B087F004F925C75D38465868F925E85
	// void OnFailure_8B087F004F925C75D38465868F925E85();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnSuccess_8B087F004F925C75D38465868F925E85
	// void OnSuccess_8B087F004F925C75D38465868F925E85();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.Completed_8EAE8C3A4A14B25E74B2BFAD13B1182F
	// void Completed_8EAE8C3A4A14B25E74B2BFAD13B1182F(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.Completed_43504900434CCC02848BF5883305F70B
	// void Completed_43504900434CCC02848BF5883305F70B(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnFailure_DB1326EA4BB050782DBD42881AA29448
	// void OnFailure_DB1326EA4BB050782DBD42881AA29448(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnSuccess_DB1326EA4BB050782DBD42881AA29448
	// void OnSuccess_DB1326EA4BB050782DBD42881AA29448(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnFailure_1AE6664C4974B9087961DCB01F599D4E
	// void OnFailure_1AE6664C4974B9087961DCB01F599D4E();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnSuccess_1AE6664C4974B9087961DCB01F599D4E
	// void OnSuccess_1AE6664C4974B9087961DCB01F599D4E();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnFailure_8ECF5E4348738F08BD034BBF67C2C289
	// void OnFailure_8ECF5E4348738F08BD034BBF67C2C289(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnSuccess_8ECF5E4348738F08BD034BBF67C2C289
	// void OnSuccess_8ECF5E4348738F08BD034BBF67C2C289(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnFailure_1B65C88148C82CFC6D6517BAF1FA73E1
	// void OnFailure_1B65C88148C82CFC6D6517BAF1FA73E1();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnSuccess_1B65C88148C82CFC6D6517BAF1FA73E1
	// void OnSuccess_1B65C88148C82CFC6D6517BAF1FA73E1();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnFailure_E98A7EA946377B036DA00EAA0D070B8D
	// void OnFailure_E98A7EA946377B036DA00EAA0D070B8D(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnSuccess_E98A7EA946377B036DA00EAA0D070B8D
	// void OnSuccess_E98A7EA946377B036DA00EAA0D070B8D(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnFailure_624932EC4004AADB6C751D805779A77C
	// void OnFailure_624932EC4004AADB6C751D805779A77C();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.OnSuccess_624932EC4004AADB6C751D805779A77C
	// void OnSuccess_624932EC4004AADB6C751D805779A77C();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.HitTimeSlow2
	// void HitTimeSlow2();                                                                                                     // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.HitTimeSlow
	// void HitTimeSlow();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.KillFinalAITime
	// void KillFinalAITime();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.ShunSlow
	// void ShunSlow();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.BeginBlackOut
	// void BeginBlackOut();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.AIBokenTime
	// void AIBokenTime();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.AmmoTime
	// void AmmoTime();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.TiTime
	// void TiTime();                                                                                                           // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.GamePlayTimeSub
	// void GamePlayTimeSub();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.RestNowGamePlayTime
	// void RestNowGamePlayTime();                                                                                              // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x148e900] Event|Protected|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.HeadShot_Achievement
	// void HeadShot_Achievement();                                                                                             // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.SpaceCG
	// void SpaceCG();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.AIBokenTime_ALL
	// void AIBokenTime_ALL();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.BeginBlackOutSequence
	// void BeginBlackOutSequence();                                                                                            // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.DZ_ChengJiu
	// void DZ_ChengJiu();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.ZhuoShao_ChengJiu
	// void ZhuoShao_ChengJiu();                                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.DefuFar_ChengJiu
	// void DefuFar_ChengJiu();                                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.KILLCAR_ChengJiu
	// void KILLCAR_ChengJiu();                                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.Clear_KILLCAR_Number
	// void Clear_KILLCAR_Number();                                                                                             // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.YUXI20_ChengJiu
	// void YUXI20_ChengJiu();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.YUXI50_ChengJiu
	// void YUXI50_ChengJiu();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.SLZ_ChengJiu
	// void SLZ_ChengJiu();                                                                                                     // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIGameMode.BMIGameMode_C.ExecuteUbergraph_BMIGameMode
	// void ExecuteUbergraph_BMIGameMode(int32_t EntryPoint);                                                                   // [0x148e900] Final|HasDefaults    
};

/// Class /Game/PlayerBP/Blueprints/DamageType_Melee.DamageType_Melee_C
/// Size: 0x0040 (64 bytes) (0x000040 - 0x000040) align 8 MaxSize: 0x0040
class UDamageType_Melee_C : public UDamageType
{ 
public:
};

/// Class /Game/PlayerBP/Receive/Send_AIBreakBody.Send_AIBreakBody_C
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000028) align 8 MaxSize: 0x0028
class USend_AIBreakBody_C : public UInterface
{ 
public:


	/// Functions
	// Function /Game/PlayerBP/Receive/Send_AIBreakBody.Send_AIBreakBody_C.AIFootRShot
	// void AIFootRShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Receive/Send_AIBreakBody.Send_AIBreakBody_C.AIFootLShot
	// void AIFootLShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Receive/Send_AIBreakBody.Send_AIBreakBody_C.AIHandLShot
	// void AIHandLShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Receive/Send_AIBreakBody.Send_AIBreakBody_C.AIHandRShot
	// void AIHandRShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Receive/Send_AIBreakBody.Send_AIBreakBody_C.AIHeadShot
	// void AIHeadShot();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/PlayerBP/Receive/Send_PlayerToDamage.Send_PlayerToDamage_C
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000028) align 8 MaxSize: 0x0028
class USend_PlayerToDamage_C : public UInterface
{ 
public:


	/// Functions
	// Function /Game/PlayerBP/Receive/Send_PlayerToDamage.Send_PlayerToDamage_C.Send_PlayerToSkillDamage
	// void Send_PlayerToSkillDamage(int32_t SkillDamage);                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Receive/Send_PlayerToDamage.Send_PlayerToDamage_C.Send_PlayerToAirDamage
	// void Send_PlayerToAirDamage(int32_t AirDamage);                                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Receive/Send_PlayerToDamage.Send_PlayerToDamage_C.Send_PlayerToDamage
	// void Send_PlayerToDamage(int32_t Damage);                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/PlayerBP/Blueprints/BMI_MOD.BMI_MOD_C
/// Size: 0x0043 (67 bytes) (0x000028 - 0x000043) align 8 MaxSize: 0x0043
class UBMI_MOD_C : public USaveGame
{ 
public:
	TArray<FString>                                    MODName;                                                    // 0x0028   (0x0010)  
	bool                                               IS_SuYa_MOD_;                                               // 0x0038   (0x0001)  
	bool                                               IS_SuYa_Hand_MOD_;                                          // 0x0039   (0x0001)  
	bool                                               IS_SuYa_Foot_MOD_;                                          // 0x003A   (0x0001)  
	bool                                               IS_VEPR_MOD_;                                               // 0x003B   (0x0001)  
	bool                                               IS_GER_MOD_;                                                // 0x003C   (0x0001)  
	bool                                               IS_META_MOD_;                                               // 0x003D   (0x0001)  
	bool                                               IS_IOPR_MOD_;                                               // 0x003E   (0x0001)  
	bool                                               IS_VEPR_MAG_MOD_;                                           // 0x003F   (0x0001)  
	bool                                               IS_GER_MAG_MOD_;                                            // 0x0040   (0x0001)  
	bool                                               IS_META_MAG_MOD_;                                           // 0x0041   (0x0001)  
	bool                                               IS_IOPR_MAG_MOD_;                                           // 0x0042   (0x0001)  
};

/// Class /Game/PlayerBP/Blueprints/GamePlaySave.GamePlaySave_C
/// Size: 0x01FC (508 bytes) (0x000028 - 0x0001FC) align 16 MaxSize: 0x01FC
class UGamePlaySave_C : public USaveGame
{ 
public:
	class USaveGame*                                   savePlayerSubClass;                                         // 0x0028   (0x0008)  
	int32_t                                            ID1_NowAmmo;                                                // 0x0030   (0x0004)  
	int32_t                                            ID1_MaxAmmo;                                                // 0x0034   (0x0004)  
	int32_t                                            ID1_DefuWeaponAmmo;                                         // 0x0038   (0x0004)  
	int32_t                                            ID2_NowAmmo;                                                // 0x003C   (0x0004)  
	int32_t                                            ID2_MaxAmmo;                                                // 0x0040   (0x0004)  
	int32_t                                            ID2_DefuWeaponAmmo;                                         // 0x0044   (0x0004)  
	int32_t                                            XPSave;                                                     // 0x0048   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x004C   (0x0004)  MISSED
	FString                                            GamePlaySave;                                               // 0x0050   (0x0010)  
	FTransform                                         T_HomeLoction;                                              // 0x0060   (0x0030)  
	FTransform                                         T_BackGameLoction;                                          // 0x0090   (0x0030)  
	bool                                               KisType45_FlashSight_UnLock_;                               // 0x00C0   (0x0001)  
	bool                                               KisType45_Power_UnLock_;                                    // 0x00C1   (0x0001)  
	bool                                               KisType45_Grenade_UnLock_;                                  // 0x00C2   (0x0001)  
	bool                                               KisType45_CanEquip_;                                        // 0x00C3   (0x0001)  
	bool                                               Metel92_FlashSight_UnLock_;                                 // 0x00C4   (0x0001)  
	bool                                               Metel92_Power_UnLock_;                                      // 0x00C5   (0x0001)  
	bool                                               Metel92_Warning_UnLock_;                                    // 0x00C6   (0x0001)  
	bool                                               Metel92_CanEquip_;                                          // 0x00C7   (0x0001)  
	bool                                               IsFinishNewPlayerSkill_;                                    // 0x00C8   (0x0001)  
	bool                                               Skill_ReduceHit;                                            // 0x00C9   (0x0001)  
	bool                                               Skill_AddSpeed;                                             // 0x00CA   (0x0001)  
	bool                                               Skill_AirFire;                                              // 0x00CB   (0x0001)  
	bool                                               Skill_XPUp;                                                 // 0x00CC   (0x0001)  
	bool                                               Skill_EMP;                                                  // 0x00CD   (0x0001)  
	bool                                               Skill_EMP_QTE1;                                             // 0x00CE   (0x0001)  
	bool                                               Skill_EMP_QTE2;                                             // 0x00CF   (0x0001)  
	bool                                               Skill_Teleport;                                             // 0x00D0   (0x0001)  
	bool                                               Skill_LightSword;                                           // 0x00D1   (0x0001)  
	bool                                               Skill_LightSword_QTE1;                                      // 0x00D2   (0x0001)  
	bool                                               Skill_LightSword_QTE2;                                      // 0x00D3   (0x0001)  
	bool                                               Skill_XChange;                                              // 0x00D4   (0x0001)  
	bool                                               ACP_Super_FlashSight_UnLock_;                               // 0x00D5   (0x0001)  
	bool                                               ACP_Super_Power_UnLock_;                                    // 0x00D6   (0x0001)  
	bool                                               ACP_Super_Grenade_UnLock_;                                  // 0x00D7   (0x0001)  
	bool                                               ACP_Super_CanEquip_;                                        // 0x00D8   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x00D9   (0x0007)  MISSED
	class UClass*                                      PlayerNowWeapon1;                                           // 0x00E0   (0x0008)  
	class UClass*                                      PlayerNowWeapon2;                                           // 0x00E8   (0x0008)  
	int32_t                                            GamePlayID;                                                 // 0x00F0   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x00F4   (0x0004)  MISSED
	FString                                            ShopUIName;                                                 // 0x00F8   (0x0010)  
	bool                                               IsNewPlayer_LightSword_;                                    // 0x0108   (0x0001)  
	bool                                               IsNewPlayer_EMP_;                                           // 0x0109   (0x0001)  
	bool                                               IsNewPlayer_Teleport_;                                      // 0x010A   (0x0001)  
	bool                                               KisType45_OOC_IsOpen_;                                      // 0x010B   (0x0001)  
	bool                                               Metel92_OOC_IsOpen_;                                        // 0x010C   (0x0001)  
	bool                                               ACP_Super_OOC_IsOpen_;                                      // 0x010D   (0x0001)  
	bool                                               IsPlayNewPlayerFlashOC_;                                    // 0x010E   (0x0001)  
	bool                                               IsNewPlayerBlackHome_;                                      // 0x010F   (0x0001)  
	bool                                               NewPlayerFlashOC_Over_;                                     // 0x0110   (0x0001)  
	unsigned char                                      UnknownData03_6[0x3];                                       // 0x0111   (0x0003)  MISSED
	float                                              PlayerFOV;                                                  // 0x0114   (0x0004)  
	bool                                               WeaponHUD_Vis_;                                             // 0x0118   (0x0001)  
	bool                                               Skill_Boom;                                                 // 0x0119   (0x0001)  
	unsigned char                                      UnknownData04_6[0x6];                                       // 0x011A   (0x0006)  MISSED
	class UClass*                                      PlayerNowWeapon3;                                           // 0x0120   (0x0008)  
	class UClass*                                      PlayerNowWeapon9;                                           // 0x0128   (0x0008)  
	TEnumAsByte<VRChapter>                             BM_Chapter;                                                 // 0x0130   (0x0001)  
	bool                                               Skill_Shun;                                                 // 0x0131   (0x0001)  
	bool                                               CR_MingShe;                                                 // 0x0132   (0x0001)  
	bool                                               CR_SuiPian;                                                 // 0x0133   (0x0001)  
	bool                                               CR_Guanzi;                                                  // 0x0134   (0x0001)  
	unsigned char                                      UnknownData05_6[0xB];                                       // 0x0135   (0x000B)  MISSED
	FGamePlaySaveSystem                                GamePlaySaveSystem;                                         // 0x0140   (0x0034)  
	unsigned char                                      UnknownData06_6[0xC];                                       // 0x0174   (0x000C)  MISSED
	int32_t                                            GameWeek;                                                   // 0x0180   (0x0004)  
	int32_t                                            OpenSkillLitNumber;                                         // 0x0184   (0x0004)  
	FString                                            NowLevel;                                                   // 0x0188   (0x0010)  
	bool                                               NewPlayerSkillPressOver_;                                   // 0x0198   (0x0001)  
	unsigned char                                      UnknownData07_6[0x3];                                       // 0x0199   (0x0003)  MISSED
	int32_t                                            ID3_NowAmmo;                                                // 0x019C   (0x0004)  
	int32_t                                            ID3_MaxAmmo;                                                // 0x01A0   (0x0004)  
	int32_t                                            ID3_DefuWeaponAmmo;                                         // 0x01A4   (0x0004)  
	bool                                               HaveEAPlayer_;                                              // 0x01A8   (0x0001)  
	bool                                               IsFinishNewPlayerOpenSkillLit_;                             // 0x01A9   (0x0001)  
	bool                                               IsFinishNewPlayerSkin_;                                     // 0x01AA   (0x0001)  
	unsigned char                                      UnknownData08_6[0x1];                                       // 0x01AB   (0x0001)  MISSED
	float                                              Complete_Time;                                              // 0x01AC   (0x0004)  
	float                                              Style_Time;                                                 // 0x01B0   (0x0004)  
	int32_t                                            HitDamage;                                                  // 0x01B4   (0x0004)  
	int32_t                                            PlayerDead;                                                 // 0x01B8   (0x0004)  
	bool                                               CR_DVD;                                                     // 0x01BC   (0x0001)  
	bool                                               CR_YuShi;                                                   // 0x01BD   (0x0001)  
	bool                                               CR_Ding;                                                    // 0x01BE   (0x0001)  
	bool                                               CR_DogTag;                                                  // 0x01BF   (0x0001)  
	int32_t                                            ScoreWeek;                                                  // 0x01C0   (0x0004)  
	bool                                               IsGameBackMenu_;                                            // 0x01C4   (0x0001)  
	bool                                               IsNewPlayer_LightSwordQTE2_;                                // 0x01C5   (0x0001)  
	unsigned char                                      UnknownData09_6[0x2];                                       // 0x01C6   (0x0002)  MISSED
	int32_t                                            HeadShotNumber;                                             // 0x01C8   (0x0004)  
	int32_t                                            ShanGuo_Mins;                                               // 0x01CC   (0x0004)  
	int32_t                                            ShanGuo_Sec;                                                // 0x01D0   (0x0004)  
	bool                                               ShanGuoFinish_;                                             // 0x01D4   (0x0001)  
	unsigned char                                      UnknownData10_6[0x3];                                       // 0x01D5   (0x0003)  MISSED
	int32_t                                            ID9_DefuWeaponAmmo;                                         // 0x01D8   (0x0004)  
	int32_t                                            ID9_NowAmmo;                                                // 0x01DC   (0x0004)  
	int32_t                                            ID9_MaxAmmo;                                                // 0x01E0   (0x0004)  
	unsigned char                                      UnknownData11_6[0x4];                                       // 0x01E4   (0x0004)  MISSED
	class UClass*                                      PlayerNowWeapon4;                                           // 0x01E8   (0x0008)  
	int32_t                                            ID4_DefuWeaponAmmo;                                         // 0x01F0   (0x0004)  
	int32_t                                            ID4_NowAmmo;                                                // 0x01F4   (0x0004)  
	int32_t                                            ID4_MaxAmmo;                                                // 0x01F8   (0x0004)  
};

/// Class /Game/PlayerBP/Receive/Send_Player.Send_Player_C
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000028) align 8 MaxSize: 0x0028
class USend_Player_C : public UInterface
{ 
public:


	/// Functions
	// Function /Game/PlayerBP/Receive/Send_Player.Send_Player_C.VisWeaponHUD
	// void VisWeaponHUD(bool Vis_);                                                                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Receive/Send_Player.Send_Player_C.ChangeFireModelUI
	// void ChangeFireModelUI(bool VisFitingUI_);                                                                               // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Receive/Send_Player.Send_Player_C.Race_CarDead
	// void Race_CarDead();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Receive/Send_Player.Send_Player_C.Race_CarFirePlayer
	// void Race_CarFirePlayer(float Hit);                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Receive/Send_Player.Send_Player_C.VisQYQ_Tip
	// void VisQYQ_Tip(bool Vis_);                                                                                              // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Receive/Send_Player.Send_Player_C.ReloadWeaponSmoke
	// void ReloadWeaponSmoke();                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Receive/Send_Player.Send_Player_C.HideWeaponRedSight
	// void HideWeaponRedSight();                                                                                               // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Receive/Send_Player.Send_Player_C.VisWeaponRedSight
	// void VisWeaponRedSight();                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/PlayerBP/Blueprints/VRMenuCharacter.VRMenuCharacter_C
/// Size: 0x04F8 (1272 bytes) (0x0004B8 - 0x0004F8) align 16 MaxSize: 0x04F8
class AVRMenuCharacter_C : public ACharacter
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x04B8   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x04C0   (0x0008)  
	class UCameraComponent*                            Camera;                                                     // 0x04C8   (0x0008)  
	SDK_UNDEFINED(16,820) /* FMulticastInlineDelegate */ __um(Click);                                              // 0x04D0   (0x0010)  
	bool                                               IsCanClick_;                                                // 0x04E0   (0x0001)  
	bool                                               IsCanRoller_;                                               // 0x04E1   (0x0001)  
	unsigned char                                      UnknownData01_6[0x6];                                       // 0x04E2   (0x0006)  MISSED
	SDK_UNDEFINED(16,821) /* FMulticastInlineDelegate */ __um(OverClick);                                          // 0x04E8   (0x0010)  


	/// Functions
	// Function /Game/PlayerBP/Blueprints/VRMenuCharacter.VRMenuCharacter_C.InpActEvt_MouseClick_K2Node_InputActionEvent
	// void InpActEvt_MouseClick_K2Node_InputActionEvent(FKey Key);                                                             // [0x148e900] BlueprintEvent       
	// Function /Game/PlayerBP/Blueprints/VRMenuCharacter.VRMenuCharacter_C.ExecuteUbergraph_VRMenuCharacter
	// void ExecuteUbergraph_VRMenuCharacter(int32_t EntryPoint);                                                               // [0x148e900] Final|HasDefaults    
	// Function /Game/PlayerBP/Blueprints/VRMenuCharacter.VRMenuCharacter_C.OverClick__DelegateSignature
	// void OverClick__DelegateSignature();                                                                                     // [0x148e900] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/VRMenuCharacter.VRMenuCharacter_C.Click__DelegateSignature
	// void Click__DelegateSignature();                                                                                         // [0x148e900] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/PlayerBP/Blueprints/AINoises.AINoises_C
/// Size: 0x0298 (664 bytes) (0x000280 - 0x000298) align 8 MaxSize: 0x0298
/// @brief 這個類別是一個專門用來產生噪音以供 AI 感知的 Actor。它繼承自 APawn，使其能與 AI 感知系統良好地互動。
///        通常用於在特定地點製造聲響，以吸引或干擾 AI。
class AAINoises_C : public APawn
{ 
public:
	// --- 藍圖執行相關 ---
	/// @brief 指向藍圖 UberGraph 的框架。這是所有藍圖生成的類別都會有的標準成員，用於管理藍圖事件圖的執行狀態。
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (大小 0x0008)  

	// --- 核心功能元件 ---
	/// @brief Pawn 噪音發射器元件。這是此類別的核心，負責在遊戲世界中產生 AI 可以聽到的噪音事件。
	class UPawnNoiseEmitterComponent*                  PawnNoiseEmitter;                                           // 0x0288   (大小 0x0008)  
	
	// --- 場景元件 ---
	/// @brief 預設的場景根元件。每個 Actor 都需要一個根元件來確定其在世界中的位置、旋轉和縮放。
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0290   (大小 0x0008)  


	/// @brief 函數區段
	// Function /Game/PlayerBP/Blueprints/AINoises.AINoises_C.ReceiveBeginPlay
	/// @brief 當此 Actor 被生成到遊戲世界並開始運行時會被呼叫的事件。對應藍圖中的 "Event BeginPlay" 節點。
	/// @note 是一個事件（Event）、受保護的（Protected）、藍圖事件（BlueprintEvent）。
	void ReceiveBeginPlay();                                                                                                 
	
	// Function /Game/PlayerBP/Blueprints/AINoises.AINoises_C.ExecuteUbergraph_AINoises
	/// @brief 執行此藍圖 UberGraph 的主要函數。所有藍圖的事件和邏輯最終都由這個函數驅動。
	/// @param EntryPoint 是一個整數，用來標示執行流程的入口點。
	/// @note 是最終的（Final），不可被覆寫。
	void ExecuteUbergraph_AINoises(int32_t EntryPoint);                                                                      
};

/// Class /Game/PlayerBP/Blueprints/BMIHUD.BMIHUD_C
/// Size: 0x0398 (920 bytes) (0x000310 - 0x000398) align 8 MaxSize: 0x0398
class ABMIHUD_C : public AHUD
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0310   (0x0008)  
	class UShouLeisComponent_C*                        ShouLeisComponent;                                          // 0x0318   (0x0008)  
	class USwingComponent_C*                           SwingComponent;                                             // 0x0320   (0x0008)  
	class UMissionComponent_C*                         MissionComponent;                                           // 0x0328   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0330   (0x0008)  
	class USaveGame*                                   savePlayerSubClass;                                         // 0x0338   (0x0008)  
	FString                                            VRSave;                                                     // 0x0340   (0x0010)  
	bool                                               DisplayMouse_;                                              // 0x0350   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0351   (0x0003)  MISSED
	float                                              Add_SkillHUD_XLoc;                                          // 0x0354   (0x0004)  
	float                                              Add_CombieHUD_XLoc;                                         // 0x0358   (0x0004)  
	float                                              Add_SkillTipHUD_XLoc;                                       // 0x035C   (0x0004)  
	float                                              Mouse_Scale;                                                // 0x0360   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0364   (0x0004)  MISSED
	class UMaterialInterface*                          Mouse_Mat;                                                  // 0x0368   (0x0008)  
	class UCrosshair_UMG_C*                            CrossHair;                                                  // 0x0370   (0x0008)  
	class UBMI_Player_UMG_C*                           PlayerUI_UMG;                                               // 0x0378   (0x0008)  
	class UScrenHUD_UMG_C*                             PlayerHealthUMG;                                            // 0x0380   (0x0008)  
	class UTestShuiYin_UMG_C*                          ShuiYin;                                                    // 0x0388   (0x0008)  
	class UBMI_FPS_UMG_C*                              FPSUMG;                                                     // 0x0390   (0x0008)  


	/// Functions
	// Function /Game/PlayerBP/Blueprints/BMIHUD.BMIHUD_C.WeaponAdd_HUDLoc
	// void WeaponAdd_HUDLoc(bool Add_);                                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIHUD.BMIHUD_C.ChangeGamePad
	// void ChangeGamePad(bool IsGamePad_);                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIHUD.BMIHUD_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x148e900] Event|Protected|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIHUD.BMIHUD_C.ReceiveDrawHUD
	// void ReceiveDrawHUD(int32_t SizeX, int32_t SizeY);                                                                       // [0x148e900] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIHUD.BMIHUD_C.UpDataKeyUITex
	// void UpDataKeyUITex();                                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIHUD.BMIHUD_C.VisFPS
	// void VisFPS();                                                                                                           // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIHUD.BMIHUD_C.HideFPS
	// void HideFPS();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIHUD.BMIHUD_C.ExecuteUbergraph_BMIHUD
	// void ExecuteUbergraph_BMIHUD(int32_t EntryPoint);                                                                        // [0x148e900] Final                
};

/// Class /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C
/// Size: 0x0621 (1569 bytes) (0x000570 - 0x000621) align 8 MaxSize: 0x0621
/// @brief 總大小: 0x0621 (1569 字節) (從 0x000570 到 0x000621)，8字節對齊，最大大小: 0x0621
/// @brief 這個類別是遊戲的玩家控制器，繼承自 APlayerController。它負責處理玩家輸入、管理UI介面以及其他玩家特定的功能。
class ABMIPlayerController_C : public APlayerController
{ 
public:
	// --- 藍圖執行與核心元件 ---
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0570   (大小 0x0008) - 管理藍圖事件圖執行的框架，是藍圖生成類別的標準成員。
	bool                                               IsPause_;                                                   // 0x0578   (大小 0x0001) - 標記遊戲當前是否處於暫停狀態。
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0579   (大小 0x0007) - 未知資料 / 記憶體對齊填充。
	class UWidgetInteractionComponent*                 Interaction;                                                // 0x0580   (大小 0x0008) - Widget 互動元件，允許玩家在遊戲世界中與UI元素進行互動（例如點擊3D選單）。

	// --- 遊戲狀態與流程控制 ---
	bool                                               IsMainMenu_;                                                // 0x0588   (大小 0x0001) - 標記當前是否在主選單場景。
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0589   (大小 0x0007) - 未知資料 / 記憶體對齊填充。
	SDK_UNDEFINED(16,822) /* FMulticastInlineDelegate */ __um(BackTop);                                            // 0x0590   (大小 0x0010) - 一個多播委託，可能用於廣播“返回”或“回到頂部”的事件給UI或其他系統。
	bool                                               CanPress_;                                                  // 0x05A0   (大小 0x0001) - 標記玩家當前是否可以進行按鍵操作，用於在過場動畫等情境下禁用輸入。
	
	// --- 輸入裝置相關 ---
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x05A1   (大小 0x0003) - 未知資料 / 記憶體對齊填充。
	int32_t                                            Mouse_X;                                                    // 0x05A4   (大小 0x0004) - 滑鼠的 X 座標。
	int32_t                                            Mouse_Y;                                                    // 0x05A8   (大小 0x0004) - 滑鼠的 Y 座標。
	bool                                               IsGamePad_;                                                 // 0x05AC   (大小 0x0001) - 標記當前是否正在使用遊戲手把。
	unsigned char                                      UnknownData03_6[0x3];                                       // 0x05AD   (大小 0x0003) - 未知資料 / 記憶體對齊填充。
	int32_t                                            Mouse_MoveRate;                                             // 0x05B0   (大小 0x0004) - 滑鼠移動速率/靈敏度設定。
	int32_t                                            Mouse__MoveRate;                                            // 0x05B4   (大小 0x0004) - 另一個滑鼠移動速率/靈敏度設定。
	float                                              TickTime;                                                   // 0x05B8   (大小 0x0004) - 可能用於儲存每幀的間隔時間（Delta Time）或用於計時。
	int32_t                                            ResX;                                                       // 0x05BC   (大小 0x0004) - 螢幕解析度的寬度。
	int32_t                                            ResY;                                                       // 0x05C0   (大小 0x0004) - 螢幕解析度的高度。

	// --- 遊戲性與UI狀態 ---
	bool                                               ShanGuo_;                                                   // 0x05C4   (大小 0x0001) - 可能與“閃過”或“閃避”動作相關的狀態標記。
	bool                                               IsForceNewPlayerUI;                                         // 0x05C5   (大小 0x0001) - 是否強制顯示新手教學UI。
	unsigned char                                      UnknownData04_6[0x2];                                       // 0x05C6   (大小 0x0002) - 未知資料 / 記憶體對齊填充。
	class UBMI_AbilityMenu_UMG_C*                      BMI_AbilityMenu_UMG;                                        // 0x05C8   (大小 0x0008) - 對技能/能力選單UI Widget的引用。
	bool                                               OpenPauseUI_;                                               // 0x05D0   (大小 0x0001) - 標記暫停選單是否已開啟。
	bool                                               OpenSkillUI_;                                               // 0x05D1   (大小 0x0001) - 標記技能選單是否已開啟。
	bool                                               IsSkillShopNewPlayerUIVis_;                                 // 0x05D2   (大小 0x0001) - 標記新手技能商店UI是否可見。
	bool                                               IsKeyBindUI_;                                               // 0x05D3   (大小 0x0001) - 標記按鍵綁定UI是否已開啟。
	bool                                               LR_IsPress_;                                                // 0x05D4   (大小 0x0001) - 可能標記左/右鍵是否被按下。
	bool                                               IsNewPlayerTip_;                                            // 0x05D5   (大小 0x0001) - 標記新手提示是否正在顯示。
	unsigned char                                      UnknownData05_6[0x2];                                       // 0x05D6   (大小 0x0002) - 未知資料 / 記憶體對齊填充。
	class UBMI_PauseMenu_UMG_C*                        PauseMenu;                                                  // 0x05D8   (大小 0x0008) - 對暫停選單UI Widget的引用。
	bool                                               CanPressMenu_;                                              // 0x05E0   (大小 0x0001) - 標記玩家當前是否可以開啟選單。
	bool                                               IsPauseCG_;                                                 // 0x05E1   (大小 0x0001) - 標記是否因為過場動畫（CG）而暫停。
	unsigned char                                      UnknownData06_6[0x6];                                       // 0x05E2   (大小 0x0006) - 未知資料 / 記憶體對齊填充。

	// --- 玩家資料與其他UI引用 ---
	class UBMI_Skin_C*                                 As_BMI_Skin;                                                // 0x05E8   (大小 0x0008) - 對玩家外觀存檔物件的引用。
	bool                                               Consoles_Tip_;                                              // 0x05F0   (大小 0x0001) - 可能與遊戲主機或遊戲內控制台相關的提示是否顯示。
	unsigned char                                      UnknownData07_6[0x7];                                       // 0x05F1   (大小 0x0007) - 未知資料 / 記憶體對齊填充。
	class UUserWidget*                                 Consoles_UMG;                                               // 0x05F8   (大小 0x0008) - 對控制台UI Widget的引用。
	bool                                               Consoles_BackToMenu_Tip_;                                   // 0x0600   (大小 0x0001) - 標記控制台UI中的“返回選單”提示是否顯示。
	unsigned char                                      UnknownData08_6[0x7];                                       // 0x0601   (大小 0x0007) - 未知資料 / 記憶體對齊填充。
	class UBMI_Subtitles_UMG_C*                        Subtitles_UMG;                                              // 0x0608   (大小 0x0008) - 對字幕UI Widget的引用。
	bool                                               GamePad_CanUseShun_;                                        // 0x0610   (大小 0x0001) - 標記在使用手把時是否可以使用“瞬”移或閃現技能。
	unsigned char                                      UnknownData09_6[0x7];                                       // 0x0611   (大小 0x0007) - 未知資料 / 記憶體對齊填充。
	class UBMI_MainMenu_UMG_C*                         BMI_Menu_UMG;                                               // 0x0618   (大小 0x0008) - 對主選單UI Widget的引用。
	bool                                               IsTPS_;                                                     // 0x0620   (大小 0x0001) - 標記是否為第三人稱射擊（Third-Person Shooter）模式。

	/// Functions
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.InpActEvt_StartGameClick_K2Node_InputActionEvent
	// void InpActEvt_StartGameClick_K2Node_InputActionEvent(FKey Key);                                                         // [0x148e900] BlueprintEvent       
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.InpActEvt_AnyKey_K2Node_InputKeyEvent
	// void InpActEvt_AnyKey_K2Node_InputKeyEvent(FKey Key);                                                                    // [0x148e900] BlueprintEvent       
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.InpActEvt_RightMouseButton_K2Node_InputKeyEvent
	// void InpActEvt_RightMouseButton_K2Node_InputKeyEvent(FKey Key);                                                          // [0x148e900] BlueprintEvent       
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.InpActEvt_Gamepad_FaceButton_Bottom_K2Node_InputKeyEvent
	// void InpActEvt_Gamepad_FaceButton_Bottom_K2Node_InputKeyEvent(FKey Key);                                                 // [0x148e900] BlueprintEvent       
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.InpActEvt_Gamepad_LeftShoulder_K2Node_InputKeyEvent
	// void InpActEvt_Gamepad_LeftShoulder_K2Node_InputKeyEvent(FKey Key);                                                      // [0x148e900] BlueprintEvent       
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.InpActEvt_Gamepad_RightShoulder_K2Node_InputKeyEvent
	// void InpActEvt_Gamepad_RightShoulder_K2Node_InputKeyEvent(FKey Key);                                                     // [0x148e900] BlueprintEvent       
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.InpActEvt_SkillShop_K2Node_InputActionEvent
	// void InpActEvt_SkillShop_K2Node_InputActionEvent(FKey Key);                                                              // [0x148e900] BlueprintEvent       
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.InpActEvt_RestKeyDefeaut_K2Node_InputActionEvent
	// void InpActEvt_RestKeyDefeaut_K2Node_InputActionEvent(FKey Key);                                                         // [0x148e900] BlueprintEvent       
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent
	// void InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent(FKey Key);                                                  // [0x148e900] BlueprintEvent       
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.InpActEvt_Gamepad_FaceButton_Left_K2Node_InputKeyEvent
	// void InpActEvt_Gamepad_FaceButton_Left_K2Node_InputKeyEvent(FKey Key);                                                   // [0x148e900] BlueprintEvent       
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.InpActEvt_Gamepad_Special_Left_K2Node_InputKeyEvent
	// void InpActEvt_Gamepad_Special_Left_K2Node_InputKeyEvent(FKey Key);                                                      // [0x148e900] BlueprintEvent       
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnFailure_44DDE79E484E53E10B276596E3F50B04
	// void OnFailure_44DDE79E484E53E10B276596E3F50B04(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnSuccess_44DDE79E484E53E10B276596E3F50B04
	// void OnSuccess_44DDE79E484E53E10B276596E3F50B04(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnFailure_528863BE43153D86E65608A43E08FEE7
	// void OnFailure_528863BE43153D86E65608A43E08FEE7(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnSuccess_528863BE43153D86E65608A43E08FEE7
	// void OnSuccess_528863BE43153D86E65608A43E08FEE7(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnFailure_5D18F5DE49D8C4F7C3B552A23301B029
	// void OnFailure_5D18F5DE49D8C4F7C3B552A23301B029();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnSuccess_5D18F5DE49D8C4F7C3B552A23301B029
	// void OnSuccess_5D18F5DE49D8C4F7C3B552A23301B029();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnFailure_8328537148D48785BCF0108FA1E32C1D
	// void OnFailure_8328537148D48785BCF0108FA1E32C1D();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnSuccess_8328537148D48785BCF0108FA1E32C1D
	// void OnSuccess_8328537148D48785BCF0108FA1E32C1D();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Completed_FE1CE7414F1AAE18D747CB8D3E15B5E8
	// void Completed_FE1CE7414F1AAE18D747CB8D3E15B5E8(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Completed_C3A95DD64EE6F5F775FEF6A55444629B
	// void Completed_C3A95DD64EE6F5F775FEF6A55444629B(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Completed_1B31964346688A742B9344AD0FEDB5E3
	// void Completed_1B31964346688A742B9344AD0FEDB5E3(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Completed_E19D6E52477CC8E44E5ACA9B6CFEE4F1
	// void Completed_E19D6E52477CC8E44E5ACA9B6CFEE4F1(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnFailure_821B8D2F42ED0009E2B4D1B1DAACD1D2
	// void OnFailure_821B8D2F42ED0009E2B4D1B1DAACD1D2(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnSuccess_821B8D2F42ED0009E2B4D1B1DAACD1D2
	// void OnSuccess_821B8D2F42ED0009E2B4D1B1DAACD1D2(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnFailure_6A63133B4BDAF9E0C95E01BA1EE598C9
	// void OnFailure_6A63133B4BDAF9E0C95E01BA1EE598C9(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnSuccess_6A63133B4BDAF9E0C95E01BA1EE598C9
	// void OnSuccess_6A63133B4BDAF9E0C95E01BA1EE598C9(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnFailure_C5DC18BC4EA07024DB9E21A68E387A10
	// void OnFailure_C5DC18BC4EA07024DB9E21A68E387A10();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnSuccess_C5DC18BC4EA07024DB9E21A68E387A10
	// void OnSuccess_C5DC18BC4EA07024DB9E21A68E387A10();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnFailure_8B8A5D614A5C5D38D035D9962EE7A4AE
	// void OnFailure_8B8A5D614A5C5D38D035D9962EE7A4AE();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnSuccess_8B8A5D614A5C5D38D035D9962EE7A4AE
	// void OnSuccess_8B8A5D614A5C5D38D035D9962EE7A4AE();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Completed_E58B91C44F3617FB899DD0BB3CE0ACF7
	// void Completed_E58B91C44F3617FB899DD0BB3CE0ACF7(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Completed_322D455E4E43F957499F57A0224FC717
	// void Completed_322D455E4E43F957499F57A0224FC717(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Completed_78511A194CEB7C5731AC6BB1AA86CDE6
	// void Completed_78511A194CEB7C5731AC6BB1AA86CDE6(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Completed_AF158D6E4F5F6468AE57B78339912953
	// void Completed_AF158D6E4F5F6468AE57B78339912953(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Completed_C2EF686B46650D686A0831955FDDBE87
	// void Completed_C2EF686B46650D686A0831955FDDBE87(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnFailure_F183473F492D659D7F24E0BCF2B79785
	// void OnFailure_F183473F492D659D7F24E0BCF2B79785(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnSuccess_F183473F492D659D7F24E0BCF2B79785
	// void OnSuccess_F183473F492D659D7F24E0BCF2B79785(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnFailure_99D06F5147CA8DC18B22B1A249B45DE2
	// void OnFailure_99D06F5147CA8DC18B22B1A249B45DE2(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnSuccess_99D06F5147CA8DC18B22B1A249B45DE2
	// void OnSuccess_99D06F5147CA8DC18B22B1A249B45DE2(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnFailure_1090F32E4857AF399DD6D382D8DC2004
	// void OnFailure_1090F32E4857AF399DD6D382D8DC2004();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnSuccess_1090F32E4857AF399DD6D382D8DC2004
	// void OnSuccess_1090F32E4857AF399DD6D382D8DC2004();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnFailure_20D48013466C9FDB336B7D84B5E3BA39
	// void OnFailure_20D48013466C9FDB336B7D84B5E3BA39();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnSuccess_20D48013466C9FDB336B7D84B5E3BA39
	// void OnSuccess_20D48013466C9FDB336B7D84B5E3BA39();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Completed_9DD7835A470B231C45FAB1A299142E53
	// void Completed_9DD7835A470B231C45FAB1A299142E53(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Completed_9A58C5634D1F23A7BA73BEA84BD88BE0
	// void Completed_9A58C5634D1F23A7BA73BEA84BD88BE0(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Completed_074A10E947C251A4A0594FAA4DC682E8
	// void Completed_074A10E947C251A4A0594FAA4DC682E8(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnFailure_21A23AFA429B79E31C94118F4CB86834
	// void OnFailure_21A23AFA429B79E31C94118F4CB86834(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnSuccess_21A23AFA429B79E31C94118F4CB86834
	// void OnSuccess_21A23AFA429B79E31C94118F4CB86834(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnFailure_C80EE15845BEFFAC7751F2B6A7D8ECFF
	// void OnFailure_C80EE15845BEFFAC7751F2B6A7D8ECFF(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnSuccess_C80EE15845BEFFAC7751F2B6A7D8ECFF
	// void OnSuccess_C80EE15845BEFFAC7751F2B6A7D8ECFF(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnFailure_FA91B1834F8672084C1FBEBC94FEBF94
	// void OnFailure_FA91B1834F8672084C1FBEBC94FEBF94();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnSuccess_FA91B1834F8672084C1FBEBC94FEBF94
	// void OnSuccess_FA91B1834F8672084C1FBEBC94FEBF94();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnFailure_1B21A4CE43031E64AAFD77B0D7531BF2
	// void OnFailure_1B21A4CE43031E64AAFD77B0D7531BF2();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnSuccess_1B21A4CE43031E64AAFD77B0D7531BF2
	// void OnSuccess_1B21A4CE43031E64AAFD77B0D7531BF2();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Completed_CA33501E40B1F6E0B790DBA1F0D64020
	// void Completed_CA33501E40B1F6E0B790DBA1F0D64020(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Completed_700A70E1450212E1AADD79B44143318E
	// void Completed_700A70E1450212E1AADD79B44143318E(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Completed_8011E48D4A9E20AF3E03F380AED7C523
	// void Completed_8011E48D4A9E20AF3E03F380AED7C523(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnFailure_450B2A3B4D62958BBEBD989EB6B6FE29
	// void OnFailure_450B2A3B4D62958BBEBD989EB6B6FE29(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnSuccess_450B2A3B4D62958BBEBD989EB6B6FE29
	// void OnSuccess_450B2A3B4D62958BBEBD989EB6B6FE29(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnFailure_AA561A0E4C7F8F08DD33D6A09245740F
	// void OnFailure_AA561A0E4C7F8F08DD33D6A09245740F(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnSuccess_AA561A0E4C7F8F08DD33D6A09245740F
	// void OnSuccess_AA561A0E4C7F8F08DD33D6A09245740F(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnFailure_1B921A144E158DAD0A4B8B8B4D60538C
	// void OnFailure_1B921A144E158DAD0A4B8B8B4D60538C();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnSuccess_1B921A144E158DAD0A4B8B8B4D60538C
	// void OnSuccess_1B921A144E158DAD0A4B8B8B4D60538C();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnFailure_E213E8B944B659E79A08D9A4CF3B29A6
	// void OnFailure_E213E8B944B659E79A08D9A4CF3B29A6();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.OnSuccess_E213E8B944B659E79A08D9A4CF3B29A6
	// void OnSuccess_E213E8B944B659E79A08D9A4CF3B29A6();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Completed_722FEAF54810C02A34BC599A122E3A73
	// void Completed_722FEAF54810C02A34BC599A122E3A73(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Completed_D4B88BA5436CE93036ED9BBFB738F7F6
	// void Completed_D4B88BA5436CE93036ED9BBFB738F7F6(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Completed_8CC2E63C438BB001EBF2B0AFF1C239C3
	// void Completed_8CC2E63C438BB001EBF2B0AFF1C239C3(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Completed_20BC4AAC42D781A663ABBD80DE3EC68C
	// void Completed_20BC4AAC42D781A663ABBD80DE3EC68C(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Completed_08870BF142791EDE899B418F435A8568
	// void Completed_08870BF142791EDE899B418F435A8568(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.InpActEvt_Gamepad_RightThumbstick_K2Node_InputKeyEvent
	// void InpActEvt_Gamepad_RightThumbstick_K2Node_InputKeyEvent(FKey Key);                                                   // [0x148e900] BlueprintEvent       
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.InpActEvt_Gamepad_DPad_Up_K2Node_InputKeyEvent
	// void InpActEvt_Gamepad_DPad_Up_K2Node_InputKeyEvent(FKey Key);                                                           // [0x148e900] BlueprintEvent       
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.InpActEvt_Gamepad_DPad_Down_K2Node_InputKeyEvent
	// void InpActEvt_Gamepad_DPad_Down_K2Node_InputKeyEvent(FKey Key);                                                         // [0x148e900] BlueprintEvent       
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.InpActEvt_Gamepad_DPad_Right_K2Node_InputKeyEvent
	// void InpActEvt_Gamepad_DPad_Right_K2Node_InputKeyEvent(FKey Key);                                                        // [0x148e900] BlueprintEvent       
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.InpActEvt_Gamepad_DPad_Left_K2Node_InputKeyEvent
	// void InpActEvt_Gamepad_DPad_Left_K2Node_InputKeyEvent(FKey Key);                                                         // [0x148e900] BlueprintEvent       
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Far_SettingTwoStart_Anim
	// void Far_SettingTwoStart_Anim();                                                                                         // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Far_FOV110_Event
	// void Far_FOV110_Event();                                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Far_UpDateControl
	// void Far_UpDateControl();                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Far_CloseAA
	// void Far_CloseAA();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Far_OpenAA
	// void Far_OpenAA();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Far_CloseForceNewPlayerUI
	// void Far_CloseForceNewPlayerUI();                                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Far_DLSSON
	// void Far_DLSSON();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Far_DLSS-1
	// void Far_DLSS_1();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Far_Dlss0
	// void Far_Dlss0();                                                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Far_Dlss1
	// void Far_Dlss1();                                                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.FarDlss2
	// void FarDlss2();                                                                                                         // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Far_DLSSOFF
	// void Far_DLSSOFF();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.ChangeGamePad
	// void ChangeGamePad(bool IsGamePad_);                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.UpDataKeyUITex
	// void UpDataKeyUITex();                                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.UnPause
	// void UnPause();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.UpDateUserInput
	// void UpDateUserInput();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.UpDatePause
	// void UpDatePause();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Create_ForceNewPlayer
	// void Create_ForceNewPlayer(class UClass* UMG, int32_t CloseTip_);                                                        // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.InpAxisKeyEvt_Gamepad_LeftY_K2Node_InputAxisKeyEvent
	// void InpAxisKeyEvt_Gamepad_LeftY_K2Node_InputAxisKeyEvent(float AxisValue);                                              // [0x148e900] BlueprintEvent       
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.ForceCloseSkillShopTip
	// void ForceCloseSkillShopTip();                                                                                           // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.InpAxisKeyEvt_Gamepad_LeftX_K2Node_InputAxisKeyEvent
	// void InpAxisKeyEvt_Gamepad_LeftX_K2Node_InputAxisKeyEvent(float AxisValue);                                              // [0x148e900] BlueprintEvent       
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.RestKeyButton_Event
	// void RestKeyButton_Event();                                                                                              // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.CloseAbilityShop
	// void CloseAbilityShop();                                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.BackToTop
	// void BackToTop();                                                                                                        // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.UpData_ChengJiu
	// void UpData_ChengJiu();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x148e900] Event|Protected|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.Change_ConsolesUser
	// void Change_ConsolesUser();                                                                                              // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.LoginStatusChange
	// void LoginStatusChange(int32_t LocalUserNum, EOnlineLoginStatus OldStatus, EOnlineLoginStatus NewStatus, FUniqueNetIdRepl NewId); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.CreateSub
	// void CreateSub();                                                                                                        // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.RemoveSubEvent
	// void RemoveSubEvent();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.C
	// void C(bool IsConnected);                                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.BindXBOXLogin
	// void BindXBOXLogin();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.UpDatePlatform
	// void UpDatePlatform();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.ExecuteUbergraph_BMIPlayerController
	// void ExecuteUbergraph_BMIPlayerController(int32_t EntryPoint);                                                           // [0x148e900] Final|HasDefaults    
	// Function /Game/PlayerBP/Blueprints/BMIPlayerController.BMIPlayerController_C.BackTop__DelegateSignature
	// void BackTop__DelegateSignature();                                                                                       // [0x148e900] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/PlayerBP/Receive/Send_GamePad.Send_GamePad_C
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000028) align 8 MaxSize: 0x0028
class USend_GamePad_C : public UInterface
{ 
public:


	/// Functions
	// Function /Game/PlayerBP/Receive/Send_GamePad.Send_GamePad_C.UpDataKeyUITex
	// void UpDataKeyUITex();                                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Receive/Send_GamePad.Send_GamePad_C.ChangeGamePad
	// void ChangeGamePad(bool IsGamePad_);                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/PlayerBP/Blueprints/DamageType_Sword.DamageType_Sword_C
/// Size: 0x0040 (64 bytes) (0x000040 - 0x000040) align 8 MaxSize: 0x0040
class UDamageType_Sword_C : public UDamageType
{ 
public:
};

/// Class /Game/PlayerBP/Blueprints/BMICamera.BMICamera_C
/// Size: 0x2ED8 (11992 bytes) (0x002ED0 - 0x002ED8) align 16 MaxSize: 0x2ED8
class ABMICamera_C : public APlayerCameraManager
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x2ED0   (0x0008)  


	/// Functions
	// Function /Game/PlayerBP/Blueprints/BMICamera.BMICamera_C.PlayerHuaDown
	// void PlayerHuaDown(bool IsLock_);                                                                                        // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMICamera.BMICamera_C.PlayerUpLight
	// void PlayerUpLight(bool IsUpLight);                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMICamera.BMICamera_C.PlayerJumpAttack
	// void PlayerJumpAttack(bool IsJumpAttack);                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMICamera.BMICamera_C.LockView
	// void LockView(bool IsLock_);                                                                                             // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMICamera.BMICamera_C.PlayerXuLiAttack
	// void PlayerXuLiAttack(bool IsJumpAttack);                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMICamera.BMICamera_C.PlayerQYQ
	// void PlayerQYQ(bool IsQYQ);                                                                                              // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMICamera.BMICamera_C.PlayerClimb
	// void PlayerClimb(bool IsClimb);                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMICamera.BMICamera_C.Play_Huachan
	// void Play_Huachan(bool IsHuachan);                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMICamera.BMICamera_C.Play_MeleePower
	// void Play_MeleePower(bool IsMeleePower);                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMICamera.BMICamera_C.Play_Climb
	// void Play_Climb(bool IsClimb);                                                                                           // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMICamera.BMICamera_C.Play_LeftRunWall
	// void Play_LeftRunWall(bool IsLeftRunWall);                                                                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMICamera.BMICamera_C.Play_RightRunWall
	// void Play_RightRunWall(bool IsRightRunWall);                                                                             // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMICamera.BMICamera_C.NewPlayerCamera
	// void NewPlayerCamera(bool IsLock_);                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMICamera.BMICamera_C.Play_MeleePowerAir
	// void Play_MeleePowerAir(bool IsHuachan);                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMICamera.BMICamera_C.TPSView
	// void TPSView(bool TPS_);                                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMICamera.BMICamera_C.ExecuteUbergraph_BMICamera
	// void ExecuteUbergraph_BMICamera(int32_t EntryPoint);                                                                     // [0x148e900] Final                
};

/// Class /Game/PlayerBP/ReceiveBMI/Send_Menu.Send_Menu_C
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000028) align 8 MaxSize: 0x0028
class USend_Menu_C : public UInterface
{ 
public:


	/// Functions
	// Function /Game/PlayerBP/ReceiveBMI/Send_Menu.Send_Menu_C.UpData_NowSkinSelect
	// void UpData_NowSkinSelect();                                                                                             // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_Menu.Send_Menu_C.ChangeHand
	// void ChangeHand();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_Menu.Send_Menu_C.BackToTop
	// void BackToTop();                                                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_Menu.Send_Menu_C.UpData_MainMenuSkin
	// void UpData_MainMenuSkin();                                                                                              // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_Menu.Send_Menu_C.GamePad_B
	// void GamePad_B();                                                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_Menu.Send_Menu_C.GamePad_A
	// void GamePad_A();                                                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_Menu.Send_Menu_C.GamePad_RightSelect
	// void GamePad_RightSelect();                                                                                              // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_Menu.Send_Menu_C.GamePad_LeftSelect
	// void GamePad_LeftSelect();                                                                                               // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_Menu.Send_Menu_C.UpData_CrashKey
	// void UpData_CrashKey(FText KeyName);                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_Menu.Send_Menu_C.GamePad_RBSelect
	// void GamePad_RBSelect();                                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_Menu.Send_Menu_C.GamePad_LBSelect
	// void GamePad_LBSelect();                                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_Menu.Send_Menu_C.GamePad_DownSelect
	// void GamePad_DownSelect();                                                                                               // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_Menu.Send_Menu_C.GamePad_UpSelect
	// void GamePad_UpSelect();                                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_Menu.Send_Menu_C.UpData_NowSelect
	// void UpData_NowSelect();                                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/ReceiveBMI/Send_Menu.Send_Menu_C.UpData_Ability
	// void UpData_Ability(class UBMI_Save_C* BMISave);                                                                         // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/PlayerBP/Blueprints/BMI_Save.BMI_Save_C
/// Size: 0x0198 (408 bytes) (0x000028 - 0x000198) align 16 MaxSize: 0x0198
class UBMI_Save_C : public USaveGame
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x0028   (0x0008)  MISSED
	FGamePlaySaveSystem                                GamePlaySaveSystem;                                         // 0x0030   (0x0034)  
	unsigned char                                      UnknownData01_6[0xC];                                       // 0x0064   (0x000C)  MISSED
	FString                                            NowLevel;                                                   // 0x0070   (0x0010)  
	FString                                            Cache_NowLevel;                                             // 0x0080   (0x0010)  
	bool                                               IsKillBoss_;                                                // 0x0090   (0x0001)  
	bool                                               VEPR_Fiting_;                                               // 0x0091   (0x0001)  
	bool                                               GER_Fiting_;                                                // 0x0092   (0x0001)  
	bool                                               META_Fiting_;                                               // 0x0093   (0x0001)  
	bool                                               IOPR_Fiting_;                                               // 0x0094   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x0095   (0x0003)  MISSED
	int32_t                                            ID1_NowAmmo;                                                // 0x0098   (0x0004)  
	int32_t                                            ID1_MaxAmmo;                                                // 0x009C   (0x0004)  
	int32_t                                            ID1_DefuWeaponAmmo;                                         // 0x00A0   (0x0004)  
	int32_t                                            ID2_NowAmmo;                                                // 0x00A4   (0x0004)  
	int32_t                                            ID2_MaxAmmo;                                                // 0x00A8   (0x0004)  
	int32_t                                            ID2_DefuWeaponAmmo;                                         // 0x00AC   (0x0004)  
	int32_t                                            ID3_NowAmmo;                                                // 0x00B0   (0x0004)  
	int32_t                                            ID3_MaxAmmo;                                                // 0x00B4   (0x0004)  
	int32_t                                            ID3_DefuWeaponAmmo;                                         // 0x00B8   (0x0004)  
	int32_t                                            ID9_DefuWeaponAmmo;                                         // 0x00BC   (0x0004)  
	int32_t                                            ID9_NowAmmo;                                                // 0x00C0   (0x0004)  
	int32_t                                            ID9_MaxAmmo;                                                // 0x00C4   (0x0004)  
	int32_t                                            ID4_DefuWeaponAmmo;                                         // 0x00C8   (0x0004)  
	int32_t                                            ID4_NowAmmo;                                                // 0x00CC   (0x0004)  
	int32_t                                            ID4_MaxAmmo;                                                // 0x00D0   (0x0004)  
	int32_t                                            ID1_SP_NowAmmo;                                             // 0x00D4   (0x0004)  
	int32_t                                            ID1SPAMMO_Cache;                                            // 0x00D8   (0x0004)  
	int32_t                                            ID2_SP_NowAmmo;                                             // 0x00DC   (0x0004)  
	int32_t                                            ID2SPAMMO_Cache;                                            // 0x00E0   (0x0004)  
	int32_t                                            ID3_SP_NowAmmo;                                             // 0x00E4   (0x0004)  
	int32_t                                            ID3SPAMMO_Cache;                                            // 0x00E8   (0x0004)  
	int32_t                                            ID4_SP_NowAmmo;                                             // 0x00EC   (0x0004)  
	int32_t                                            ID4SPAMMO_Cache;                                            // 0x00F0   (0x0004)  
	bool                                               BMI_NP_PickUpSPAmmo_;                                       // 0x00F4   (0x0001)  
	bool                                               BMI_NP_PickUpYuXi_;                                         // 0x00F5   (0x0001)  
	bool                                               BMI_NP_PickUpSLZ_DiRen_;                                    // 0x00F6   (0x0001)  
	bool                                               Get_GER_;                                                   // 0x00F7   (0x0001)  
	bool                                               Get_Meta_;                                                  // 0x00F8   (0x0001)  
	bool                                               Get_IOPR_;                                                  // 0x00F9   (0x0001)  
	bool                                               Get_VEPR_;                                                  // 0x00FA   (0x0001)  
	unsigned char                                      UnknownData03_6[0x1];                                       // 0x00FB   (0x0001)  MISSED
	int32_t                                            Skill_YuXi_Number;                                          // 0x00FC   (0x0004)  
	int32_t                                            Skill_SLZ_Number;                                           // 0x0100   (0x0004)  
	bool                                               Skill_UnLock_EMP_;                                          // 0x0104   (0x0001)  
	bool                                               Skill_UnLock_EMP_A_;                                        // 0x0105   (0x0001)  
	bool                                               Skill_UnLock_EMP_B_;                                        // 0x0106   (0x0001)  
	bool                                               Skill_UnLock_EMP_C_;                                        // 0x0107   (0x0001)  
	bool                                               Skill_UnLock_QYQAI_;                                        // 0x0108   (0x0001)  
	bool                                               Skill_UnLock_QYQAI_A_;                                      // 0x0109   (0x0001)  
	bool                                               Skill_UnLock_QYQAI_B_;                                      // 0x010A   (0x0001)  
	bool                                               Skill_UnLock_QYQAI_C_;                                      // 0x010B   (0x0001)  
	bool                                               Skill_UnLock_MeleePower_;                                   // 0x010C   (0x0001)  
	bool                                               Skill_UnLock_MeleePower_A_;                                 // 0x010D   (0x0001)  
	bool                                               Skill_UnLock_MeleePower_B_;                                 // 0x010E   (0x0001)  
	bool                                               Skill_UnLock_MeleePower_C_;                                 // 0x010F   (0x0001)  
	bool                                               Skill_UnLock_AirMelee_;                                     // 0x0110   (0x0001)  
	bool                                               Skill_UnLock_AirMelee_A_;                                   // 0x0111   (0x0001)  
	bool                                               Skill_UnLock_AirMelee_B_;                                   // 0x0112   (0x0001)  
	bool                                               Skill_UnLock_AirMelee_C_;                                   // 0x0113   (0x0001)  
	bool                                               Skill_UnLock_LightSword_;                                   // 0x0114   (0x0001)  
	bool                                               Skill_UnLock_LightSword_A_;                                 // 0x0115   (0x0001)  
	bool                                               Skill_UnLock_LightSword_B_;                                 // 0x0116   (0x0001)  
	bool                                               Skill_UnLock_LightSword_C_;                                 // 0x0117   (0x0001)  
	bool                                               Skill_UnLock_UpSword_;                                      // 0x0118   (0x0001)  
	bool                                               Skill_UnLock_UpSword_A_;                                    // 0x0119   (0x0001)  
	bool                                               Skill_UnLock_UpSword_B_;                                    // 0x011A   (0x0001)  
	bool                                               Skill_UnLock_UpSword_C_;                                    // 0x011B   (0x0001)  
	bool                                               Skill_UnLock_SprintAttack_;                                 // 0x011C   (0x0001)  
	bool                                               Skill_UnLock_SprintAttack_A_;                               // 0x011D   (0x0001)  
	bool                                               Skill_UnLock_SprintAttack_B_;                               // 0x011E   (0x0001)  
	bool                                               Skill_UnLock_SprintAttack_C_;                               // 0x011F   (0x0001)  
	bool                                               Skill_UnLock_JumpAttack_;                                   // 0x0120   (0x0001)  
	bool                                               Skill_UnLock_JumpAttack_A_;                                 // 0x0121   (0x0001)  
	bool                                               Skill_UnLock_JumpAttack_B_;                                 // 0x0122   (0x0001)  
	bool                                               Skill_UnLock_JumpAttack_C_;                                 // 0x0123   (0x0001)  
	bool                                               Skill_UnLock_VEPR_SPAMMO_A_;                                // 0x0124   (0x0001)  
	bool                                               Skill_UnLock_VEPR_SPAMMO_B_;                                // 0x0125   (0x0001)  
	bool                                               Skill_UnLock_VEPR_SPAMMO_C_;                                // 0x0126   (0x0001)  
	bool                                               Skill_UnLock_GER_SPAMMO_A_;                                 // 0x0127   (0x0001)  
	bool                                               Skill_UnLock_GER_SPAMMO_B_;                                 // 0x0128   (0x0001)  
	bool                                               Skill_UnLock_GER_SPAMMO_C_;                                 // 0x0129   (0x0001)  
	bool                                               Skill_UnLock_Meta_SPAMMO_A_;                                // 0x012A   (0x0001)  
	bool                                               Skill_UnLock_Meta_SPAMMO_B_;                                // 0x012B   (0x0001)  
	bool                                               Skill_UnLock_Meta_SPAMMO_C_;                                // 0x012C   (0x0001)  
	bool                                               Skill_UnLock_IOPR_SPAMMO_A_;                                // 0x012D   (0x0001)  
	bool                                               Skill_UnLock_IOPR_SPAMMO_B_;                                // 0x012E   (0x0001)  
	bool                                               Skill_UnLock_IOPR_SPAMMO_C_;                                // 0x012F   (0x0001)  
	bool                                               Finish_Difficulty_2_;                                       // 0x0130   (0x0001)  
	unsigned char                                      UnknownData04_6[0x3];                                       // 0x0131   (0x0003)  MISSED
	int32_t                                            Now_Difficulty;                                             // 0x0134   (0x0004)  
	bool                                               IsFinishAllLevel_;                                          // 0x0138   (0x0001)  
	unsigned char                                      UnknownData05_6[0x7];                                       // 0x0139   (0x0007)  MISSED
	class UClass*                                      PlayerNowWeapon1;                                           // 0x0140   (0x0008)  
	class UClass*                                      PlayerNowWeapon2;                                           // 0x0148   (0x0008)  
	class UClass*                                      PlayerNowWeapon3;                                           // 0x0150   (0x0008)  
	class UClass*                                      PlayerNowWeapon4;                                           // 0x0158   (0x0008)  
	class UClass*                                      PlayerNowWeapon9;                                           // 0x0160   (0x0008)  
	bool                                               IsBackToMenu_;                                              // 0x0168   (0x0001)  
	unsigned char                                      UnknownData06_6[0x3];                                       // 0x0169   (0x0003)  MISSED
	int32_t                                            Skill_SLZ_NumberCache;                                      // 0x016C   (0x0004)  
	bool                                               CanPopNewPlayerSLZUI_;                                      // 0x0170   (0x0001)  
	bool                                               IsSelectMenuStart_;                                         // 0x0171   (0x0001)  
	bool                                               Finish_Difficulty_3_;                                       // 0x0172   (0x0001)  
	bool                                               IsFinishAllLevel_BackToMenu_;                               // 0x0173   (0x0001)  
	int32_t                                            PlayerDead_Number;                                          // 0x0174   (0x0004)  
	float                                              Complete_Time;                                              // 0x0178   (0x0004)  
	bool                                               IsBackToResults_;                                           // 0x017C   (0x0001)  
	bool                                               IsBackToChangeUserMenu_;                                    // 0x017D   (0x0001)  
	bool                                               IsLinLevelToLevel04_;                                       // 0x017E   (0x0001)  
	unsigned char                                      UnknownData07_6[0x1];                                       // 0x017F   (0x0001)  MISSED
	int32_t                                            ChengJiu_WanMeiTanFan_Number;                               // 0x0180   (0x0004)  
	int32_t                                            ChengJiu_FarTanFan_Number;                                  // 0x0184   (0x0004)  
	int32_t                                            ChengJiu_CarBoom_Number;                                    // 0x0188   (0x0004)  
	int32_t                                            Skill_YuXi_ChengJiu_Number;                                 // 0x018C   (0x0004)  
	bool                                               BMI_NP_PickUpSLZ_WoodBox_;                                  // 0x0190   (0x0001)  
	unsigned char                                      UnknownData08_6[0x3];                                       // 0x0191   (0x0003)  MISSED
	int32_t                                            Skill_YuXi_PickUpTipLimt_Number;                            // 0x0194   (0x0004)  
};

///Class /Game/PlayerBP/Blueprints/BMI_Skin.BMI_Skin_C
/// @brief 類別 /Game/PlayerBP/Blueprints/BMI_Skin.BMI_Skin_C
/// @brief 總大小: 0x0096 (150 字節) (從 0x000028 到 0x000096)，8字節對齊，最大大小: 0x0096
/// @brief 這個類別是用於儲存玩家外觀（Skin）相關的遊戲存檔資料。
class UBMI_Skin_C : public USaveGame
{ 
public:
	// --- VEPR 武器外觀解鎖狀態 ---
	bool                                               Skin_VEPR_00;                                               // 0x0028 (大小 0x0001) - VEPR 武器外觀 00 是否已解鎖
	bool                                               Skin_VEPR_01;                                               // 0x0029 (大小 0x0001) - VEPR 武器外觀 01 是否已解鎖
	bool                                               Skin_VEPR_02;                                               // 0x002A (大小 0x0001) - VEPR 武器外觀 02 是否已解鎖
	bool                                               Skin_VEPR_03;                                               // 0x002B (大小 0x0001) - VEPR 武器外觀 03 是否已解鎖
	bool                                               Skin_VEPR_04;                                               // 0x002C (大小 0x0001) - VEPR 武器外觀 04 是否已解鎖
	bool                                               Skin_VEPR_05;                                               // 0x002D (大小 0x0001) - VEPR 武器外觀 05 是否已解鎖
	bool                                               Skin_VEPR_06;                                               // 0x002E (大小 0x0001) - VEPR 武器外觀 06 是否已解鎖
	bool                                               Skin_VEPR_07;                                               // 0x002F (大小 0x0001) - VEPR 武器外觀 07 是否已解鎖

	// --- 角色服裝外觀解鎖狀態 ---
	bool                                               Skin_Cloth_00;                                              // 0x0030 (大小 0x0001) - 服裝外觀 00 是否已解鎖
	bool                                               Skin_Cloth_01;                                              // 0x0031 (大小 0x0001) - 服裝外觀 01 是否已解鎖
	bool                                               Skin_Cloth_02;                                              // 0x0032 (大小 0x0001) - 服裝外觀 02 是否已解鎖
	bool                                               Skin_Cloth_03;                                              // 0x0033 (大小 0x0001) - 服裝外觀 03 是否已解鎖
	bool                                               Skin_Cloth_04;                                              // 0x0034 (大小 0x0001) - 服裝外觀 04 是否已解鎖
	bool                                               Skin_Cloth_05;                                              // 0x0035 (大小 0x0001) - 服裝外觀 05 是否已解鎖
	bool                                               Skin_Cloth_06;                                              // 0x0036 (大小 0x0001) - 服裝外觀 06 是否已解鎖
	bool                                               Skin_Cloth_07;                                              // 0x0037 (大小 0x0001) - 服裝外觀 07 是否已解鎖
	bool                                               Skin_Cloth_08;                                              // 0x0038 (大小 0x0001) - 服裝外觀 08 是否已解鎖
	bool                                               Skin_Cloth_09;                                              // 0x0039 (大小 0x0001) - 服裝外觀 09 是否已解鎖

	// --- GER 武器/物品外觀解鎖狀態 ---
	bool                                               Skin_GER_00;                                                // 0x003A (大小 0x0001) - GER 外觀 00 是否已解鎖
	bool                                               Skin_GER_01;                                                // 0x003B (大小 0x0001) - GER 外觀 01 是否已解鎖
	bool                                               Skin_GER_02;                                                // 0x003C (大小 0x0001) - GER 外觀 02 是否已解鎖
	bool                                               Skin_GER_03;                                                // 0x003D (大小 0x0001) - GER 外觀 03 是否已解鎖
	bool                                               Skin_GER_04;                                                // 0x003E (大小 0x0001) - GER 外觀 04 是否已解鎖
	bool                                               Skin_GER_05;                                                // 0x003F (大小 0x0001) - GER 外觀 05 是否已解鎖
	bool                                               Skin_GER_06;                                                // 0x0040 (大小 0x0001) - GER 外觀 06 是否已解鎖
	bool                                               Skin_GER_07;                                                // 0x0041 (大小 0x0001) - GER 外觀 07 是否已解鎖

	// --- IOPR 武器/物品外觀解鎖狀態 ---
	bool                                               Skin_IOPR_00;                                               // 0x0042 (大小 0x0001) - IOPR 外觀 00 是否已解鎖
	bool                                               Skin_IOPR_01;                                               // 0x0043 (大小 0x0001) - IOPR 外觀 01 是否已解鎖
	bool                                               Skin_IOPR_02;                                               // 0x0044 (大小 0x0001) - IOPR 外觀 02 是否已解鎖
	bool                                               Skin_IOPR_03;                                               // 0x0045 (大小 0x0001) - IOPR 外觀 03 是否已解鎖
	bool                                               Skin_IOPR_04;                                               // 0x0046 (大小 0x0001) - IOPR 外觀 04 是否已解鎖
	bool                                               Skin_IOPR_05;                                               // 0x0047 (大小 0x0001) - IOPR 外觀 05 是否已解鎖
	bool                                               Skin_IOPR_06;                                               // 0x0048 (大小 0x0001) - IOPR 外觀 06 是否已解鎖
	bool                                               Skin_IOPR_07;                                               // 0x0049 (大小 0x0001) - IOPR 外觀 07 是否已解鎖

	// --- Meta 武器/物品外觀解鎖狀態 ---
	bool                                               Skin_Meta_00;                                               // 0x004A (大小 0x0001) - Meta 外觀 00 是否已解鎖
	bool                                               Skin_Meta_01;                                               // 0x004B (大小 0x0001) - Meta 外觀 01 是否已解鎖
	bool                                               Skin_Meta_02;                                               // 0x004C (大小 0x0001) - Meta 外觀 02 是否已解鎖
	bool                                               Skin_Meta_03;                                               // 0x004D (大小 0x0001) - Meta 外觀 03 是否已解鎖
	bool                                               Skin_Meta_04;                                               // 0x004E (大小 0x0001) - Meta 外觀 04 是否已解鎖
	bool                                               Skin_Meta_05;                                               // 0x004F (大小 0x0001) - Meta 外觀 05 是否已解鎖
	bool                                               Skin_Meta_06;                                               // 0x0050 (大小 0x0001) - Meta 外觀 06 是否已解鎖
	bool                                               Skin_Meta_07;                                               // 0x0051 (大小 0x0001) - Meta 外觀 07 是否已解鎖
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x0052 (大小 0x0002) - 未知資料/記憶體對齊填充

	// --- 當前裝備的外觀 ID ---
	int32_t                                            Now_Skin_Cloth;                                             // 0x0054 (大小 0x0004) - 當前裝備的服裝外觀 ID
	int32_t                                            Now_Skin_VEPR;                                              // 0x0058 (大小 0x0004) - 當前裝備的 VEPR 武器外觀 ID
	int32_t                                            Now_Skin_GER;                                               // 0x005C (大小 0x0004) - 當前裝備的 GER 外觀 ID
	int32_t                                            Now_Skin_IOPR;                                              // 0x0060 (大小 0x0004) - 當前裝備的 IOPR 外觀 ID
	int32_t                                            Now_Skin_Meta;                                              // 0x0064 (大小 0x0004) - 當前裝備的 Meta 外觀 ID

	// --- 劍類武器外觀解鎖狀態 ---
	bool                                               Skin_Sword_00;                                              // 0x0068 (大小 0x0001) - 劍外觀 00 是否已解鎖
	bool                                               Skin_Sword_01;                                              // 0x0069 (大小 0x0001) - 劍外觀 01 是否已解鎖
	bool                                               Skin_Sword_02;                                              // 0x006A (大小 0x0001) - 劍外觀 02 是否已解鎖
	bool                                               Skin_Sword_03;                                              // 0x006B (大小 0x0001) - 劍外觀 03 是否已解鎖
	bool                                               Skin_Sword_04;                                              // 0x006C (大小 0x0001) - 劍外觀 04 是否已解鎖
	bool                                               Skin_Sword_05;                                              // 0x006D (大小 0x0001) - 劍外觀 05 是否已解鎖
	bool                                               Skin_Sword_06;                                              // 0x006E (大小 0x0001) - 劍外觀 06 是否已解鎖
	bool                                               Skin_Sword_07;                                              // 0x006F (大小 0x0001) - 劍外觀 07 是否已解鎖
	
	int32_t                                            Now_Skin_Sword;                                             // 0x0070 (大小 0x0004) - 當前裝備的劍外觀 ID

	// --- 擊殺 AI 數量統計 (用於解鎖外觀) ---
	int32_t                                            VEPR_KillAI_Number;                                         // 0x0074 (大小 0x0004) - 使用 VEPR 武器擊殺的 AI 數量
	int32_t                                            Swrod_KillAI_Number;                                        // 0x0078 (大小 0x0004) - 使用劍擊殺的 AI 數量 (原文 Swrod 可能是 Sword 的拼寫錯誤)
	int32_t                                            GER_KillAI_Number;                                          // 0x007C (大小 0x0004) - 使用 GER 物品/武器擊殺的 AI 數量
	int32_t                                            Meta_KillAI_Number;                                         // 0x0080 (大小 0x0004) - 使用 Meta 物品/武器擊殺的 AI 數量
	int32_t                                            IOPR_KillAI_Number;                                         // 0x0084 (大小 0x0004) - 使用 IOPR 物品/武器擊殺的 AI 數量
	
	// --- 其他遊戲進度與統計 ---
	bool                                               UseJXBHand_;                                                // 0x0088 (大小 0x0001) - 可能表示是否使用某種特殊的手部模型或物品
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0089 (大小 0x0003) - 未知資料/記憶體對齊填充
	int32_t                                            DZ_KillAI_Number;                                           // 0x008C (大小 0x0004) - DZ 相關的 AI 擊殺數
	int32_t                                            ZhuoShao_KillAI_Number;                                     // 0x0090 (大小 0x0004) - "灼燒" 相關的 AI 擊殺數 (根據拼音猜測)
	
	// --- 難度完成狀態 ---
	bool                                               Finish_SkinDifficulty_3_;                                   // 0x0094 (大小 0x0001) - 是否已完成難度3 (可能用於解鎖特定外觀)
	bool                                               Finish_SkinDifficulty_2_;                                   // 0x0095 (大小 0x0001) - 是否已完成難度2
};

/// Class /Game/PlayerBP/Blueprints/UserSave.UserSave_C
/// Size: 0x0154 (340 bytes) (0x000028 - 0x000154) align 8 MaxSize: 0x0154
class UUserSave_C : public USaveGame
{ 
public:
	class USaveGame*                                   UserSaveObj;                                                // 0x0028   (0x0008)  
	FString                                            UserSaveName;                                               // 0x0030   (0x0010)  
	FString                                            Windows_Resolution;                                         // 0x0040   (0x0010)  
	bool                                               Windows_FullScreen_;                                        // 0x0050   (0x0001)  
	bool                                               Windows_Syn_;                                               // 0x0051   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x0052   (0x0002)  MISSED
	int32_t                                            Windows_Gamma;                                              // 0x0054   (0x0004)  
	char                                               Windows_ScreenPercent;                                      // 0x0058   (0x0001)  
	char                                               Windows_AA;                                                 // 0x0059   (0x0001)  
	char                                               Windows_TextureLOD;                                         // 0x005A   (0x0001)  
	char                                               Windows_AF;                                                 // 0x005B   (0x0001)  
	char                                               Windows_Shadow;                                             // 0x005C   (0x0001)  
	char                                               Windows_SSR;                                                // 0x005D   (0x0001)  
	char                                               Windows_Refraction;                                         // 0x005E   (0x0001)  
	char                                               Windows_AO;                                                 // 0x005F   (0x0001)  
	char                                               Windows_Motion;                                             // 0x0060   (0x0001)  
	char                                               Windows_VFog;                                               // 0x0061   (0x0001)  
	char                                               Windows_ParLight;                                           // 0x0062   (0x0001)  
	char                                               Windows_DOF;                                                // 0x0063   (0x0001)  
	char                                               Windows_Languege;                                           // 0x0064   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0065   (0x0003)  MISSED
	int32_t                                            Windows_BaseSound;                                          // 0x0068   (0x0004)  
	int32_t                                            Windows_SFX;                                                // 0x006C   (0x0004)  
	int32_t                                            Windows_Voice;                                              // 0x0070   (0x0004)  
	int32_t                                            Windows_UISound;                                            // 0x0074   (0x0004)  
	float                                              MouseXY_Rate;                                               // 0x0078   (0x0004)  
	bool                                               MouseX_Reversal_;                                           // 0x007C   (0x0001)  
	bool                                               MouseY_Reversal_;                                           // 0x007D   (0x0001)  
	bool                                               PressAdd_;                                                  // 0x007E   (0x0001)  
	bool                                               PressCrouch_;                                               // 0x007F   (0x0001)  
	int32_t                                            Windows_MouseRate;                                          // 0x0080   (0x0004)  
	bool                                               BloodMode;                                                  // 0x0084   (0x0001)  
	bool                                               Subtitles;                                                  // 0x0085   (0x0001)  
	bool                                               WeaponHUDVis_;                                              // 0x0086   (0x0001)  
	bool                                               Score;                                                      // 0x0087   (0x0001)  
	int32_t                                            Windows_BGM;                                                // 0x0088   (0x0004)  
	bool                                               AutoAnim_;                                                  // 0x008C   (0x0001)  
	bool                                               PressRun_;                                                  // 0x008D   (0x0001)  
	char                                               Windows_RTX;                                                // 0x008E   (0x0001)  
	char                                               Windows_VioceLanguege;                                      // 0x008F   (0x0001)  
	char                                               Windows_Chrome;                                             // 0x0090   (0x0001)  
	bool                                               FeedBack_;                                                  // 0x0091   (0x0001)  
	unsigned char                                      UnknownData02_6[0x2];                                       // 0x0092   (0x0002)  MISSED
	int32_t                                            FOV;                                                        // 0x0094   (0x0004)  
	bool                                               JP_Cache;                                                   // 0x0098   (0x0001)  
	bool                                               US_Cache;                                                   // 0x0099   (0x0001)  
	bool                                               ZH_Cache;                                                   // 0x009A   (0x0001)  
	unsigned char                                      UnknownData03_6[0x1];                                       // 0x009B   (0x0001)  MISSED
	float                                              GamePadX_Rate;                                              // 0x009C   (0x0004)  
	float                                              GamePadY_Rate;                                              // 0x00A0   (0x0004)  
	float                                              MouseXY_AddRate;                                            // 0x00A4   (0x0004)  
	float                                              GamePadXY_AddRate;                                          // 0x00A8   (0x0004)  
	float                                              GamePadXY_Sniper_AddRate;                                   // 0x00AC   (0x0004)  
	float                                              MouseXY_SniperAddRate;                                      // 0x00B0   (0x0004)  
	int32_t                                            SubtitlesSize;                                              // 0x00B4   (0x0004)  
	float                                              BMI_Gamma;                                                  // 0x00B8   (0x0004)  
	bool                                               AmryHealthVis_;                                             // 0x00BC   (0x0001)  
	bool                                               SkillListVis_;                                              // 0x00BD   (0x0001)  
	bool                                               PlayerHealthVis_;                                           // 0x00BE   (0x0001)  
	bool                                               CrossHairVis_;                                              // 0x00BF   (0x0001)  
	int32_t                                            SkillCameraShake;                                           // 0x00C0   (0x0004)  
	bool                                               FPSVis_;                                                    // 0x00C4   (0x0001)  
	unsigned char                                      UnknownData04_6[0x3];                                       // 0x00C5   (0x0003)  MISSED
	int32_t                                            X;                                                          // 0x00C8   (0x0004)  
	int32_t                                            Y;                                                          // 0x00CC   (0x0004)  
	int32_t                                            Windows_FPSLimb;                                            // 0x00D0   (0x0004)  
	int32_t                                            TAA;                                                        // 0x00D4   (0x0004)  
	int32_t                                            Windows_Screen;                                             // 0x00D8   (0x0004)  
	int32_t                                            Windows_Texture;                                            // 0x00DC   (0x0004)  
	int32_t                                            Windows_AFs;                                                // 0x00E0   (0x0004)  
	int32_t                                            Windows_Shadows;                                            // 0x00E4   (0x0004)  
	int32_t                                            Windows_SSRs;                                               // 0x00E8   (0x0004)  
	int32_t                                            Windows_SSAOs;                                              // 0x00EC   (0x0004)  
	int32_t                                            Windows_MotionBlur;                                         // 0x00F0   (0x0004)  
	int32_t                                            Windows_ParLights;                                          // 0x00F4   (0x0004)  
	int32_t                                            Windows_DOFs;                                               // 0x00F8   (0x0004)  
	int32_t                                            Windows_Chromes;                                            // 0x00FC   (0x0004)  
	int32_t                                            Windows_RT;                                                 // 0x0100   (0x0004)  
	int32_t                                            Windows_DLSS;                                               // 0x0104   (0x0004)  
	int32_t                                            Windows_FOV;                                                // 0x0108   (0x0004)  
	int32_t                                            Windows_JiaoPian_;                                          // 0x010C   (0x0004)  
	int32_t                                            Windows_Reflex;                                             // 0x0110   (0x0004)  
	float                                              Windows_BaseSounds;                                         // 0x0114   (0x0004)  
	float                                              Windows_SFXs;                                               // 0x0118   (0x0004)  
	float                                              Windows_BGMs;                                               // 0x011C   (0x0004)  
	float                                              Windows_Voices;                                             // 0x0120   (0x0004)  
	int32_t                                            Windows_Languages;                                          // 0x0124   (0x0004)  
	int32_t                                            Windows_VoiceLanguages;                                     // 0x0128   (0x0004)  
	bool                                               GamePadX_Reversal_;                                         // 0x012C   (0x0001)  
	bool                                               GamePadY_Reversal_;                                         // 0x012D   (0x0001)  
	unsigned char                                      UnknownData05_6[0x2];                                       // 0x012E   (0x0002)  MISSED
	int32_t                                            Windows_DXR;                                                // 0x0130   (0x0004)  
	int32_t                                            Windows_DLSS_Switch;                                        // 0x0134   (0x0004)  
	int32_t                                            Windows_DLSS_IntoFPS;                                       // 0x0138   (0x0004)  
	float                                              BMI_DLSS_Sharp;                                             // 0x013C   (0x0004)  
	bool                                               Windows_DLSSAI_IsMofid_;                                    // 0x0140   (0x0001)  
	bool                                               TPS_;                                                       // 0x0141   (0x0001)  
	bool                                               Cel_;                                                       // 0x0142   (0x0001)  
	unsigned char                                      UnknownData06_6[0x1];                                       // 0x0143   (0x0001)  MISSED
	int32_t                                            Windows_FSR_Switch;                                         // 0x0144   (0x0004)  
	int32_t                                            Windows_FSR;                                                // 0x0148   (0x0004)  
	float                                              BMI_FSR_Sharp;                                              // 0x014C   (0x0004)  
	int32_t                                            Windows_XESS;                                               // 0x0150   (0x0004)  
};

/// Class /Game/PlayerBP/Blueprints/AIFindPoint.AIFindPoint_C
/// Size: 0x0234 (564 bytes) (0x000220 - 0x000234) align 8 MaxSize: 0x0234
class AAIFindPoint_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class UArrowComponent*                             Arrow;                                                      // 0x0228   (0x0008)  
	float                                              Z;                                                          // 0x0230   (0x0004)  


	/// Functions
	// Function /Game/PlayerBP/Blueprints/AIFindPoint.AIFindPoint_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x148e900] Event|Public|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/AIFindPoint.AIFindPoint_C.ExecuteUbergraph_AIFindPoint
	// void ExecuteUbergraph_AIFindPoint(int32_t EntryPoint);                                                                   // [0x148e900] Final|HasDefaults    
};

/// Class /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C
/// Size: 0x054D (1357 bytes) (0x0004B8 - 0x00054D) align 16 MaxSize: 0x054D
class ABMI_Skin_Characters_C : public ACharacter
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x04B8   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x04C0   (0x0008)  
	class USkeletalMeshComponent*                      IOPR_MagS;                                                  // 0x04C8   (0x0008)  
	class USkeletalMeshComponent*                      Meta_AI_MagS;                                               // 0x04D0   (0x0008)  
	class USkeletalMeshComponent*                      GER_Rupture_Mag_Skin00S;                                    // 0x04D8   (0x0008)  
	class USkeletalMeshComponent*                      VEPR_Mag_Skin_00S;                                          // 0x04E0   (0x0008)  
	class UPostProcessComponent*                       Cel_PostProcess;                                            // 0x04E8   (0x0008)  
	class UBoxComponent*                               Foot;                                                       // 0x04F0   (0x0008)  
	class UBoxComponent*                               Breat;                                                      // 0x04F8   (0x0008)  
	class UBoxComponent*                               Body;                                                       // 0x0500   (0x0008)  
	class UStaticMeshComponent*                        SuYa_SLightSword;                                           // 0x0508   (0x0008)  
	class UStaticMeshComponent*                        SRO_EXO;                                                    // 0x0510   (0x0008)  
	class USkeletalMeshComponent*                      Meta_AI;                                                    // 0x0518   (0x0008)  
	class USkeletalMeshComponent*                      IOPR;                                                       // 0x0520   (0x0008)  
	class USkeletalMeshComponent*                      GER_Rupture;                                                // 0x0528   (0x0008)  
	class USkeletalMeshComponent*                      VEPR_Factory;                                               // 0x0530   (0x0008)  
	int32_t                                            WeaponType;                                                 // 0x0538   (0x0004)  
	FName                                              Bip001_R_Breast;                                            // 0x053C   (0x0008)  
	FName                                              Bip001_L_Breast;                                            // 0x0544   (0x0008)  
	bool                                               Cel_;                                                       // 0x054C   (0x0001)  


	/// Functions
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Set_Cloth_Mesh
	// void Set_Cloth_Mesh(class USkeletalMesh* NewMesh);                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.UpData_Ability
	// void UpData_Ability(class UBMI_Save_C* BMISave);                                                                         // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.UpData_NowSelect
	// void UpData_NowSelect();                                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.GamePad_UpSelect
	// void GamePad_UpSelect();                                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.GamePad_DownSelect
	// void GamePad_DownSelect();                                                                                               // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.GamePad_LBSelect
	// void GamePad_LBSelect();                                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.GamePad_RBSelect
	// void GamePad_RBSelect();                                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.UpData_CrashKey
	// void UpData_CrashKey(FText KeyName);                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.GamePad_LeftSelect
	// void GamePad_LeftSelect();                                                                                               // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.GamePad_RightSelect
	// void GamePad_RightSelect();                                                                                              // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.GamePad_A
	// void GamePad_A();                                                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.GamePad_B
	// void GamePad_B();                                                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.BackToTop
	// void BackToTop();                                                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.ChangeHand
	// void ChangeHand();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.UpData_NowSkinSelect
	// void UpData_NowSkinSelect();                                                                                             // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.UpData_MainMenuSkin
	// void UpData_MainMenuSkin();                                                                                              // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Play_RifleAnim
	// void Play_RifleAnim();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x148e900] Event|Protected|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_VEPR01
	// void Preview_VEPR01();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_VEPR00
	// void Preview_VEPR00();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_VEPR02
	// void Preview_VEPR02();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_VEPR03
	// void Preview_VEPR03();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_Cloth00
	// void Preview_Cloth00();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_Cloth01
	// void Preview_Cloth01();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_Cloth02
	// void Preview_Cloth02();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_Cloth03
	// void Preview_Cloth03();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_Cloth04
	// void Preview_Cloth04();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_Cloth05
	// void Preview_Cloth05();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_GER00
	// void Preview_GER00();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_GER01
	// void Preview_GER01();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_GER02
	// void Preview_GER02();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_GER03
	// void Preview_GER03();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_Meta01
	// void Preview_Meta01();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_Meta02
	// void Preview_Meta02();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_Meta03
	// void Preview_Meta03();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_Meta00
	// void Preview_Meta00();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_IOPR00
	// void Preview_IOPR00();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_IOPR01
	// void Preview_IOPR01();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_IOPR02
	// void Preview_IOPR02();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_IOPR03
	// void Preview_IOPR03();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_Swrod01
	// void Preview_Swrod01();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_Swrod02
	// void Preview_Swrod02();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_Swrod03
	// void Preview_Swrod03();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_Swrod00
	// void Preview_Swrod00();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.ChangeVEPR_MainMenu
	// void ChangeVEPR_MainMenu();                                                                                              // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.ChangeGER_MainMenu
	// void ChangeGER_MainMenu();                                                                                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.ChangeMeta_MainMenu
	// void ChangeMeta_MainMenu();                                                                                              // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.ChangeIOPR_MainMenu
	// void ChangeIOPR_MainMenu();                                                                                              // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Play_PistolAnim
	// void Play_PistolAnim();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_VEPR04
	// void Preview_VEPR04();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_GER04
	// void Preview_GER04();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_Meta04
	// void Preview_Meta04();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_IOPR04
	// void Preview_IOPR04();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_VEPR05
	// void Preview_VEPR05();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_GER05
	// void Preview_GER05();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_Meta05
	// void Preview_Meta05();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_IOPR05
	// void Preview_IOPR05();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_Swrod04
	// void Preview_Swrod04();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_Swrod05
	// void Preview_Swrod05();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_Cloth06
	// void Preview_Cloth06();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_Cloth07
	// void Preview_Cloth07();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_VEPR06
	// void Preview_VEPR06();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_VEPR07
	// void Preview_VEPR07();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_GER06
	// void Preview_GER06();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_GER07
	// void Preview_GER07();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_Meta06
	// void Preview_Meta06();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_Meta07
	// void Preview_Meta07();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_IOPR06
	// void Preview_IOPR06();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_IOPR07
	// void Preview_IOPR07();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_Swrod06
	// void Preview_Swrod06();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_Swrod07
	// void Preview_Swrod07();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_Cloth08
	// void Preview_Cloth08();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Preview_Cloth09
	// void Preview_Cloth09();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Open_Cel_Shader
	// void Open_Cel_Shader();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.Close_Cel_Shader
	// void Close_Cel_Shader();                                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.SwitchCel
	// void SwitchCel();                                                                                                        // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.LoadCel
	// void LoadCel();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Blueprints/BMI_Skin_Characters.BMI_Skin_Characters_C.ExecuteUbergraph_BMI_Skin_Characters
	// void ExecuteUbergraph_BMI_Skin_Characters(int32_t EntryPoint);                                                           // [0x148e900] Final|HasDefaults    
};

/// Class /Game/PlayerBP/Receive/Far_UMG_Interface.Far_UMG_Interface_C
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000028) align 8 MaxSize: 0x0028
class UFar_UMG_Interface_C : public UInterface
{ 
public:


	/// Functions
	// Function /Game/PlayerBP/Receive/Far_UMG_Interface.Far_UMG_Interface_C.Far_DLSSOFF
	// void Far_DLSSOFF();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Receive/Far_UMG_Interface.Far_UMG_Interface_C.FarDlss2
	// void FarDlss2();                                                                                                         // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Receive/Far_UMG_Interface.Far_UMG_Interface_C.Far_Dlss1
	// void Far_Dlss1();                                                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Receive/Far_UMG_Interface.Far_UMG_Interface_C.Far_Dlss0
	// void Far_Dlss0();                                                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Receive/Far_UMG_Interface.Far_UMG_Interface_C.Far_DLSS-1
	// void Far_DLSS_1();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Receive/Far_UMG_Interface.Far_UMG_Interface_C.Far_DLSSON
	// void Far_DLSSON();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Receive/Far_UMG_Interface.Far_UMG_Interface_C.Far_CloseForceNewPlayerUI
	// void Far_CloseForceNewPlayerUI();                                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Receive/Far_UMG_Interface.Far_UMG_Interface_C.Far_OpenAA
	// void Far_OpenAA();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Receive/Far_UMG_Interface.Far_UMG_Interface_C.Far_CloseAA
	// void Far_CloseAA();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Receive/Far_UMG_Interface.Far_UMG_Interface_C.Far_UpDateControl
	// void Far_UpDateControl();                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Receive/Far_UMG_Interface.Far_UMG_Interface_C.Far_FOV110_Event
	// void Far_FOV110_Event();                                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PlayerBP/Receive/Far_UMG_Interface.Far_UMG_Interface_C.Far_SettingTwoStart_Anim
	// void Far_SettingTwoStart_Anim();                                                                                         // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/PlayerBP/Blueprints/BMICharacter.BMICharacter_C
/// Size: 0x1390 (5008 bytes) (0x0004B8 - 0x001390) align 16 MaxSize: 0x1390
class ABMICharacter_C : public ACharacter
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x04B8   (0x0008)  MISSED      // 可能的内存对齐填充
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x04C0   (0x0008)  // 蓝图事件图的入口点
	class UPointLightComponent*                        TPS_Light_F;                                                // 0x04C8   (0x0008)  // 第三人称视角的前置点光源
	class UPostProcessComponent*                       Cel_PostProcess;                                            // 0x04D0   (0x0008)  // 卡通渲染（Cel-Shading）的后期处理组件
	class UPointLightComponent*                        TPS_Light_L;                                                // 0x04D8   (0x0008)  // 第三人称视角的左侧点光源
	class UPointLightComponent*                        TPS_Light_R;                                                // 0x04E0   (0x0008)  // 第三人称视角的右侧点光源
	class UStaticMeshComponent*                        LightSwordTPS;                                              // 0x04E8   (0x0008)  // 第三人称视角下的光剑静态网格体
	class UStaticMeshComponent*                        EXO;                                                        // 0x04F0   (0x0008)  // 可能指外骨骼（Exoskeleton）或其他装备的静态网格体
	class UCameraComponent*                            TPSCamera;                                                  // 0x04F8   (0x0008)  // 第三人称相机
	class USpringArmComponent*                         CameraBoom;                                                 // 0x0500   (0x0008)  // 相机弹簧臂，用于控制相机与角色的距离
	class UArrowComponent*                             UpLightSwrodJumpZ;                                          // 0x0508   (0x0008)  // 标记上挑光剑跳跃高度（Z轴）的箭头组件
	class UParticleSystemComponent*                    Melee_XuLiParRed;                                           // 0x0510   (0x0008)  // 近战蓄力时的红色粒子效果
	class UParticleSystemComponent*                    MeleeEdmRed;                                                // 0x0518   (0x0008)  // 近战结束时的红色粒子效果
	class UArrowComponent*                             UpLightSwrodMoveLoc;                                        // 0x0520   (0x0008)  // 标记上挑光剑移动位置的箭头组件
	class UArrowComponent*                             UpLightSwrodMoveLoc0;                                       // 0x0528   (0x0008)  // 标记上挑光剑移动位置的箭头组件0
	class UArrowComponent*                             UpLightSwrodMoveLoc1;                                       // 0x0530   (0x0008)  // 标记上挑光剑移动位置的箭头组件1
	class UParticleSystemComponent*                    Melee_XuLiPar_OK;                                           // 0x0538   (0x0008)  // 近战蓄力完成时的粒子效果
	class UParticleSystemComponent*                    Melee_XuLiPar;                                              // 0x0540   (0x0008)  // 基础的近战蓄力粒子效果
	class UParticleSystemComponent*                    Sprint_XuLiPar_OK;                                          // 0x0548   (0x0008)  // 冲刺蓄力完成时的粒子效果
	class UParticleSystemComponent*                    Sprint_XuLiPar;                                             // 0x0550   (0x0008)  // 冲刺蓄力时的粒子效果
	class UParticleSystemComponent*                    SprintEdm;                                                  // 0x0558   (0x0008)  // 冲刺结束时的粒子效果
	class UParticleSystemComponent*                    JumpAttackEdm;                                              // 0x0560   (0x0008)  // 跳跃攻击结束时的粒子效果
	class UParticleSystemComponent*                    MeleeEdm;                                                   // 0x0568   (0x0008)  // 近战结束时的粒子效果
	class UArrowComponent*                             MeleePowerMoveLoc;                                          // 0x0570   (0x0008)  // 标记强力近战攻击移动位置的箭头组件
	class UParticleSystemComponent*                    OutWaterPar;                                                // 0x0578   (0x0008)  // 角色出水时的粒子效果
	class USkeletalMeshComponent*                      HuaChanFoot_CG;                                             // 0x0580   (0x0008)  // 过场动画(CG)中滑铲时脚部的骨骼网格体
	class UArrowComponent*                             SprintAttackMoveLoc;                                        // 0x0588   (0x0008)  // 标记冲刺攻击移动位置的箭头组件
	class USkeletalMeshComponent*                      SprintAttack_Hand;                                          // 0x0590   (0x0008)  // 冲刺攻击时手部的骨骼网格体
	class UStaticMeshComponent*                        LightSwordWP4;                                              // 0x0598   (0x0008)  // 光剑武器模型4
	class UArrowComponent*                             QYQStillZ;                                                  // 0x05A0   (0x0008)  // 牵引枪（QianYinQiang）静止时高度（Z轴）的箭头组件
	class UArrowComponent*                             HuaChanTrace;                                               // 0x05A8   (0x0008)  // 用于滑铲（HuaChan）检测的射线或形状的箭头组件
	class UCapsuleComponent*                           RunWallLeaveCheckBox;                                       // 0x05B0   (0x0008)  // 用于检测离开跑墙状态的胶囊体碰撞框
	class USkeletalMeshComponent*                      Melee_Powers;                                               // 0x05B8   (0x0008)  // 近战力量/特效相关的骨骼网格体
	class UArrowComponent*                             ClimbLimbCameraEnd;                                         // 0x05C0   (0x0008)  // 攀爬时相机移动的终点位置
	class UArrowComponent*                             ClimbLimbCameraStart;                                       // 0x05C8   (0x0008)  // 攀爬时相机移动的起点位置
	class UArrowComponent*                             ClimbForwardMove;                                           // 0x05D0   (0x0008)  // 标记向前攀爬移动方向的箭头组件
	class UArrowComponent*                             LightZhaDiCameraJump;                                       // 0x05D8   (0x0008)  // 轻攻击砸地（ZhaDi）时相机跳跃的位置
	class UArrowComponent*                             LightZhaDiCameraDown;                                       // 0x05E0   (0x0008)  // 轻攻击砸地（ZhaDi）时相机下落的位置
	class UArrowComponent*                             AITelePortLoc;                                              // 0x05E8   (0x0008)  // AI瞬移的目标位置
	class USkeletalMeshComponent*                      QYQAIHand;                                                  // 0x05F0   (0x0008)  // AI使用的牵引枪手部模型
	class UArrowComponent*                             JumpAttackZ;                                                // 0x05F8   (0x0008)  // 标记跳跃攻击高度（Z轴）的箭头组件
	class USkeletalMeshComponent*                      HuaChanFoot;                                                // 0x0600   (0x0008)  // 滑铲（HuaChan）时脚部的骨骼网格体
	class UArrowComponent*                             UpLightSwrodAttackMove;                                     // 0x0608   (0x0008)  // 标记上挑光剑攻击移动的箭头组件
	class UArrowComponent*                             UpLightSwrodMoveLoc2;                                       // 0x0610   (0x0008)  // 标记上挑光剑移动位置的箭头组件2
	class USkeletalMeshComponent*                      EMPHand;                                                    // 0x0618   (0x0008)  // 使用EMP技能时手部的骨骼网格体
	class UCableComponent*                             QYQ_ShengZi;                                                // 0x0620   (0x0008)  // 牵引枪的绳子（ShengZi）的缆绳组件
	class USkeletalMeshComponent*                      QYQ;                                                        // 0x0628   (0x0008)  // 牵引枪（QianYinQiang）的骨骼网格体
	class USkeletalMeshComponent*                      KanJiHand;                                                  // 0x0630   (0x0008)  // 砍击（KanJi）时手部的骨骼网格体
	class UStaticMeshComponent*                        LightSwordWP3;                                              // 0x0638   (0x0008)  // 光剑武器模型3
	class USkeletalMeshComponent*                      UpLightSword_Hand;                                          // 0x0640   (0x0008)  // 上挑光剑时手部的骨骼网格体
	class USkeletalMeshComponent*                      JumpAttackSword_Hand;                                       // 0x0648   (0x0008)  // 跳跃攻击时持剑手的骨骼网格体
	class UStaticMeshComponent*                        LightSwordWP2;                                              // 0x0650   (0x0008)  // 光剑武器模型2
	class USkeletalMeshComponent*                      Defu_Hand;                                                  // 0x0658   (0x0008)  // “格挡/防御”（Defense）或特定技能手部的骨骼网格体
	class UStaticMeshComponent*                        LightSwordWP1;                                              // 0x0660   (0x0008)  // 光剑武器模型1
	class USpringArmComponent*                         SpringArm_Move;                                             // 0x0668   (0x0008)  // 用于角色或武器移动的弹簧臂
	class UArrowComponent*                             WeaponRotArrow;                                             // 0x0670   (0x0008)  // 标记武器旋转的箭头组件
	class UArrowComponent*                             WeaponSwayArrow;                                            // 0x0678   (0x0008)  // 标记武器摇摆的箭头组件
	class USpringArmComponent*                         SpringArm;                                                  // 0x0680   (0x0008)  // 主要的弹簧臂组件
	class UParticleSystemComponent*                    Shun_Par;                                                   // 0x0688   (0x0008)  // 瞬移（ShunYi）或闪烁时的粒子效果
	class UBP_CircleDamageIndicatorComponent_C*        BP_CircleDamageIndicatorComponent;                          // 0x0690   (0x0008)  // 环形伤害指示器的蓝图组件
	class UArrowComponent*                             Arrow1;                                                     // 0x0698   (0x0008)  // 通用箭头组件1
	class UStaticMeshComponent*                        LightSwordWP;                                               // 0x06A0   (0x0008)  // 光剑武器模型
	class UPawnNoiseEmitterComponent*                  PawnNoiseEmitter;                                           // 0x06A8   (0x0008)  // 用于发出声音以吸引AI的组件
	class UPostProcessComponent*                       LowHealth_PostProcess;                                      // 0x06B0   (0x0008)  // 低生命值时的后期处理效果（如屏幕变红、模糊）
	class UCableComponent*                             Cable;                                                      // 0x06B8   (0x0008)  // 通用缆绳组件
	class USkeletalMeshComponent*                      Player_Foot;                                                // 0x06C0   (0x0008)  // 玩家脚部的骨骼网格体
	class USpringArmComponent*                         Foot_SpringArm;                                             // 0x06C8   (0x0008)  // 连接到脚部的弹簧臂，可能用于特殊效果
	class UArrowComponent*                             PlayerFootHeight;                                           // 0x06D0   (0x0008)  // 标记玩家脚部高度的箭头组件
	class USkeletalMeshComponent*                      Hand;                                                       // 0x06D8   (0x0008)  // 玩家手部的骨骼网格体
	class UWidgetInteractionComponent*                 Player_WidgetInteraction;                                   // 0x06E0   (0x0008)  // 玩家与3D UI交互的组件
	class USkeletalMeshComponent*                      WeaponMesh;                                                 // 0x06E8   (0x0008)  // 武器的骨骼网格体
	class UCameraComponent*                            Camera;                                                     // 0x06F0   (0x0008)  // 主相机（可能为第一人称相机）
	float                                              VEPR_TPS_ADD_ARM_E0DDDBDC475FCC2E34BBEBB3EC3CDEFA;          // 0x06F8   (0x0004)  // 时间轴 'VEPR_TPS_ADD' 中的浮点轨道值
	TEnumAsByte<ETimelineDirection>                    VEPR_TPS_ADD__Direction_E0DDDBDC475FCC2E34BBEBB3EC3CDEFA;   // 0x06FC   (0x0001)  // 时间轴 'VEPR_TPS_ADD' 的播放方向
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x06FD   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          VEPR_TPS_ADD;                                               // 0x0700   (0x0008)  // 用于第三人称视角过渡或动画的时间轴
	float                                              HuaChanCameraTime_SUYA_Z_4094413A432CA7B5352CDCA7375E2294;  // 0x0708   (0x0004)  // 时间轴 'HuaChanCameraTime' 中控制Z轴压缩（SuoYa）的轨道值
	float                                              HuaChanCameraTime_Camera_4094413A432CA7B5352CDCA7375E2294;  // 0x070C   (0x0004)  // 时间轴 'HuaChanCameraTime' 中控制相机的轨道值
	TEnumAsByte<ETimelineDirection>                    HuaChanCameraTime__Direction_4094413A432CA7B5352CDCA7375E2294; // 0x0710   (0x0001)  // 时间轴 'HuaChanCameraTime' 的播放方向
	unsigned char                                      UnknownData02_6[0x7];                                       // 0x0711   (0x0007)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          HuaChanCameraTime;                                          // 0x0718   (0x0008)  // 控制滑铲（HuaChan）时相机动画的时间轴
	float                                              Crouch_TPS3_Z_0A1E231B4BE56A8605C064ABD1F0DEB3;             // 0x0720   (0x0004)  // 时间轴 'Crouch_TPS3' 中控制Z轴的轨道值
	float                                              Crouch_TPS3_Camera_0A1E231B4BE56A8605C064ABD1F0DEB3;        // 0x0724   (0x0004)  // 时间轴 'Crouch_TPS3' 中控制相机的轨道值
	TEnumAsByte<ETimelineDirection>                    Crouch_TPS3__Direction_0A1E231B4BE56A8605C064ABD1F0DEB3;    // 0x0728   (0x0001)  // 时间轴 'Crouch_TPS3' 的播放方向
	unsigned char                                      UnknownData03_6[0x7];                                       // 0x0729   (0x0007)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          Crouch_TPS3;                                                // 0x0730   (0x0008)  // 第三人称蹲下相关的动画时间轴3
	float                                              ADD_GUODU_Lengh_24BF51D9471668423885D9B4882BCF78;           // 0x0738   (0x0004)  // 时间轴 'ADD_GUODU' 中控制长度（Length）的轨道值
	TEnumAsByte<ETimelineDirection>                    ADD_GUODU__Direction_24BF51D9471668423885D9B4882BCF78;      // 0x073C   (0x0001)  // 时间轴 'ADD_GUODU' 的播放方向
	unsigned char                                      UnknownData04_6[0x3];                                       // 0x073D   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          ADD_GUODU;                                                  // 0x0740   (0x0008)  // 用于添加过渡（GuoDu）效果的时间轴
	float                                              Crouch_TPS_Camera_8AA6211B4174154D0E4CCDA61185FFA6;         // 0x0748   (0x0004)  // 时间轴 'Crouch_TPS' 中控制相机的轨道值
	float                                              Crouch_TPS_Z_8AA6211B4174154D0E4CCDA61185FFA6;              // 0x074C   (0x0004)  // 时间轴 'Crouch_TPS' 中控制Z轴的轨道值
	TEnumAsByte<ETimelineDirection>                    Crouch_TPS__Direction_8AA6211B4174154D0E4CCDA61185FFA6;     // 0x0750   (0x0001)  // 时间轴 'Crouch_TPS' 的播放方向
	unsigned char                                      UnknownData05_6[0x7];                                       // 0x0751   (0x0007)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          Crouch_TPS;                                                 // 0x0758   (0x0008)  // 第三人称蹲下相关的动画时间轴
	float                                              StartAnJiao_EXp_8344377C411C1933CBCD8589ABEFE12F;           // 0x0760   (0x0004)  // 时间轴 'StartAnJiao' 中控制曝光（Exposure）的轨道值
	float                                              StartAnJiao_AnJiao_8344377C411C1933CBCD8589ABEFE12F;        // 0x0764   (0x0004)  // 时间轴 'StartAnJiao' 中控制暗角（AnJiao）的轨道值
	TEnumAsByte<ETimelineDirection>                    StartAnJiao__Direction_8344377C411C1933CBCD8589ABEFE12F;    // 0x0768   (0x0001)  // 时间轴 'StartAnJiao' 的播放方向
	unsigned char                                      UnknownData06_6[0x7];                                       // 0x0769   (0x0007)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          StartAnJiao;                                                // 0x0770   (0x0008)  // 控制屏幕暗角（Vignette）效果开始的时间轴
	float                                              HuiFuDunXia_Exp_2365277048F80C906621EDA695F60D80;           // 0x0778   (0x0004)  // 时间轴 'HuiFuDunXia' 中控制曝光（Exposure）的轨道值
	float                                              HuiFuDunXia_AnJiao_2365277048F80C906621EDA695F60D80;        // 0x077C   (0x0004)  // 时间轴 'HuiFuDunXia' 中控制暗角（AnJiao）的轨道值
	TEnumAsByte<ETimelineDirection>                    HuiFuDunXia__Direction_2365277048F80C906621EDA695F60D80;    // 0x0780   (0x0001)  // 时间轴 'HuiFuDunXia' 的播放方向
	unsigned char                                      UnknownData07_6[0x7];                                       // 0x0781   (0x0007)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          HuiFuDunXia;                                                // 0x0788   (0x0008)  // 从蹲下状态恢复（HuiFuDunXia）的动画时间轴
	float                                              ____2_Chorme_7FAAE2F0471B308EFF3921922B8C7AA8;              // 0x0790   (0x0004)  // 时间轴 '_e_' 中控制色差（Chromatic Aberration）的轨道值
	TEnumAsByte<ETimelineDirection>                    ____2__Direction_7FAAE2F0471B308EFF3921922B8C7AA8;          // 0x0794   (0x0001)  // 时间轴 '_e_' 的播放方向
	unsigned char                                      UnknownData08_6[0x3];                                       // 0x0795   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          _e_;                                                        // 0x0798   (0x0008)  // 未命名或通用时间轴2
	float                                              ____1_Time_538B4AAA46462A1178FA84BD0D2358FF;                // 0x07A0   (0x0004)  // 时间轴 '_e_3' 中控制时间的轨道值
	TEnumAsByte<ETimelineDirection>                    ____1__Direction_538B4AAA46462A1178FA84BD0D2358FF;          // 0x07A4   (0x0001)  // 时间轴 '_e_3' 的播放方向
	unsigned char                                      UnknownData09_6[0x3];                                       // 0x07A5   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          _e_3;                                                       // 0x07A8   (0x0008)  // 未命名或通用时间轴3
	float                                              ____0_TimeSlow_DC62441D423962A20E9C378981A5058B;            // 0x07B0   (0x0004)  // 时间轴 '_e_4' 中控制时间减速的轨道值
	TEnumAsByte<ETimelineDirection>                    ____0__Direction_DC62441D423962A20E9C378981A5058B;          // 0x07B4   (0x0001)  // 时间轴 '_e_4' 的播放方向
	unsigned char                                      UnknownData10_6[0x3];                                       // 0x07B5   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          _e_4;                                                       // 0x07B8   (0x0008)  // 未命名或通用时间轴4，用于时间减速
	float                                              HuaChanTIMELine_Speed_DA266BB149E2B74251F4DBBE950BC685;     // 0x07C0   (0x0004)  // 时间轴 'HuaChanTIMELine' 中控制速度的轨道值
	float                                              HuaChanTIMELine_BJ_DA266BB149E2B74251F4DBBE950BC685;        // 0x07C4   (0x0004)  // 时间轴 'HuaChanTIMELine' 中控制边距/暗角（BianJu）的轨道值
	float                                              HuaChanTIMELine_Z_DA266BB149E2B74251F4DBBE950BC685;         // 0x07C8   (0x0004)  // 时间轴 'HuaChanTIMELine' 中控制Z轴的轨道值
	TEnumAsByte<ETimelineDirection>                    HuaChanTIMELine__Direction_DA266BB149E2B74251F4DBBE950BC685; // 0x07CC   (0x0001)  // 时间轴 'HuaChanTIMELine' 的播放方向
	unsigned char                                      UnknownData11_6[0x3];                                       // 0x07CD   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          HuaChanTIMELine;                                            // 0x07D0   (0x0008)  // 用于控制滑铲（HuaChan）动画和效果的时间轴
	float                                              HitBlur2_Chorme_399A412148127E37ADE226A35824F656;           // 0x07D8   (0x0004)  // 时间轴 'HitBlur2' 中控制色差的轨道值
	TEnumAsByte<ETimelineDirection>                    HitBlur2__Direction_399A412148127E37ADE226A35824F656;       // 0x07DC   (0x0001)  // 时间轴 'HitBlur2' 的播放方向
	unsigned char                                      UnknownData12_6[0x3];                                       // 0x07DD   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          HitBlur2;                                                   // 0x07E0   (0x0008)  // 受击模糊效果时间轴2
	float                                              EMPBlur_Chorme_C982946648FDB3368E8DEBB9F77C161F;            // 0x07E8   (0x0004)  // 时间轴 'EMPBlur' 中控制色差的轨道值
	TEnumAsByte<ETimelineDirection>                    EMPBlur__Direction_C982946648FDB3368E8DEBB9F77C161F;        // 0x07EC   (0x0001)  // 时间轴 'EMPBlur' 的播放方向
	unsigned char                                      UnknownData13_6[0x3];                                       // 0x07ED   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          EMPBlur;                                                    // 0x07F0   (0x0008)  // EMP效果的模糊时间轴
	float                                              TelePostOut_Chorme_CE85550C42871D79092BB1A57545095C;        // 0x07F8   (0x0004)  // 时间轴 'TelePostOut' 中控制色差的轨道值
	TEnumAsByte<ETimelineDirection>                    TelePostOut__Direction_CE85550C42871D79092BB1A57545095C;    // 0x07FC   (0x0001)  // 时间轴 'TelePostOut' 的播放方向
	unsigned char                                      UnknownData14_6[0x3];                                       // 0x07FD   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          TelePostOut;                                                // 0x0800   (0x0008)  // 传送出（Teleport Out）效果的时间轴
	float                                              TelePostIn_Chorme_ACF679BF431B1C8A023B7BBC5558DBD9;         // 0x0808   (0x0004)  // 时间轴 'TelePostIn' 中控制色差的轨道值
	TEnumAsByte<ETimelineDirection>                    TelePostIn__Direction_ACF679BF431B1C8A023B7BBC5558DBD9;     // 0x080C   (0x0001)  // 时间轴 'TelePostIn' 的播放方向
	unsigned char                                      UnknownData15_6[0x3];                                       // 0x080D   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          TelePostIn;                                                 // 0x0810   (0x0008)  // 传送入（Teleport In）效果的时间轴
	float                                              HitBlur_Chorme_3167C4314FD11285E2FDDCB88C580FA7;            // 0x0818   (0x0004)  // 时间轴 'HitBlur' 中控制色差的轨道值
	TEnumAsByte<ETimelineDirection>                    HitBlur__Direction_3167C4314FD11285E2FDDCB88C580FA7;        // 0x081C   (0x0001)  // 时间轴 'HitBlur' 的播放方向
	unsigned char                                      UnknownData16_6[0x3];                                       // 0x081D   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          HitBlur;                                                    // 0x0820   (0x0008)  // 受击模糊效果时间轴
	float                                              Timeline_0_Chorme_1103061549402F75D762EFA72BAD2EFC;         // 0x0828   (0x0004)  // 时间轴 'Timeline' 中控制色差的轨道值
	TEnumAsByte<ETimelineDirection>                    Timeline_0__Direction_1103061549402F75D762EFA72BAD2EFC;     // 0x082C   (0x0001)  // 时间轴 'Timeline' 的播放方向
	unsigned char                                      UnknownData17_6[0x3];                                       // 0x082D   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          Timeline;                                                   // 0x0830   (0x0008)  // 通用时间轴0
	float                                              PlayerMoveRunWall_RunWall_4EE9B10C42CB9B911CE47C9FFA2E23EC; // 0x0838   (0x0004)  // 时间轴 'PlayerMoveRunWall' 中控制跑墙效果的轨道值
	TEnumAsByte<ETimelineDirection>                    PlayerMoveRunWall__Direction_4EE9B10C42CB9B911CE47C9FFA2E23EC; // 0x083C   (0x0001)  // 时间轴 'PlayerMoveRunWall' 的播放方向
	unsigned char                                      UnknownData18_6[0x3];                                       // 0x083D   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          PlayerMoveRunWall;                                          // 0x0840   (0x0008)  // 玩家跑墙移动的时间轴
	float                                              ShunBlur_Chorme_AF525CB34202432A4435F38A71A66BB2;           // 0x0848   (0x0004)  // 时间轴 'ShunBlur' 中控制色差的轨道值
	TEnumAsByte<ETimelineDirection>                    ShunBlur__Direction_AF525CB34202432A4435F38A71A66BB2;       // 0x084C   (0x0001)  // 时间轴 'ShunBlur' 的播放方向
	unsigned char                                      UnknownData19_6[0x3];                                       // 0x084D   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          ShunBlur;                                                   // 0x0850   (0x0008)  // 瞬移（ShunYi）模糊效果的时间轴
	float                                              MeleePowerSlowTimeHnad_TimeSlow_3A93DE8545CE4C6C116DAA8C3BAD5B1F; // 0x0858   (0x0004)  // 近战强力攻击手部慢动作时间轴中的时间减速轨道值
		TEnumAsByte<ETimelineDirection>                    MeleePowerSlowTimeHnad__Direction_3A93DE8545CE4C6C116DAA8C3BAD5B1F; // 0x085C   (0x0001)  // 时间轴 'MeleePowerSlowTimeHnad' 的播放方向
	unsigned char                                      UnknownData20_6[0x3];                                       // 0x085D   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          MeleePowerSlowTimeHnad;                                     // 0x0860   (0x0008)  // 强力近战攻击时手部慢动作的时间轴
	float                                              MeleePowerSlowTime_TimeSlow_A6325DDC450533CAA76E799548BC6B9F; // 0x0868   (0x0004)  // 时间轴 'MeleePowerSlowTime' 中控制时间减速的轨道值
	TEnumAsByte<ETimelineDirection>                    MeleePowerSlowTime__Direction_A6325DDC450533CAA76E799548BC6B9F; // 0x086C   (0x0001)  // 时间轴 'MeleePowerSlowTime' 的播放方向
	unsigned char                                      UnknownData21_6[0x3];                                       // 0x086D   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          MeleePowerSlowTime;                                         // 0x0870   (0x0008)  // 强力近战攻击慢动作的时间轴
	float                                              MeleePowerBlur_Chorme_9484ECE2482B7D3F7A4AC1818CB1C01E;     // 0x0878   (0x0004)  // 时间轴 'MeleePowerBlur' 中控制色差的轨道值
	TEnumAsByte<ETimelineDirection>                    MeleePowerBlur__Direction_9484ECE2482B7D3F7A4AC1818CB1C01E; // 0x087C   (0x0001)  // 时间轴 'MeleePowerBlur' 的播放方向
	unsigned char                                      UnknownData22_6[0x3];                                       // 0x087D   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          MeleePowerBlur;                                             // 0x0880   (0x0008)  // 强力近战攻击模糊效果的时间轴
	float                                              GanRao_Chorme_1493B75A4B0D28BF7F67EEAFA91E4620;             // 0x0888   (0x0004)  // 时间轴 'GanRao' 中控制色差的轨道值
	TEnumAsByte<ETimelineDirection>                    GanRao__Direction_1493B75A4B0D28BF7F67EEAFA91E4620;         // 0x088C   (0x0001)  // 时间轴 'GanRao' 的播放方向
	unsigned char                                      UnknownData23_6[0x3];                                       // 0x088D   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          GanRao;                                                     // 0x0890   (0x0008)  // 用于干扰（GanRao）/屏幕扭曲效果的时间轴
	float                                              QYQAISlowTime_TimeSlow_446032AE4B187A77E549DEA8D1EEE4D3;    // 0x0898   (0x0004)  // 时间轴 'QYQAISlowTime' 中控制时间减速的轨道值
	TEnumAsByte<ETimelineDirection>                    QYQAISlowTime__Direction_446032AE4B187A77E549DEA8D1EEE4D3;  // 0x089C   (0x0001)  // 时间轴 'QYQAISlowTime' 的播放方向
	unsigned char                                      UnknownData24_6[0x3];                                       // 0x089D   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          QYQAISlowTime;                                              // 0x08A0   (0x0008)  // AI使用牵引枪（QYQ）时的慢动作时间轴
	float                                              UpLightChrome_Chorme_B3995AA542C00741B557A1B04AFA67DC;      // 0x08A8   (0x0004)  // 时间轴 'UpLightChrome' 中控制色差的轨道值
	TEnumAsByte<ETimelineDirection>                    UpLightChrome__Direction_B3995AA542C00741B557A1B04AFA67DC;  // 0x08AC   (0x0001)  // 时间轴 'UpLightChrome' 的播放方向
	unsigned char                                      UnknownData25_6[0x3];                                       // 0x08AD   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          UpLightChrome;                                              // 0x08B0   (0x0008)  // 上挑光剑攻击的色差效果时间轴
	float                                              HuaChanFootMoveLoc_Z_090C0883444B8A92C9367D944F989567;      // 0x08B8   (0x0004)  // 时间轴 'HuaChanFootMoveLoc' 中控制Z轴位置的轨道值
	float                                              HuaChanFootMoveLoc_X_090C0883444B8A92C9367D944F989567;      // 0x08BC   (0x0004)  // 时间轴 'HuaChanFootMoveLoc' 中控制X轴位置的轨道值
	TEnumAsByte<ETimelineDirection>                    HuaChanFootMoveLoc__Direction_090C0883444B8A92C9367D944F989567; // 0x08C0   (0x0001)  // 时间轴 'HuaChanFootMoveLoc' 的播放方向
	unsigned char                                      UnknownData26_6[0x7];                                       // 0x08C1   (0x0007)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          HuaChanFootMoveLoc;                                         // 0x08C8   (0x0008)  // 控制滑铲（HuaChan）时脚部移动位置的时间轴
	FVector                                            CrouchFootLoc_Scale_A13E0F9D46D33B0DBD35269E0BD123B8;       // 0x08D0   (0x000C)  // 时间轴 'CrouchFootLoc' 中控制缩放的矢量轨道值
	float                                              CrouchFootLoc_X_A13E0F9D46D33B0DBD35269E0BD123B8;           // 0x08DC   (0x0004)  // 时间轴 'CrouchFootLoc' 中控制X轴位置的轨道值
	float                                              CrouchFootLoc_Z_A13E0F9D46D33B0DBD35269E0BD123B8;           // 0x08E0   (0x0004)  // 时间轴 'CrouchFootLoc' 中控制Z轴位置的轨道值
	TEnumAsByte<ETimelineDirection>                    CrouchFootLoc__Direction_A13E0F9D46D33B0DBD35269E0BD123B8;  // 0x08E4   (0x0001)  // 时间轴 'CrouchFootLoc' 的播放方向
	unsigned char                                      UnknownData27_6[0x3];                                       // 0x08E5   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          CrouchFootLoc;                                              // 0x08E8   (0x0008)  // 控制蹲下时脚部位置的时间轴
	float                                              Chrome2_Chorme_DAA6DEC045777F868CF13B8CBB282F35;            // 0x08F0   (0x0004)  // 时间轴 'Chrome2' 中控制色差的轨道值
	TEnumAsByte<ETimelineDirection>                    Chrome2__Direction_DAA6DEC045777F868CF13B8CBB282F35;        // 0x08F4   (0x0001)  // 时间轴 'Chrome2' 的播放方向
	unsigned char                                      UnknownData28_6[0x3];                                       // 0x08F5   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          Chrome2;                                                    // 0x08F8   (0x0008)  // 色差效果时间轴2
	float                                              ChromeTimeLine_Chorme_357B7FCA4702629DC81483A65AF4CAC4;     // 0x0900   (0x0004)  // 时间轴 'ChromeTimeLine' 中控制色差的轨道值
	TEnumAsByte<ETimelineDirection>                    ChromeTimeLine__Direction_357B7FCA4702629DC81483A65AF4CAC4; // 0x0904   (0x0001)  // 时间轴 'ChromeTimeLine' 的播放方向
	unsigned char                                      UnknownData29_6[0x3];                                       // 0x0905   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          ChromeTimeLine;                                             // 0x0908   (0x0008)  // 通用的色差效果时间轴
	float                                              JumpAttackSlow_Time_E3AC434B4D1E384BDA8CA6906D8066CB;       // 0x0910   (0x0004)  // 时间轴 'JumpAttackSlow' 中控制时间的轨道值
	TEnumAsByte<ETimelineDirection>                    JumpAttackSlow__Direction_E3AC434B4D1E384BDA8CA6906D8066CB; // 0x0914   (0x0001)  // 时间轴 'JumpAttackSlow' 的播放方向
	unsigned char                                      UnknownData30_6[0x3];                                       // 0x0915   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          JumpAttackSlow;                                             // 0x0918   (0x0008)  // 跳跃攻击慢动作的时间轴
	float                                              UpLightSwordTimeRate_Time_5C3E321147FF33C2CDBDA0A849C08614; // 0x0920   (0x0004)  // 时间轴 'UpLightSwordTimeRate' 中控制时间的轨道值
	TEnumAsByte<ETimelineDirection>                    UpLightSwordTimeRate__Direction_5C3E321147FF33C2CDBDA0A849C08614; // 0x0924   (0x0001)  // 时间轴 'UpLightSwordTimeRate' 的播放方向
	unsigned char                                      UnknownData31_6[0x3];                                       // 0x0925   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          UpLightSwordTimeRate;                                       // 0x0928   (0x0008)  // 控制上挑光剑攻击播放速率的时间轴
	float                                              UpLightSwrodCameraLoc_Z_C48951B34CA962A8884A62AF16EFEEED;   // 0x0930   (0x0004)  // 时间轴 'UpLightSwrodCameraLoc' 中控制Z轴位置的轨道值
	TEnumAsByte<ETimelineDirection>                    UpLightSwrodCameraLoc__Direction_C48951B34CA962A8884A62AF16EFEEED; // 0x0934   (0x0001)  // 时间轴 'UpLightSwrodCameraLoc' 的播放方向
	unsigned char                                      UnknownData32_6[0x3];                                       // 0x0935   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          UpLightSwrodCameraLoc;                                      // 0x0938   (0x0008)  // 控制上挑光剑时相机位置的时间轴
	float                                              PostPorcess_PostProcess_809A480448348B589F49D7ACEB6C067A;   // 0x0940   (0x0004)  // 时间轴 'PostPorcess' 中控制后期处理效果的轨道值
	TEnumAsByte<ETimelineDirection>                    PostPorcess__Direction_809A480448348B589F49D7ACEB6C067A;    // 0x0944   (0x0001)  // 时间轴 'PostPorcess' 的播放方向
	unsigned char                                      UnknownData33_6[0x3];                                       // 0x0945   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          PostPorcess;                                                // 0x0948   (0x0008)  // 通用的后期处理效果时间轴
	float                                              Player_HuaDowns_Randio_CBE6E4704F0477EF843757B74DDE2462;    // 0x0950   (0x0004)  // 时间轴 'Player_HuaDowns' 中控制半径（Radius）的轨道值
	float                                              Player_HuaDowns_Z_CBE6E4704F0477EF843757B74DDE2462;         // 0x0954   (0x0004)  // 时间轴 'Player_HuaDowns' 中控制Z轴位置的轨道值
	TEnumAsByte<ETimelineDirection>                    Player_HuaDowns__Direction_CBE6E4704F0477EF843757B74DDE2462; // 0x0958   (0x0001)  // 时间轴 'Player_HuaDowns' 的播放方向
	unsigned char                                      UnknownData34_6[0x7];                                       // 0x0959   (0x0007)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          Player_HuaDowns;                                            // 0x0960   (0x0008)  // 玩家滑下（HuaDowns）斜坡时的动画时间轴
	float                                              UnCrouch2_Z_7E47216447188BABF198469DFA9A4844;               // 0x0968   (0x0004)  // 时间轴 'UnCrouch2' 中控制Z轴位置的轨道值
	TEnumAsByte<ETimelineDirection>                    UnCrouch2__Direction_7E47216447188BABF198469DFA9A4844;      // 0x096C   (0x0001)  // 时间轴 'UnCrouch2' 的播放方向
	unsigned char                                      UnknownData35_6[0x3];                                       // 0x096D   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          UnCrouch2;                                                  // 0x0970   (0x0008)  // 站起（UnCrouch）的动画时间轴2
	float                                              UnCrouch_Z_7395FC5D40268E1293ECCFAFD9053EC0;                // 0x0978   (0x0004)  // 时间轴 'UnCrouch' 中控制Z轴位置的轨道值
	TEnumAsByte<ETimelineDirection>                    UnCrouch__Direction_7395FC5D40268E1293ECCFAFD9053EC0;       // 0x097C   (0x0001)  // 时间轴 'UnCrouch' 的播放方向
	unsigned char                                      UnknownData36_6[0x3];                                       // 0x097D   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          UnCrouch;                                                   // 0x0980   (0x0008)  // 站起（UnCrouch）的动画时间轴
	float                                              Crouch_Z_EC1EDB1A45CCC1CAD111C9A091B2AD41;                  // 0x0988   (0x0004)  // 时间轴 'Crouch' 中控制Z轴位置的轨道值
	TEnumAsByte<ETimelineDirection>                    Crouch__Direction_EC1EDB1A45CCC1CAD111C9A091B2AD41;         // 0x098C   (0x0001)  // 时间轴 'Crouch' 的播放方向
	unsigned char                                      UnknownData37_6[0x3];                                       // 0x098D   (0x0003)  MISSED      // 可能的内存对齐填充
	class UTimelineComponent*                          Crouch;                                                     // 0x0990   (0x0008)  // 蹲下（Crouch）的动画时间轴
	FVector                                            WeaponParOffset;                                            // 0x0998   (0x000C)  // 武器粒子效果的偏移量
	float                                              BaseTurnRate;                                               // 0x09A4   (0x0004)  // 基础转身速率
	float                                              BaseLookUpRate;                                             // 0x09A8   (0x0004)  // 基础抬头速率
	bool                                               UsingMotionControllers_;                                    // 0x09AC   (0x0001)  // 是否正在使用运动控制器
	unsigned char                                      UnknownData38_6[0x3];                                       // 0x09AD   (0x0003)  MISSED      // 可能的内存对齐填充
	class UClass*                                      Weapon;                                                     // 0x09B0   (0x0008)  // 武器蓝图类
	class UClass*                                      Weapon3;                                                    // 0x09B8   (0x0008)  // 武器蓝图类3
	class UClass*                                      Weapon2;                                                    // 0x09C0   (0x0008)  // 武器蓝图类2
	class UClass*                                      Weapon9;                                                    // 0x09C8   (0x0008)  // 武器蓝图类9
	TArray<class AActor*>                              NowWeaponTagActor;                                          // 0x09D0   (0x0010)  // 当前武器标签相关的所有Actor
	class UAnimMontage*                                WeaponMeleeMontage;                                         // 0x09E0   (0x0008)  // 武器近战的动画蒙太奇
	class UWidgetComponent*                            NowWeaponUILight;                                           // 0x09E8   (0x0008)  // 当前武器UI上的发光/高亮组件
	float                                              ReloadTime;                                                 // 0x09F0   (0x0004)  // 换弹时间
	float                                              PlayerHealth;                                               // 0x09F4   (0x0004)  // 玩家生命值
	float                                              MoveRight;                                                  // 0x09F8   (0x0004)  // 向右移动的输入值
	float                                              MoveForward;                                                // 0x09FC   (0x0004)  // 向前移动的输入值
	float                                              Reload2Time;                                                // 0x0A00   (0x0004)  // 换弹时间2（可能用于不同武器或模式）
	float                                              FireIntervals;                                              // 0x0A04   (0x0004)  // 开火间隔
	float                                              MeleeIntervals;                                             // 0x0A08   (0x0004)  // 近战攻击间隔
	float                                              WeaponDamage;                                               // 0x0A0C   (0x0004)  // 武器伤害值
	class ASkill_LightSword_Touch_C*                   Skill_LightSword_Touch;                                     // 0x0A10   (0x0008)  // 对光剑触摸技能的引用
	float                                              ReduceHit;                                                  // 0x0A18   (0x0004)  // 受击减伤值
	float                                              MaxRunSpeed;                                                // 0x0A1C   (0x0004)  // 最大奔跑速度
	float                                              MaxWalkSpeed;                                               // 0x0A20   (0x0004)  // 最大行走速度
	float                                              MeleeDamage;                                                // 0x0A24   (0x0004)  // 近战伤害值
	float                                              MaxCrouchSpeed;                                             // 0x0A28   (0x0004)  // 最大蹲下速度
	float                                              MaxAddSpeed;                                                // 0x0A2C   (0x0004)  // 最大瞄准（ADS）移动速度
	float                                              SwimmingUp_CameraRot;                                       // 0x0A30   (0x0004)  // 向上游泳时的相机旋转
	float                                              SwimmingDown_CameraRot;                                     // 0x0A34   (0x0004)  // 向下游泳时的相机旋转
	float                                              TickTime;                                                   // 0x0A38   (0x0004)  // Tick函数的间隔时间
	bool                                               IsFireBP;                                                   // 0x0A3C   (0x0001)  // 是否正在执行蓝图中的开火逻辑
	bool                                               IsLeftLoc;                                                  // 0x0A3D   (0x0001)  // 是否在左侧位置
	bool                                               IsRightLoc;                                                 // 0x0A3E   (0x0001)  // 是否在右侧位置
	bool                                               IsReload;                                                   // 0x0A3F   (0x0001)  // 是否正在换弹
	bool                                               IsReload2;                                                  // 0x0A40   (0x0001)  // 是否正在执行换弹逻辑2
	bool                                               IsFireReload;                                               // 0x0A41   (0x0001)  // 是否在开火后立即换弹
	bool                                               IsRun;                                                      // 0x0A42   (0x0001)  // 是否正在奔跑
	bool                                               NoReaload;                                                  // 0x0A43   (0x0001)  // （拼写错误）是否禁止换弹
	bool                                               NoAmmo;                                                     // 0x0A44   (0x0001)  // 是否没有弹药
	bool                                               IsAmmo_Max;                                                 // 0x0A45   (0x0001)  // 弹药是否已满
	bool                                               IsMeleeBP;                                                  // 0x0A46   (0x0001)  // 是否正在执行蓝图中的近战逻辑
	bool                                               IsMelee;                                                    // 0x0A47   (0x0001)  // 是否正在近战
	bool                                               IsSwing;                                                    // 0x0A48   (0x0001)  // 是否正在挥舞（武器）
	bool                                               IsPutDown;                                                  // 0x0A49   (0x0001)  // 是否正在放下武器
	bool                                               IsEqiuWeapon;                                               // 0x0A4A   (0x0001)  // （拼写错误）是否已装备武器
	bool                                               IsAutoFire;                                                 // 0x0A4B   (0x0001)  // 是否为自动开火模式
	bool                                               IsShopEquipWeapon;                                          // 0x0A4C   (0x0001)  // 是否在商店中装备武器
	bool                                               IsPressShift;                                               // 0x0A4D   (0x0001)  // 是否按下了Shift键
	bool                                               WSongKai_;                                                  // 0x0A4E   (0x0001)  // W键是否松开（SongKai）
	bool                                               IsAdd;                                                      // 0x0A4F   (0x0001)  // 是否正在瞄准（ADS）
	bool                                               IsAdd_Close_;                                               // 0x0A50   (0x0001)  // 是否正在关闭瞄准状态
	unsigned char                                      UnknownData39_6[0x3];                                       // 0x0A51   (0x0003)  MISSED      // 可能的内存对齐填充
	int32_t                                            NowAmmo;                                                    // 0x0A54   (0x0004)  // 当前弹药量
	int32_t                                            MaxAmmo;                                                    // 0x0A58   (0x0004)  // 最大弹药量
	int32_t                                            NeedAmmo;                                                   // 0x0A5C   (0x0004)  // 换弹所需的弹药量
	int32_t                                            DefuWeaponAmmo;                                             // 0x0A60   (0x0004)  // 默认武器的弹药量
	int32_t                                            WeaponID;                                                   // 0x0A64   (0x0004)  // 武器ID
	bool                                               IsPressFireButton;                                          // 0x0A68   (0x0001)  // 是否按下了开火键
	bool                                               DisableR;                                                   // 0x0A69   (0x0001)  // 是否禁用换弹（R键）
	bool                                               DisableFire;                                                // 0x0A6A   (0x0001)  // 是否禁用开火```
		unsigned char                                      UnknownData40_6[0x5];                                       // 0x0A6B   (0x0005)  MISSED      // 可能的内存对齐填充
	class USaveGame*                                   GamePlaySave;                                               // 0x0A70   (0x0008)  // 游戏存档对象的实例
	FString                                            GamePlaySaveName;                                           // 0x0A78   (0x0010)  // 游戏存档文件的名称
	bool                                               IsNoAmmo;                                                   // 0x0A88   (0x0001)  // 当前武器是否没有弹药
	bool                                               WeaponID1_NoAmmo;                                           // 0x0A89   (0x0001)  // 武器1是否没有弹药
	bool                                               WeaponID2_NoAmmo;                                           // 0x0A8A   (0x0001)  // 武器2是否没有弹药
	bool                                               IsCrouchDrag;                                               // 0x0A8B   (0x0001)  // 是否为长按蹲下
	bool                                               IsCrouch;                                                   // 0x0A8C   (0x0001)  // 是否正处于蹲下状态
	bool                                               CrouchToRun;                                                // 0x0A8D   (0x0001)  // 是否从蹲下状态直接进入奔跑
	unsigned char                                      UnknownData41_6[0x2];                                       // 0x0A8E   (0x0002)  MISSED      // 可能的内存对齐填充
	class AAIFindPoint_C*                              AI_Find_Point;                                              // 0x0A90   (0x0008)  // 对AI寻路点的引用
	FVector                                            HookLocation;                                               // 0x0A98   (0x000C)  // 钩爪的目标位置
	bool                                               IsNoHit_;                                                   // 0x0AA4   (0x0001)  // 是否处于无敌/未受击状态
	bool                                               IsDead_;                                                    // 0x0AA5   (0x0001)  // 是否已死亡
	bool                                               IsLowHealthRest_;                                           // 0x0AA6   (0x0001)  // 是否在低生命值状态下恢复
	bool                                               Hook;                                                       // 0x0AA7   (0x0001)  // 钩爪是否已激活
	bool                                               HookMoveFinished;                                           // 0x0AA8   (0x0001)  // 钩爪移动是否已完成
	unsigned char                                      UnknownData42_6[0x7];                                       // 0x0AA9   (0x0007)  MISSED      // 可能的内存对齐填充
	SDK_UNDEFINED(16,823) /* FMulticastInlineDelegate */ __um(Level_Swing);                                        // 0x0AB0   (0x0010)  // 用于广播关卡中“摆荡”事件的多播委托
	bool                                               HookCanOff;                                                 // 0x0AC0   (0x0001)  // 钩爪是否可以脱离
	bool                                               HookNoSpace;                                                // 0x0AC1   (0x0001)  // 钩爪目标点是否没有足够空间
	unsigned char                                      UnknownData43_6[0x6];                                       // 0x0AC2   (0x0006)  MISSED      // 可能的内存对齐填充
	SDK_UNDEFINED(16,824) /* FMulticastInlineDelegate */ __um(Level_LeaveHook);                                    // 0x0AC8   (0x0010)  // 用于广播“离开钩爪点”事件的多播委托
	bool                                               S_ReduceHit;                                                // 0x0AD8   (0x0001)  // 服务器端的减伤标记
	bool                                               IsCG;                                                       // 0x0AD9   (0x0001)  // 是否正在播放过场动画 (Cinematic Graphic)
	bool                                               IsBackHome;                                                 // 0x0ADA   (0x0001)  // 是否正在返回基地
	bool                                               IsCanBackHome_;                                             // 0x0ADB   (0x0001)  // 是否可以返回基地
	unsigned char                                      UnknownData44_6[0x4];                                       // 0x0ADC   (0x0004)  MISSED      // 可能的内存对齐填充
	SDK_UNDEFINED(16,825) /* FMulticastInlineDelegate */ __um(Level_BackHome);                                     // 0x0AE0   (0x0010)  // 用于广播“返回基地”事件的多播委托
	SDK_UNDEFINED(16,826) /* FMulticastInlineDelegate */ __um(Level_BackHomeChangeFog);                            // 0x0AF0   (0x0010)  // 用于广播返回基地时“雾效变化”事件的多播委托
	bool                                               ActiveShopTrace;                                            // 0x0B00   (0x0001)  // 是否激活商店的射线检测
	bool                                               IsNewPlayerSkill;                                           // 0x0B01   (0x0001)  // 是否为新玩家技能（可能用于教程）
	unsigned char                                      UnknownData45_6[0x2];                                       // 0x0B02   (0x0002)  MISSED      // 可能的内存对齐填充
	FName                                              NowWeaponName;                                              // 0x0B04   (0x0008)  // 当前武器的名称
	bool                                               IsLightSwordAim;                                            // 0x0B0C   (0x0001)  // 是否正在使用光剑瞄准
	bool                                               CloseHookTrace;                                             // 0x0B0D   (0x0001)  // 是否关闭钩爪的射线检测
	bool                                               HookManyISTure;                                             // 0x0B0E   (0x0001)  // （可能拼写错误）钩爪是否可以连续使用
	bool                                               IsLightSword_CDTime;                                        // 0x0B0F   (0x0001)  // 光剑技能是否在冷却中
	bool                                               IsLightSwordQTE;                                            // 0x0B10   (0x0001)  // 是否触发了光剑的QTE（快速反应事件）
	bool                                               IsLightSwordQTE2;                                           // 0x0B11   (0x0001)  // 是否触发了光剑的QTE 2
	bool                                               IsLightSword;                                               // 0x0B12   (0x0001)  // 是否正在使用光剑
	bool                                               IsTeleport;                                                 // 0x0B13   (0x0001)  // 是否正在传送
	bool                                               IsTeleportCDTime;                                           // 0x0B14   (0x0001)  // 传送技能是否在冷却中
	bool                                               IsFlaseTeleport;                                            // 0x0B15   (0x0001)  // 是否为一次无效的传送
	unsigned char                                      UnknownData46_6[0x2];                                       // 0x0B16   (0x0002)  MISSED      // 可能的内存对齐填充
	class AActor*                                      TeleportAI;                                                 // 0x0B18   (0x0008)  // 传送目标的AI Actor
	TArray<FName>                                      DefuTeleportTag;                                            // 0x0B20   (0x0010)  // 传送目标的默认标签
	TArray<FName>                                      IsLockTeleportTag;                                          // 0x0B30   (0x0010)  // 锁定的传送目标的标签
	FVector                                            TeleportAILoction;                                          // 0x0B40   (0x000C)  // 传送目标的AI位置
	unsigned char                                      UnknownData47_6[0x4];                                       // 0x0B4C   (0x0004)  MISSED      // 可能的内存对齐填充
	class USphereComponent*                            TeleportTouch;                                              // 0x0B50   (0x0008)  // 用于检测传送的球形触发器
	bool                                               IsXChange;                                                  // 0x0B58   (0x0001)  // 是否正在切换（武器/模式）
	bool                                               IsXChangeCDTime;                                            // 0x0B59   (0x0001)  // 切换技能是否在冷却中
	unsigned char                                      UnknownData48_6[0x6];                                       // 0x0B5A   (0x0006)  MISSED      // 可能的内存对齐填充
	SDK_UNDEFINED(16,827) /* FMulticastInlineDelegate */ __um(HitAP);                                              // 0x0B60   (0x0010)  // 用于广播“命中护甲点（Armor Point）”事件的多播委托
	FName                                              Weapon1Name;                                                // 0x0B70   (0x0008)  // 武器1的名称
	FName                                              Weapon2Name;                                                // 0x0B78   (0x0008)  // 武器2的名称
	bool                                               IsXChangeCDTimeAll;                                         // 0x0B80   (0x0001)  // 切换技能是否处于全局冷却
	bool                                               S_AirFire;                                                  // 0x0B81   (0x0001)  // 服务器端的空中开火标记
	bool                                               LockMouse;                                                  // 0x0B82   (0x0001)  // 是否锁定鼠标
	unsigned char                                      UnknownData49_6[0x5];                                       // 0x0B83   (0x0005)  MISSED      // 可能的内存对齐填充
	SDK_UNDEFINED(16,828) /* FMulticastInlineDelegate */ __um(Click);                                              // 0x0B88   (0x0010)  // 用于广播“点击”事件的多播委托
	bool                                               IsUIMain_;                                                  // 0x0B98   (0x0001)  // 是否在主UI界面
	bool                                               CIsNewPlayer_LightSword_;                                   // 0x0B99   (0x0001)  // 是否为新玩家且解锁了光剑（用于教程）
	bool                                               CIsNewPlayer_EMP_;                                          // 0x0B9A   (0x0001)  // 是否为新玩家且解锁了EMP（用于教程）
	bool                                               CIsNewPlayer_Teleport_;                                     // 0x0B9B   (0x0001)  // 是否为新玩家且解锁了传送（用于教程）
	bool                                               CloseMission_;                                              // 0x0B9C   (0x0001)  // 是否关闭了任务
	bool                                               Teleport_TouchFinish;                                       // 0x0B9D   (0x0001)  // 传送的触摸交互是否完成
	unsigned char                                      UnknownData50_6[0x2];                                       // 0x0B9E   (0x0002)  MISSED      // 可能的内存对齐填充
	class UWeapon_HUD_C*                               WeaponHUD;                                                  // 0x0BA0   (0x0008)  // 武器HUD（平视显示器）的引用
	bool                                               IsTeleport_Trace;                                           // 0x0BA8   (0x0001)  // 是否正在进行传送的射线检测
	unsigned char                                      UnknownData51_6[0x7];                                       // 0x0BA9   (0x0007)  MISSED      // 可能的内存对齐填充
	class UParticleSystemComponent*                    Rain_Par;                                                   // 0x0BB0   (0x0008)  // 下雨的粒子效果组件
	class UScrenHUD_UMG_C*                             Scren_HUD;                                                  // 0x0BB8   (0x0008)  // 屏幕HUD的引用 (Scren可能是Screen的拼写错误)
	class UAudioComponent*                             LowHealthAudio;                                             // 0x0BC0   (0x0008)  // 低生命值提示音的音频组件
	class UCameraComponent*                            AddCameraBP;                                                // 0x0BC8   (0x0008)  // 瞄准（ADS）时的相机蓝图
	bool                                               IsAdd_Reloading_;                                           // 0x0BD0   (0x0001)  // 瞄准时是否正在换弹
	bool                                               IsAdd_SelcetWeapon;                                         // 0x0BD1   (0x0001)  // 瞄准时是否在选择武器 (Selcet可能是Select的拼写错误)
	unsigned char                                      UnknownData52_6[0xE];                                       // 0x0BD2   (0x000E)  MISSED      // 可能的内存对齐填充
	FTransform                                         WeaponAddTransform;                                         // 0x0BE0   (0x0030)  // 武器在瞄准状态下的变换信息
	FVector                                            HandLocction;                                               // 0x0C10   (0x000C)  // 手部的位置 (Locction可能是Location的拼写错误)
	FRotator                                           HandRotator;                                                // 0x0C1C   (0x000C)  // 手部的旋转
	bool                                               GER_TraceIsOK_;                                             // 0x0C28   (0x0001)  // 一个特定的射线检测是否成功
	unsigned char                                      UnknownData53_6[0x7];                                       // 0x0C29   (0x0007)  MISSED      // 可能的内存对齐填充
	TArray<float>                                      Weapon_FireUp;                                              // 0x0C30   (0x0010)  // 武器开火后坐力（向上）的数组
	TArray<float>                                      Weapon_FireDown;                                            // 0x0C40   (0x0010)  // 武器开火后坐力（向下）的数组
	TArray<float>                                      Weapon_FireLeft;                                            // 0x0C50   (0x0010)  // 武器开火后坐力（向左）的数组
	TArray<float>                                      Weapon_FireRight;                                           // 0x0C60   (0x0010)  // 武器开火后坐力（向右）的数组
	int32_t                                            WeaponFire_Get;                                             // 0x0C70   (0x0004)  // 获取武器开火后坐力模式的索引
	float                                              AddFov;                                                     // 0x0C74   (0x0004)  // 瞄准时的视野（Field of View）
	bool                                               UnAddLightSword;                                            // 0x0C78   (0x0001)  // 是否取消光剑的瞄准
	bool                                               IsPressShift_Add;                                           // 0x0C79   (0x0001)  // 瞄准时是否按下了Shift键
	unsigned char                                      UnknownData54_6[0x2];                                       // 0x0C7A   (0x0002)  MISSED      // 可能的内存对齐填充
	float                                              WeaponUD_Recoil_Min;                                        // 0x0C7C   (0x0004)  // 武器上下后坐力的最小值
	float                                              WeaponUD_Recoil_Max;                                        // 0x0C80   (0x0004)  // 武器上下后坐力的最大值
	float                                              WeaponLR_Recoil_Min;                                        // 0x0C84   (0x0004)  // 武器左右后坐力的最小值
	float                                              WeaponLR_Recoil_Max;                                        // 0x0C88   (0x0004)  // 武器左右后坐力的最大值
	unsigned char                                      UnknownData55_6[0x4];                                       // 0x0C8C   (0x0004)  MISSED      // 可能的内存对齐填充
	TArray<class UClass*>                              WeaponFire_Shake;                                           // 0x0C90   (0x0010)  // 武器开火时相机抖动的蓝图类数组
	int32_t                                            WeaponFire_Type;                                            // 0x0CA0   (0x0004)  // 武器开火类型
	int32_t                                            WeaponFireCount;                                            // 0x0CA4   (0x0004)  // 武器开火计数
	FVector                                            Climb_WallHeight;                                           // 0x0CA8   (0x000C)  // 攀爬墙体的高度
	FVector                                            Climb_WallNormal;                                           // 0x0CB4   (0x000C)  // 攀爬墙体的法线向量
	FVector                                            Climb_WallPoint;                                            // 0x0CC0   (0x000C)  // 攀爬墙体的点
	bool                                               CanClimbTrace_;                                             // 0x0CCC   (0x0001)  // 是否可以进行攀爬检测
	bool                                               IsClimb;                                                    // 0x0CCD   (0x0001)  // 是否正在攀爬
	bool                                               CanPressClimb;                                              // 0x0CCE   (0x0001)  // 是否可以按下攀爬键
	bool                                               IsBoom;                                                     // 0x0CCF   (0x0001)  // 是否使用了“爆炸”技能
	bool                                               IsBoomCDTime;                                               // 0x0CD0   (0x0001)  // “爆炸”技能是否在冷却中
	bool                                               Is_Press_SkillBoomP1;                                       // 0x0CD1   (0x0001)  // 是否按下了“爆炸”技能键P1
	bool                                               Is_Press_SkillBoomP2;                                       // 0x0CD2   (0x0001)  // 是否按下了“爆炸”技能键P2
	bool                                               IsBoom_AddDamgeTime;                                        // 0x0CD3   (0x0001)  // “爆炸”技能是否在增加伤害的时间内 (Damge可能是Damage的拼写错误)
	unsigned char                                      UnknownData56_6[0x4];                                       // 0x0CD4   (0x0004)  MISSED      // 可能的内存对齐填充
	TArray<FName>                                      DefuBossTeleportTag;                                        // 0x0CD8   (0x0010)  // Boss传送目标的默认标签
	TArray<FName>                                      IsLockBossTeleportTag;                                      // 0x0CE8   (0x0010)  // 锁定的Boss传送目标的标签
	bool                                               IsBoom_HandAnim;                                            // 0x0CF8   (0x0001)  // 是否正在播放“爆炸”技能的手部动画
	bool                                               CanLightSwordQTE_;                                          // 0x0CF9   (0x0001)  // 是否可以触发光剑QTE
	bool                                               IsCheckSwing;                                               // 0x0CFA   (0x0001)  // 是否正在检测摆荡
	bool                                               IsVR;                                                       // 0x0CFB   (0x0001)  // 是否处于VR模式
	float                                              WeaponShakeScale;                                           // 0x0CFC   (0x0004)  // 武器抖动的缩放比例
	int32_t                                            WeaponID_Pre;                                               // 0x0D00   (0x0004)  // 上一个武器的ID
	bool                                               First_Boom;                                                 // 0x0D04   (0x0001)  // 是否是第一次使用“爆炸”技能
	unsigned char                                      UnknownData57_6[0x3];                                       // 0x0D05   (0x0003)  MISSED      // 可能的内存对齐填充
	float                                              _shun_Velocity;                                             // 0x0D08   (0x0004)  // “瞬移”的速度
	float                                              _shun_Velocity5;                                            // 0x0D0C   (0x0004)  // “瞬移”的速度5
	bool                                               IsShun;                                                     // 0x0D10   (0x0001)  // 是否正在“瞬移”
	bool                                               IsShun_CDTime;                                              // 0x0D11   (0x0001)  // “瞬移”技能是否在冷却中
	bool                                               NeedInSeclectWeapon_Active;                                 // 0x0D12   (0x0001)  // 是否需要在激活状态下选择武器
	bool                                               NeedClimbOverSeclectWeapon;                                 // 0x0D13   (0x0001)  // 攀爬结束后是否需要选择武器
	bool                                               HookRot;                                                    // 0x0D14   (0x0001)  // 钩爪是否旋转
	unsigned char                                      UnknownData58_6[0x3];                                       // 0x0D15   (0x0003)  MISSED      // 可能的内存对齐填充
	class USkeletalMeshComponent*                      Hook_PlayerFoot;                                            // 0x0D18   (0x0008)  // 钩爪状态下玩家脚部的骨骼网格体
	bool                                               OneInSwing;                                                 // 0x0D20   (0x0001)  // 是否在一次摆荡中
	bool                                               InSwingArea_;                                               // 0x0D21   (0x0001)  // 是否在摆荡区域内
	unsigned char                                      UnknownData59_6[0x2];                                       // 0x0D22   (0x0002)  MISSED      // 可能的内存对齐填充
	float                                              Swing_HandHide_Distance;                                    // 0x0D24   (0x0004)  // 摆荡时手部隐藏的距离
	float                                              Swing_HandVis_Distance;                                     // 0x0D28   (0x0004)  // 摆荡时手部可见的距离
	bool                                               InPickUpArea_;                                              // 0x0D2C   (0x0001)  // 是否在拾取区域内
	bool                                               PickUpHUD_IsDisplay_;                                       // 0x0D2D   (0x0001)  // 拾取HUD是否正在显示
	bool                                               IsTracePickUpPress;                                         // 0x0D2E   (0x0001)  // 是否按下了拾取键进行射线检测
	unsigned char                                      UnknownData60_6[0x1];                                       // 0x0D2F   (0x0001)  MISSED      // 可能的内存对齐填充
	class UObject*                                     PickUp_BP;                                                  // 0x0D30   (0x0008)  // 拾取物品的蓝图对象
	bool                                               IsPickUpPreview_;                                           // 0x0D38   (0x0001)  // 是否处于拾取预览模式
	unsigned char                                      UnknownData61_6[0x3];                                       // 0x0D39   (0x0003)  MISSED      // 可能的内存对齐填充
	float                                              NowMouseLoc;                                                // 0x0D3C   (0x0004)  // 当前鼠标位置
	bool                                               PreviewModeLMouse_;                                         // 0x0D40   (0x0001)  // 预览模式下是否按下了鼠标左键
	bool                                               CanBackPreview_;                                            // 0x0D41   (0x0001)  // 是否可以返回预览
	bool                                               NoCDMode_;                                                  // 0x0D42   (0x0001)  // 是否开启了无冷却（No Cooldown）模式
	bool                                               CanVisRain_;                                                // 0x0D43   (0x0001)  // 是否可以渲染雨水效果 (Visible Rain)
	bool                                               PlayerInSpawn_;                                             // 0x0D44   (0x0001)  // 玩家是否在出生点区域内
	bool                                               IsCanClick_;                                                // 0x0D45   (0x0001)  // 当前是否可以点击（用于UI或交互）
	unsigned char                                      UnknownData62_6[0x2];                                       // 0x0D46   (0x0002)  MISSED      // 可能的内存对齐填充
	SDK_UNDEFINED(16,829) /* FMulticastInlineDelegate */ __um(OverClick);                                          // 0x0D48   (0x0010)  // 用于广播“点击完成”事件的多播委托
	bool                                               GM_CanUseLightSword_;                                       // 0x0D58   (0x0001)  // GM命令：是否允许使用光剑
	bool                                               GM_CanUseTeleport;                                          // 0x0D59   (0x0001)  // GM命令：是否允许使用传送
	bool                                               GM_CanUseXChange;                                           // 0x0D5A   (0x0001)  // GM命令：是否允许使用切换技能
	bool                                               GM_CanUseBoom;                                              // 0x0D5B   (0x0001)  // GM命令：是否允许使用爆炸技能
	bool                                               CIsNewPlayer_AllSkill_;                                     // 0x0D5C   (0x0001)  // 教程标记：新玩家是否已解锁所有技能
	unsigned char                                      UnknownData63_6[0x3];                                       // 0x0D5D   (0x0003)  MISSED      // 可能的内存对齐填充
	class UStaticMeshComponent*                        LightSwordMesh;                                             // 0x0D60   (0x0008)  // 光剑的静态网格体组件
	bool                                               IsAmmoHit_;                                                 // 0x0D68   (0x0001)  // 弹药是否命中目标
	bool                                               NoSelectWeapon;                                             // 0x0D69   (0x0001)  // 是否处于未选择武器的状态
	bool                                               InUseArea;                                                  // 0x0D6A   (0x0001)  // 是否在可交互区域内
	unsigned char                                      UnknownData64_6[0x5];                                       // 0x0D6B   (0x0005)  MISSED      // 可能的内存对齐填充
	SDK_UNDEFINED(16,830) /* FMulticastInlineDelegate */ __um(Level_Use);                                          // 0x0D70   (0x0010)  // 用于广播关卡中“使用”交互事件的多播委托
	bool                                               IsHandAnimTime;                                             // 0x0D80   (0x0001)  // 是否处于手部动画播放期间
	bool                                               IsHuaDown;                                                  // 0x0D81   (0x0001)  // 是否正在滑下（HuaDown）斜坡
	unsigned char                                      UnknownData65_6[0x6];                                       // 0x0D82   (0x0006)  MISSED      // 可能的内存对齐填充
	class UParticleSystem*                             HitBlood;                                                   // 0x0D88   (0x0008)  // 命中时的血液粒子效果
	float                                              TelePortSpeed;                                              // 0x0D90   (0x0004)  // 传送时的速度
	unsigned char                                      UnknownData66_6[0x4];                                       // 0x0D94   (0x0004)  MISSED      // 可能的内存对齐填充
	FWeightedBlendables                                RainPostProcess_Open;                                       // 0x0D98   (0x0010)  // 开启下雨效果时的后期处理混合权重
	FWeightedBlendables                                RainPostProcess_Close;                                      // 0x0DA8   (0x0010)  // 关闭下雨效果时的后期处理混合权重
	class UObject*                                     TelePort_TA_Cache;                                          // 0x0DB8   (0x0008)  // 传送目标Actor（TA）的缓存
	FVector                                            TeleportAI_Z;                                               // 0x0DC0   (0x000C)  // AI传送目标的Z轴偏移
	bool                                               CIsNewPlayer_LightSwordQTE_;                                // 0x0DCC   (0x0001)  // 教程标记：新玩家是否解锁了光剑QTE
	bool                                               CIsNewPlayer_LightSword_IsFinish_;                          // 0x0DCD   (0x0001)  // 教程标记：新玩家的光剑教学是否完成
	bool                                               IsNewPlayer_Shun;                                           // 0x0DCE   (0x0001)  // 教程标记：是否为新玩家的瞬移教学
	bool                                               IsCanAdd;                                                   // 0x0DCF   (0x0001)  // 是否可以进行瞄准（ADS）
	bool                                               PlayerIsAirFire;                                            // 0x0DD0   (0x0001)  // 玩家是否在空中开火
	bool                                               SettingPressAdd_;                                           // 0x0DD1   (0x0001)  // 设置项：是否为长按瞄准
	unsigned char                                      UnknownData67_6[0x6];                                       // 0x0DD2   (0x0006)  MISSED      // 可能的内存对齐填充
	SDK_UNDEFINED(16,831) /* FMulticastInlineDelegate */ __um(PickUpSendLevelEvent);                               // 0x0DD8   (0x0010)  // 用于广播“拾取物品”事件给关卡的多播委托
	class ASkillShop_BP_C*                             SkillShopBP;                                                // 0x0DE8   (0x0008)  // 对技能商店蓝图Actor的引用
	bool                                               IsSkillShop_;                                               // 0x0DF0   (0x0001)  // 是否在技能商店中
	unsigned char                                      UnknownData68_6[0x7];                                       // 0x0DF1   (0x0007)  MISSED      // 可能的内存对齐填充
	SDK_UNDEFINED(16,832) /* FMulticastInlineDelegate */ __um(CloseNewPlayerXPHUD);                                // 0x0DF8   (0x0010)  // 用于广播“关闭新玩家经验HUD”事件的多播委托
	FName                                              Weapon3Name;                                                // 0x0E08   (0x0008)  // 武器3的名称
	bool                                               WeaponID3_NoAmmo;                                           // 0x0E10   (0x0001)  // 武器3是否没有弹药
	bool                                               IsUpDateSkinFinish_;                                        // 0x0E11   (0x0001)  // 皮肤更新是否完成 (UpDate可能是Update的拼写错误)
	unsigned char                                      UnknownData69_6[0x2];                                       // 0x0E12   (0x0002)  MISSED      // 可能的内存对齐填充
	float                                              Mouse_XY_Rate;                                              // 0x0E14   (0x0004)  // 鼠标XY轴灵敏度
	float                                              GamePad_X_Rate;                                             // 0x0E18   (0x0004)  // 手柄X轴灵敏度
	bool                                               MouseX_Reversal_;                                           // 0x0E1C   (0x0001)  // 设置项：是否反转鼠标X轴
	bool                                               MouseY_Reversal_;                                           // 0x0E1D   (0x0001)  // 设置项：是否反转鼠标Y轴
	bool                                               PressCrouch_;                                               // 0x0E1E   (0x0001)  // 设置项：是否为长按蹲下
	bool                                               Subtitle_;                                                  // 0x0E1F   (0x0001)  // 设置项：是否显示字幕
	bool                                               WeaponHUD_;                                                 // 0x0E20   (0x0001)  // 设置项：是否显示武器HUD
	bool                                               Score_;                                                     // 0x0E21   (0x0001)  // 设置项：是否显示分数
	unsigned char                                      UnknownData70_6[0x2];                                       // 0x0E22   (0x0002)  MISSED      // 可能的内存对齐填充
	float                                              TelePortSpeedFrame;                                         // 0x0E24   (0x0004)  // 传送速度（逐帧计算）
	bool                                               IsOpenLightSwordQTE2_NewPlayer_;                            // 0x0E28   (0x0001)  // 教程标记：是否为新玩家开启了光剑QTE2
	bool                                               CIsNewPlayer_LightSwordQTE2_;                               // 0x0E29   (0x0001)  // 教程标记：新玩家是否解锁了光剑QTE2
	bool                                               IsLeaveGround_;                                             // 0x0E2A   (0x0001)  // 是否离开了地面
	unsigned char                                      UnknownData71_6[0x1];                                       // 0x0E2B   (0x0001)  MISSED      // 可能的内存对齐填充
	int32_t                                            Achivment_DoageNumber;                                      // 0x0E2C   (0x0004)  // 成就：闪避（Dodge）次数 (Doage可能是Dodge的拼写错误)
	bool                                               GM_CanUseLightSwordQTE1_;                                   // 0x0E30   (0x0001)  // GM命令：是否允许使用光剑QTE1
	bool                                               GM_CanUseLightSwordQTE2_;                                   // 0x0E31   (0x0001)  // GM命令：是否允许使用光剑QTE2
	bool                                               GM_CanUseDodge_;                                            // 0x0E32   (0x0001)  // GM命令：是否允许使用闪避
	bool                                               PlayerInSpawn_Skill_;                                       // 0x0E33   (0x0001)  // 玩家是否在出生点且可以学习技能
	bool                                               NewPlayer_LightSword_PlayerNoUse;                           // 0x0E34   (0x0001)  // 教程标记：新玩家光剑教学中，玩家是否未使用
	bool                                               Shun_PressA;                                                // 0x0E35   (0x0001)  // 瞬移（Shun）时是否按下了A键
	bool                                               Shun_PressS;                                                // 0x0E36   (0x0001)  // 瞬移（Shun）时是否按下了S键
	bool                                               Shun_PressD;                                                // 0x0E37   (0x0001)  // 瞬移（Shun）时是否按下了D键
	bool                                               IsHoldBack;                                                 // 0x0E38   (0x0001)  // 是否按住后退键
	bool                                               IsAutoAnim_;                                                // 0x0E39   (0x0001)  // 是否正在播放自动画
	unsigned char                                      UnknownData72_6[0x2];                                       // 0x0E3A   (0x0002)  MISSED      // 可能的内存对齐填充
	float                                              TelePortDealyRestCollision;                                 // 0x0E3C   (0x0004)  // 传送后恢复碰撞体的延迟 (Dealy可能是Delay的拼写错误)
	bool                                               SettingPressAddtoReload;                                    // 0x0E40   (0x0001)  // 设置项：瞄准时是否可以换弹
	bool                                               HideAllHUD_;                                                // 0x0E41   (0x0001)  // 是否隐藏所有HUD
	bool                                               SettingPressRun_;                                           // 0x0E42   (0x0001)  // 设置项：是否为长按奔跑
	bool                                               FeedBack_;                                                  // 0x0E43   (0x0001)  // 设置项：是否开启反馈（震动等）
	bool                                               PlayerMoveSpeed_500;                                        // 0x0E44   (0x0001)  // 玩家移动速度是否为500
	unsigned char                                      UnknownData73_6[0x3];                                       // 0x0E45   (0x0003)  MISSED      // 可能的内存对齐填充
	class UCrosshair_UMG_C*                            ZhunXinVar;                                                 // 0x0E48   (0x0008)  // 准星（ZhunXin）UI控件的变量
	bool                                               FighterReady_;                                              // 0x0E50   (0x0001)  // 战斗机/角色是否准备就绪
	bool                                               MetaLastFire_;                                              // 0x0E51   (0x0001)  // 是否为连发的最后一发子弹
	bool                                               NoAutoFireIntervalsFinish_;                                 // 0x0E52   (0x0001)  // 自动开火间隔是否未结束
	bool                                               IsUpLightSwordTime;                                         // 0x0E53   (0x0001)  // 是否处于上挑光剑的判定时间内
	bool                                               JumpAttack_SongKai_;                                        // 0x0E54   (0x0001)  // 跳跃攻击的按键是否已松开（SongKai）
	bool                                               IsJumpAttackTime;                                           // 0x0E55   (0x0001)  // 是否处于跳跃攻击的判定时间内
	bool                                               CanDouJump;                                                 // 0x0E56   (0x0001)  // 是否可以二段跳 (DouJump)
	bool                                               DouJumpIsOver;                                              // 0x0E57   (0x0001)  // 二段跳是否已用完
	bool                                               JumpAttackHeightNo;                                         // 0x0E58   (0x0001)  // 跳跃攻击高度是否不足
	bool                                               IsDefuLightSwordTime;                                       // 0x0E59   (0x0001)  // 是否处于防御（Defu）光剑的判定时间内
	bool                                               IsDefuLightSwordAnim;                                       // 0x0E5A   (0x0001)  // 是否正在播放防御光剑的动画
	bool                                               UpLightSwordSongKai_;                                       // 0x0E5B   (0x0001)  // 上挑光剑的按键是否已松开（SongKai）
	float                                              MaxDefuSpeed;                                               // 0x0E5C   (0x0004)  // 防御状态下的最大移动速度
	bool                                               IsAirJumpAttack_;                                           // 0x0E60   (0x0001)  // 是否在空中进行跳跃攻击
	bool                                               IsQYQTime;                                                  // 0x0E61   (0x0001)  // 是否处于牵引枪（QYQ）技能的判定时间内
	bool                                               IsQYQCrossHairCheck;                                        // 0x0E62   (0x0001)  // 是否正在进行牵引枪的准星检测
	unsigned char                                      UnknownData74_6[0x5];                                       // 0x0E63   (0x0005)  MISSED      // 可能的内存对齐填充
	class UPrimitiveComponent*                         QYQComp;                                                    // 0x0E68   (0x0008)  // 牵引枪抓取的组件
	class AActor*                                      QYQActor;                                                   // 0x0E70   (0x0008)  // 牵引枪抓取的Actor
	bool                                               IsEMPTime;                                                  // 0x0E78   (0x0001)  // 是否处于EMP技能的判定时间内
	bool                                               MeleeSongKai_;                                              // 0x0E79   (0x0001)  // 近战攻击的按键是否已松开（SongKai）
	bool                                               IsMeleePowerAnim;                                           // 0x0E7A   (0x0001)  // 是否正在播放强力近战攻击的动画
	unsigned char                                      UnknownData75_6[0x1];                                       // 0x0E7B   (0x0001)  MISSED      // 可能的内存对齐填充
	float                                              TurnRots;                                                   // 0x0E7C   (0x0004)  // 转身的旋转值
	bool                                               IsHuaChanTime;                                              // 0x0E80   (0x0001)  // 是否处于滑铲（HuaChan）的判定时间内
	unsigned char                                      UnknownData76_6[0x3];                                       // 0x0E81   (0x0003)  MISSED      // 可能的内存对齐填充
	int32_t                                            SSwordFireType;                                             // 0x0E84   (0x0004)  // 光剑的开火/攻击类型
	FVector                                            MeleePowerAIFlyLoc;                                         // 0x0E88   (0x000C)  // 强力近战攻击时AI飞起的位置
	bool                                               CanUseAITelePort;                                           // 0x0E94   (0x0001)  // 是否可以使用AI传送
	bool                                               IsQYQAITime;                                                // 0x0E95   (0x0001)  // 是否处于对AI使用牵引枪的时间内
	unsigned char                                      UnknownData77_6[0x2];                                       // 0x0E96   (0x0002)  MISSED      // 可能的内存对齐填充
	class AActor*                                      QYQAI;                                                      // 0x0E98   (0x0008)  // 牵引枪抓取的AI Actor
	class UPrimitiveComponent*                         AI_Capsule;                                                 // 0x0EA0   (0x0008)  // AI的胶囊体组件
	FVector                                            ZhaDiSpawnLoc;                                              // 0x0EA8   (0x000C)  // 砸地（ZhaDi）技能的生成位置
	bool                                               QYQAIIsFly_;                                                // 0x0EB4   (0x0001)  // 被牵引枪抓取的AI是否正在飞行
	bool                                               IsDefuLightSwordKeyTime;                                    // 0x0EB5   (0x0001)  // 是否处于防御光剑的关键帧时间内
	unsigned char                                      UnknownData78_6[0x2];                                       // 0x0EB6   (0x0002)  MISSED      // 可能的内存对齐填充
	class ADefuLightSword_BP_C*                        LightDefuBP;                                                // 0x0EB8   (0x0008)  // 光剑防御技能的蓝图Actor引用
	bool                                               IsDefuLightAnimLoop;                                        // 0x0EC0   (0x0001)  // 光剑防御动画是否循环
	bool                                               IsDefuAll;                                                  // 0x0EC1   (0x0001)  // 是否处于全方位防御状态
	unsigned char                                      UnknownData79_6[0x2];                                       // 0x0EC2   (0x0002)  MISSED      // 可能的内存对齐填充
	FVector                                            ClimbForwardWallLoc;                                        // 0x0EC4   (0x000C)  // 向前攀爬时墙体的位置
	FVector                                            ClimbStart;                                                 // 0x0ED0   (0x000C)  // 攀爬的起始位置
	FVector                                            ClimbEnd;                                                   // 0x0EDC   (0x000C)  // 攀爬的结束位置
	FVector                                            ClimbTraceHeight;                                           // 0x0EE8   (0x000C)  // 攀爬检测的高度
	FVector                                            FinalTraceClimbPonit;                                       // 0x0EF4   (0x000C)  // 最终检测到的攀爬点 (Ponit可能是Point的拼写错误)
	bool                                               IsTraceClimbWall;                                           // 0x0F00   (0x0001)  // 是否正在检测可攀爬的墙体
	bool                                               IsPlayerUsedClimb;                                          // 0x0F01   (0x0001)  // 玩家是否已使用过攀爬
	bool                                               IsPlayerCanClimb;                                           // 0x0F02   (0x0001)  // 玩家是否可以攀爬
	unsigned char                                      UnknownData80_6[0x1];                                       // 0x0F03   (0x0001)  MISSED      // 可能的内存对齐填充
	FRotator                                           ClimbRot;                                                   // 0x0F04   (0x000C)  // 攀爬时的旋转
	float                                              ClimbRotZ;                                                  // 0x0F10   (0x0004)  // 攀爬时Z轴的旋转
	float                                              ClimbStartZ;                                                // 0x0F14   (0x0004)  // 攀爬起始的Z轴高度
	float                                              ClimbMiddleZ;                                               // 0x0F18   (0x0004)  // 攀爬中间点的Z轴高度
	bool                                               PlayerVSGroundHeightis_200;                                 // 0x0F1C   (0x0001)  // 玩家离地高度是否为200
	bool                                               IsAirSkillDouJumpTime_;                                     // 0x0F1D   (0x0001)  // 是否处于空中技能二段跳的判定时间内
	bool                                               IsAirSkillUpLightSword_;                                    // 0x0F1E   (0x0001)  // 是否处于空中技能上挑光剑的判定时间内
	bool                                               IsSpeedClimb_;                                              // 0x0F1F   (0x0001)  // 是否为快速攀爬
	bool                                               IsPlayerClimbTime;                                          // 0x0F20   (0x0001)  // 是否处于玩家攀爬的判定时间内
	bool                                               IsWallRun;                                                  // 0x0F21   (0x0001)  // 是否正在跑墙
	bool                                               IsLeftWallRun;                                              // 0x0F22   (0x0001)  // 是否在左侧墙壁跑墙
	unsigned char                                      UnknownData81_6[0x5];                                       // 0x0F23   (0x0005)  MISSED      // 可能的内存对齐填充
	class ARunWall_BP_C*                               RunWallLineBp;                                              // 0x0F28   (0x0008)  // 跑墙路径的蓝图Actor引用
	FRotator                                           RunWallRot;                                                 // 0x0F30   (0x000C)  // 跑墙时的旋转
	FVector                                            RunWallLoc;                                                 // 0x0F3C   (0x000C)  // 跑墙时的位置
	bool                                               IsTraceLeftWall;                                            // 0x0F48   (0x0001)  // 是否正在检测左侧墙壁
	bool                                               IsTraceRightWall;                                           // 0x0F49   (0x0001)  // 是否正在检测右侧墙壁
	bool                                               CanTraceForwardWall;                                        // 0x0F4A   (0x0001)  // 是否可以检测前方的墙壁
	bool                                               IsRunWallCDTime_;                                           // 0x0F4B   (0x0001)  // 跑墙是否在冷却时间内
	bool                                               RunWallKeepTimeCanJump;                                     // 0x0F4C   (0x0001)  // 跑墙维持时间内是否可以跳跃
	unsigned char                                      UnknownData82_6[0x3];                                       // 0x0F4D   (0x0003)  MISSED      // 可能的内存对齐填充
	class ARunWall_BPXSX_C*                            RunWallLineBpXSX;                                           // 0x0F50   (0x0008)  // 斜上斜（XSX）跑墙路径的蓝图Actor引用
	bool                                               PlayerInGround_;                                            // 0x0F58   (0x0001)  // 玩家是否在地面上
	unsigned char                                      UnknownData83_6[0x7];                                       // 0x0F59   (0x0007)  MISSED      // 可能的内存对齐填充
	SDK_UNDEFINED(16,833) /* FMulticastInlineDelegate */ __um(SCWoodEvent);                                        // 0x0F60   (0x0010)  // 用于广播“上船”（ShangChuan）木头相关事件的多播委托
	bool                                               InUseEventTouch_;                                           // 0x0F70   (0x0001)  // 是否在可交互事件的触发范围内
	bool                                               IsNewPlayerDeFu;                                            // 0x0F71   (0x0001)  // 教程标记：是否为新玩家的防御（DeFu）教学
	bool                                               IsNewPlayerLightSword;                                      // 0x0F72   (0x0001)  // 教程标记：是否为新玩家的光剑教学
	bool                                               IsNewPlayerUpLightSword;                                    // 0x0F73   (0x0001)  // 教程标记：是否为新玩家的上挑光剑教学
	bool                                               IsNewPlayerIronArmy_;                                       // 0x0F74   (0x0001)  // 教程标记：是否为新玩家面对“铁甲军”（Iron Army）的教学
	bool                                               IsJumpAirToRunWall;                                         // 0x0F75   (0x0001)  // 是否从空中跳跃到跑墙状态
	unsigned char                                      UnknownData84_6[0x2];                                       // 0x0F76   (0x0002)  MISSED      // 可能的内存对齐填充
	float                                              SkillMoveForward;                                           // 0x0F78   (0x0004)  // 使用技能时的前向移动速度
	bool                                               IsPlayerForcePlayCameraAnim;                                // 0x0F7C   (0x0001)  // 是否强制玩家播放相机动画
	bool                                               AIBrachPlayerUpLight;                                       // 0x0F7D   (0x0001)  // AI是否打断了玩家的上挑光剑 (Brach可能是Break的拼写错误)
	bool                                               IsQYQAINoUse_;                                              // 0x0F7E   (0x0001)  // 对AI使用的牵引枪是否无效
	unsigned char                                      UnknownData85_6[0x1];                                       // 0x0F7F   (0x0001)  MISSED      // 可能的内存对齐填充
	class AActor*                                      HealthUI_AI;                                                // 0x0F80   (0x0008)  // 在UI上显示生命值的AI Actor
	FVector                                            EMPAIFlyLoc;                                                // 0x0F88   (0x000C)  // 被EMP击中后AI飞行的位置
	bool                                               OtherEvent_;                                                // 0x0F94   (0x0001)  // 是否有其他事件正在发生
	bool                                               IsNewPlayerEMP;                                             // 0x0F95   (0x0001)  // 教程标记：是否为新玩家的EMP教学
	unsigned char                                      UnknownData86_6[0x2];                                       // 0x0F96   (0x0002)  MISSED      // 可能的内存对齐填充
	SDK_UNDEFINED(16,834) /* FMulticastInlineDelegate */ __um(CloseEMPNewPlayerUI);                                // 0x0F98   (0x0010)  // 用于广播“关闭新玩家EMP教学UI”事件的多播委托
	int32_t                                            FireTypeShake;                                              // 0x0FA8   (0x0004)  // 不同开火类型对应的相机抖动模式
	unsigned char                                      UnknownData87_6[0x4];                                       // 0x0FAC   (0x0004)  MISSED      // 可能的内存对齐填充
	SDK_UNDEFINED(16,835) /* FMulticastInlineDelegate */ __um(NewPlayerShunFinish);                                // 0x0FB0   (0x0010)  // 用于广播“新玩家瞬移教学完成”事件的多播委托
	SDK_UNDEFINED(16,836) /* FMulticastInlineDelegate */ __um(PutFire);                                            // 0x0FC0   (0x0010)  // 用于广播“开火”事件的多播委托 (PutFire可能是Fire的另一种说法)
	bool                                               UpLightBlockWAll_;                                          // 0x0FD0   (0x0001)  // 上挑光剑是否被墙壁阻挡 (WAll可能是Wall的拼写错误)
	unsigned char                                      UnknownData88_6[0x7];                                       // 0x0FD1   (0x0007)  MISSED      // 可能的内存对齐填充
	class UBMI_UseHightLightTip_C*                     NoUseUpLightTipUI;                                          // 0x0FD8   (0x0008)  // 当无法使用上挑光剑时的高亮提示UI
	bool                                               INWaterVolume_;                                             // 0x0FE0   (0x0001)  // 是否在水体区域内
	bool                                               IsHitBlood70_;                                              // 0x0FE1   (0x0001)  // 生命值是否低于70%并触发受击效果
	bool                                               IsHitBlood55_;                                              // 0x0FE2   (0x0001)  // 生命值是否低于55%并触发受击效果
	bool                                               IsHitBlood33_;                                              // 0x0FE3   (0x0001)  // 生命值是否低于33%并触发受击效果
	bool                                               IsDeFuAnimIsPlay_;                                          // 0x0FE4   (0x0001)  // 防御（DeFu）动画是否正在播放
	bool                                               IsPressDEFULightSword;                                      // 0x0FE5   (0x0001)  // 是否按下了防御光剑键 (DEFU)
	bool                                               IsDEFULightSwordPressAdd_;                                  // 0x0FE6   (0x0001)  // 防御光剑时是否按下了瞄准键
	unsigned char                                      UnknownData89_6[0x1];                                       // 0x0FE7   (0x0001)  MISSED      // 可能的内存对齐填充
	class UBMI_Player_UMG_C*                           PlayerUI_UMG;                                               // 0x0FE8   (0x0008)  // 玩家UI的引用
	float                                              PlayerPower;                                                // 0x0FF0   (0x0004)  // 玩家的能量值
	bool                                               IsDefuLightSword_Power_;                                    // 0x0FF4   (0x0001)  // 防御光剑是否消耗能量
	unsigned char                                      UnknownData90_6[0x3];                                       // 0x0FF5   (0x0003)  MISSED      // 可能的内存对齐填充
	int32_t                                            PlayerFOV;                                                  // 0x0FF8   (0x0004)  // 玩家的视野（Field of View）设置
	bool                                               IsNewPlayer_TelePortAI;                                     // 0x0FFC   (0x0001)  // 教程标记：是否为新玩家的传送AI教学
	unsigned char                                      UnknownData91_6[0x3];                                       // 0x0FFD   (0x0003)  MISSED      // 可能的内存对齐填充
	SDK_UNDEFINED(16,837) /* FMulticastInlineDelegate */ __um(CloseTelePortNewPlayerUI);                           // 0x1000   (0x0010)  // 用于广播“关闭传送教学UI”事件的多播委托
	bool                                               WeaponIsmuffler_;                                           // 0x1010   (0x0001)  // 武器是否装备了消音器 (muffler)
	unsigned char                                      UnknownData92_6[0x3];                                       // 0x1011   (0x0003)  MISSED      // 可能的内存对齐填充
	FVector                                            WeaponNoiseLoc;                                             // 0x1014   (0x000C)  // 武器噪音发出的位置
	TArray<class AActor*>                              NearHearAI;                                                 // 0x1020   (0x0010)  // 附近能听到声音的AI数组
	FName                                              Weapon9Name;                                                // 0x1030   (0x0008)  // 武器9的名称
	bool                                               IsStealthKill_;                                             // 0x1038   (0x0001)  // 是否执行了潜行击杀
	bool                                               NoWeaponCG;                                                 // 0x1039   (0x0001)  // 过场动画中是否不显示武器
	bool                                               IsCaiDaoWeapon_;                                            // 0x103A   (0x0001)  // 是否为“菜刀”（CaiDao）类型的武器
	bool                                               IsArmyEye;                                                  // 0x103B   (0x0001)  // 是否在“军队之眼”（Army Eye）的视野中
	bool                                               FatOrHaveDefuAI_;                                           // 0x103C   (0x0001)  // 目标AI是否为胖子或拥有防御能力
	bool                                               IsSprintAttackTime;                                         // 0x103D   (0x0001)  // 是否处于冲刺攻击的判定时间内
	bool                                               IsDoubleJump_;                                              // 0x103E   (0x0001)  // 是否执行了二段跳
	bool                                               HuaChanCG;                                                  // 0x103F   (0x0001)  // 是否为滑铲（HuaChan）的过场动画
	bool                                               SprintAttackCanUse;                                         // 0x1040   (0x0001)  // 是否可以使用冲刺攻击
	bool                                               INWaterVolume_CanDown_;                                     // 0x1041   (0x0001)  // 在水体中是否可以下潜
	unsigned char                                      UnknownData93_6[0x6];                                       // 0x1042   (0x0006)  MISSED      // 可能的内存对齐填充
	SDK_UNDEFINED(16,838) /* FMulticastInlineDelegate */ __um(OutWater);                                           // 0x1048   (0x0010)  // 用于广播“出水”事件的多播委托
	bool                                               IsCrouchToJump_;                                            // 0x1058   (0x0001)  // 是否从蹲下状态直接起跳
	unsigned char                                      UnknownData94_6[0x7];                                       // 0x1059   (0x0007)  MISSED      // 可能的内存对齐填充
	class USoundCue*                                   W_Fire_Sound;                                               // 0x1060   (0x0008)  // 武器开火的Sound Cue资源
	bool                                               IsFinalAIDeadSlow;                                          // 0x1068   (0x0001)  // 最后一个AI死亡时是否触发慢动作
	bool                                               Level03LoadCheckPonit;                                      // 0x1069   (0x0001)  // 关卡03是否加载了检查点 (CheckPonit可能是Checkpoint的拼写错误)
	bool                                               QYQ_FightingLoc_;                                           // 0x106A   (0x0001)  // 牵引枪是否抓取了战斗位置
	unsigned char                                      UnknownData95_6[0x5];                                       // 0x106B   (0x0005)  MISSED      // 可能的内存对齐填充
	SDK_UNDEFINED(16,839) /* FMulticastInlineDelegate */ __um(CloseDefuAmmoNewPlayerUI);                           // 0x1070   (0x0010)  // 用于广播“关闭防御弹药教学UI”的多播委托
	float                                              MeleePower_UsePower;                                        // 0x1080   (0x0004)  // 强力近战攻击消耗的能量
	float                                              Melee_UsePower;                                             // 0x1084   (0x0004)  // 普通近战攻击消耗的能量
	float                                              Defu_UsePower;                                              // 0x1088   (0x0004)  // 防御消耗的能量
	float                                              LightSword_UsePower;                                        // 0x108C   (0x0004)  // 光剑消耗的能量
	float                                              QYQ_UsePower;                                               // 0x1090   (0x0004)  // 牵引枪消耗的能量
	float                                              UpLightSword_UsePower;                                      // 0x1094   (0x0004)  // 上挑光剑消耗的能量
	float                                              ZhaDi_UsePower;                                             // 0x1098   (0x0004)  // 砸地消耗的能量
	float                                              Shun_UsePower;                                              // 0x109C   (0x0004)  // 瞬移消耗的能量
	float                                              Sprint_UsePower;                                            // 0x10A0   (0x0004)  // 冲刺消耗的能量
	bool                                               Is_Game_Pad_;                                               // 0x10A4   (0x0001)  // 是否正在使用手柄
	unsigned char                                      UnknownData96_6[0x3];                                       // 0x10A5   (0x0003)  MISSED      // 可能的内存对齐填充
	float                                              MouseXY_AddRate;                                            // 0x10A8   (0x0004)  // 鼠标在瞄准状态下的灵敏度
	bool                                               Add_AutoAnimFinish;                                         // 0x10AC   (0x0001)  // 瞄准时的自动画是否播放完毕
	unsigned char                                      UnknownData97_6[0x3];                                       // 0x10AD   (0x0003)  MISSED      // 可能的内存对齐填充
	float                                              GamePad_Y_Rate;                                             // 0x10B0   (0x0004)  // 手柄Y轴灵敏度
	float                                              GamePadXY_AddRate;                                          // 0x10B4   (0x0004)  // 手柄在瞄准状态下的灵敏度
	bool                                               GamePadX_Reversal_;                                         // 0x10B8   (0x0001)  // 设置项：是否反转手柄X轴
	bool                                               GamePadY_Reversal_;                                         // 0x10B9   (0x0001)  // 设置项：是否反转手柄Y轴
	bool                                               MeleePowerCanUse;                                           // 0x10BA   (0x0001)  // 是否可以使用强力近战攻击
	unsigned char                                      UnknownData98_6[0x5];                                       // 0x10BB   (0x0005)  MISSED      // 可能的内存对齐填充
	SDK_UNDEFINED(16,840) /* FMulticastInlineDelegate */ __um(LevelQYQ);                                           // 0x10C0   (0x0010)  // 用于广播关卡中“牵引枪”事件的多播委托
	class ANPC_Army_BMI01_FarFire_C*                   BoatSpawnAI;                                                // 0x10D0   (0x0008)  // 船上生成的远程攻击AI
	bool                                               IsTraceBoatAI;                                              // 0x10D8   (0x0001)  // 是否正在检测船上的AI
	unsigned char                                      UnknownData99_6[0x7];                                       // 0x10D9   (0x0007)  MISSED      // 可能的内存对齐填充
	class UPrimitiveComponent*                         BoatAI;                                                     // 0x10E0   (0x0008)  // 船上AI的碰撞组件
	class UCapsuleComponent*                           BoatAICapsule;                                              // 0x10E8   (0x0008)  // 船上AI的胶囊体碰撞组件
	class AActor*                                      BoatAI_Trace;                                               // 0x10F0   (0x0008)  // 检测到的船上AI Actor
	int32_t                                            BoatAI_Number;                                              // 0x10F8   (0x0004)  // 船上AI的数量
	FVector                                            MeleePowerAirTraceLoc;                                      // 0x10FC   (0x000C)  // 强力近战空中攻击的检测位置
	class UPrimitiveComponent*                         TraceAIComponent;                                           // 0x1108   (0x0008)  // 检测到的AI的组件
	bool                                               WeaponFiting_VEPR_;                                         // 0x1110   (0x0001)  // 是否装备了VEPR武器配件 (Fiting可能是Fitting的拼写错误)
	bool                                               WeaponFiting_GER_;                                          // 0x1111   (0x0001)  // 是否装备了GER武器配件
	bool                                               WeaponFiting_Meta_;                                         // 0x1112   (0x0001)  // 是否装备了Meta武器配件
	bool                                               PlayerPower_0;                                              // 0x1113   (0x0001)  // 玩家能量是否为0
	bool                                               PowerLowTipIsVail_;                                         // 0x1114   (0x0001)  // 低能量提示是否有效 (Vail可能是Valid的拼写错误)
	unsigned char                                      UnknownData100_6[0x3];                                      // 0x1115   (0x0003)  MISSED      // 可能的内存对齐填充
	class UClass*                                      Weapon4;                                                    // 0x1118   (0x0008)  // 武器4的蓝图类
	FName                                              Weapon4Name;                                                // 0x1120   (0x0008)  // 武器4的名称
	float                                              GamePadXY_SniperAddRate;                                    // 0x1128   (0x0004)  // 手柄在使用狙击枪瞄准时的灵敏度
	float                                              MouseXY_SniperAddRate;                                      // 0x112C   (0x0004)  // 鼠标在使用狙击枪瞄准时的灵敏度
	bool                                               WeaponFiting_IOPR_;                                         // 0x1130   (0x0001)  // 是否装备了IOPR武器配件
	bool                                               WeaponID4_NoAmmo;                                           // 0x1131   (0x0001)  // 武器4是否没有弹药
	unsigned char                                      UnknownData101_6[0x6];                                      // 0x1132   (0x0006)  MISSED      // 可能的内存对齐填充
	class UBMI_PressUse_C*                             PressItemUMG;                                               // 0x1138   (0x0008)  // 按下交互键时显示的UI
	bool                                               TraceIteam_;                                                // 0x1140   (0x0001)  // 是否正在检测物品 (Iteam可能是Item的拼写错误)
	unsigned char                                      UnknownData102_6[0x3];                                      // 0x1141   (0x0003)  MISSED      // 可能的内存对齐填充
	int32_t                                            PickUp_AmmoCache_VEPR_Number;                               // 0x1144   (0x0004)  // 拾取的VEPR弹药数量
	int32_t                                            PickUp_AmmoCache_GER_Number;                                // 0x1148   (0x0004)  // 拾取的GER弹药数量
	int32_t                                            PickUp_AmmoCache_META_Number;                               // 0x114C   (0x0004)  // 拾取的META弹药数量
	int32_t                                            PickUp_AmmoCache_IOPR_Number;                               // 0x1150   (0x0004)  // 拾取的IOPR弹药数量
	int32_t                                            NowSPAmmo;                                                  // 0x1154   (0x0004)  // 当前特殊弹药（SP Ammo）数量
	int32_t                                            PickUp_SPAmmoCache_GER_Number;                              // 0x1158   (0x0004)  // 拾取的GER特殊弹药数量
	int32_t                                            PickUp_SPAmmoCache_VEPR_Number;                             // 0x115C   (0x0004)  // 拾取的VEPR特殊弹药数量
	int32_t                                            PickUp_SPAmmoCache_Meta_Number;                             // 0x1160   (0x0004)  // 拾取的Meta特殊弹药数量
	int32_t                                            PickUp_SPAmmoCache_IOPR_Number;                             // 0x1164   (0x0004)  // 拾取的IOPR特殊弹药数量
	FText                                              VEPR_AmmoName;                                              // 0x1168   (0x0018)  // VEPR弹药的显示名称
	FText                                              GER_AmmoName;                                               // 0x1180   (0x0018)  // GER弹药的显示名称
	FText                                              IOPR_AmmoName;                                              // 0x1198   (0x0018)  // IOPR弹药的显示名称
	FText                                              Meta_AmmoName;                                              // 0x11B0   (0x0018)  // Meta弹药的显示名称
	FText                                              VEPR_SPAmmoName;                                            // 0x11C8   (0x0018)  // VEPR特殊弹药的显示名称
	FText                                              GER_SPAmmoName;                                             // 0x11E0   (0x0018)  // GER特殊弹药的显示名称
