
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: ActorSequence
/// dependency: AnimGraphRuntime
/// dependency: ApexDestruction
/// dependency: CoreUObject
/// dependency: Engine
/// dependency: PlayerBP
/// dependency: ProceduralMeshComponent
/// dependency: Strider
/// dependency: UISystem_BMI
/// dependency: UMG

#pragma pack(push, 0x1)

/// Class /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C
/// Size: 0x06B9 (1721 bytes) (0x0004B8 - 0x0006B9) align 16 MaxSize: 0x06B9
class ANPC_GuLouBoss_AI_C : public ACharacter
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x04B8   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x04C0   (0x0008)  
	class UArrowComponent*                             Eye6;                                                       // 0x04C8   (0x0008)  
	class UArrowComponent*                             Eye5;                                                       // 0x04D0   (0x0008)  
	class UArrowComponent*                             Eye4;                                                       // 0x04D8   (0x0008)  
	class UArrowComponent*                             Eye3;                                                       // 0x04E0   (0x0008)  
	class UArrowComponent*                             Eye2;                                                       // 0x04E8   (0x0008)  
	class UArrowComponent*                             Eye1;                                                       // 0x04F0   (0x0008)  
	class UParticleSystemComponent*                    SiMiao_Teleport;                                            // 0x04F8   (0x0008)  
	class UParticleSystemComponent*                    Cloud_R;                                                    // 0x0500   (0x0008)  
	class UParticleSystemComponent*                    Cloud_L;                                                    // 0x0508   (0x0008)  
	class UParticleSystemComponent*                    PS_FireSmall;                                               // 0x0510   (0x0008)  
	class UParticleSystemComponent*                    PS_FireSmall2;                                              // 0x0518   (0x0008)  
	class UArrowComponent*                             EagleBackLoc;                                               // 0x0520   (0x0008)  
	class UPointLightComponent*                        BodyLight2;                                                 // 0x0528   (0x0008)  
	class UArrowComponent*                             FarFireLoc;                                                 // 0x0530   (0x0008)  
	class UArrowComponent*                             ZhaDiSpawnLoc;                                              // 0x0538   (0x0008)  
	class UCapsuleComponent*                           Boos_UpLightStopTouch;                                      // 0x0540   (0x0008)  
	class UPointLightComponent*                        BodyLight;                                                  // 0x0548   (0x0008)  
	class UParticleSystemComponent*                    DeadPar;                                                    // 0x0550   (0x0008)  
	class UParticleSystemComponent*                    M_explosionSpark_Normal;                                    // 0x0558   (0x0008)  
	class UPhysicalAnimationComponent*                 PhysicalAnimations;                                         // 0x0560   (0x0008)  
	class UArrowComponent*                             AutoAimPlayer;                                              // 0x0568   (0x0008)  
	class UArrowComponent*                             AttackTraceLoc;                                             // 0x0570   (0x0008)  
	class UBoxComponent*                               Attack_HitTouch_01;                                         // 0x0578   (0x0008)  
	class UBoxComponent*                               Head_Shot;                                                  // 0x0580   (0x0008)  
	class USphereComponent*                            QYQTouch;                                                   // 0x0588   (0x0008)  
	class UBoxComponent*                               FootR_Shot;                                                 // 0x0590   (0x0008)  
	class UBoxComponent*                               FootL_Shot;                                                 // 0x0598   (0x0008)  
	class UBoxComponent*                               HandL_Shot;                                                 // 0x05A0   (0x0008)  
	class UBoxComponent*                               HandR_Shot;                                                 // 0x05A8   (0x0008)  
	class UPointLightComponent*                        HitLight;                                                   // 0x05B0   (0x0008)  
	class UParticleSystemComponent*                    XChange_Edms;                                               // 0x05B8   (0x0008)  
	class UArrowComponent*                             AirZCombo;                                                  // 0x05C0   (0x0008)  
	class UParticleSystemComponent*                    BloodHead;                                                  // 0x05C8   (0x0008)  
	class UParticleSystemComponent*                    BloodBody;                                                  // 0x05D0   (0x0008)  
	float                                              AIHealth;                                                   // 0x05D8   (0x0004)  
	float                                              AIMAXHealth;                                                // 0x05DC   (0x0004)  
	FName                                              AirTouchBone;                                               // 0x05E0   (0x0008)  
	bool                                               IsSpawn_;                                                   // 0x05E8   (0x0001)  
	bool                                               IsDead_;                                                    // 0x05E9   (0x0001)  
	bool                                               IsFirstLookPlayer;                                          // 0x05EA   (0x0001)  
	bool                                               IsFireTime;                                                 // 0x05EB   (0x0001)  
	bool                                               IsTouchPlayer;                                              // 0x05EC   (0x0001)  
	bool                                               IsHitTime_;                                                 // 0x05ED   (0x0001)  
	bool                                               HitShield;                                                  // 0x05EE   (0x0001)  
	bool                                               IsShun_;                                                    // 0x05EF   (0x0001)  
	class UPhysicalAnimationComponent*                 PhysicalAnimation;                                          // 0x05F0   (0x0008)  
	bool                                               CanBoken;                                                   // 0x05F8   (0x0001)  
	bool                                               IsKanJiorEMP;                                               // 0x05F9   (0x0001)  
	unsigned char                                      UnknownData01_6[0x6];                                       // 0x05FA   (0x0006)  MISSED
	class USkeletalMeshComponent*                      RightHand;                                                  // 0x0600   (0x0008)  
	class USkeletalMeshComponent*                      LeftHand;                                                   // 0x0608   (0x0008)  
	class USkeletalMeshComponent*                      LeftFoot;                                                   // 0x0610   (0x0008)  
	class USkeletalMeshComponent*                      RightFoot;                                                  // 0x0618   (0x0008)  
	class USkeletalMeshComponent*                      head;                                                       // 0x0620   (0x0008)  
	bool                                               IsChuJue_;                                                  // 0x0628   (0x0001)  
	bool                                               IsChueJueArea_;                                             // 0x0629   (0x0001)  
	bool                                               IsFarAttack_;                                               // 0x062A   (0x0001)  
	bool                                               IsPlayerAirUseQYQ_;                                         // 0x062B   (0x0001)  
	bool                                               BaTi_;                                                      // 0x062C   (0x0001)  
	bool                                               IsAirMelee_;                                                // 0x062D   (0x0001)  
	unsigned char                                      UnknownData02_6[0x2];                                       // 0x062E   (0x0002)  MISSED
	float                                              Attack_Hit_01;                                              // 0x0630   (0x0004)  
	float                                              SpawnTime;                                                  // 0x0634   (0x0004)  
	float                                              FarAttack_Hit;                                              // 0x0638   (0x0004)  
	float                                              PlayerDistance;                                             // 0x063C   (0x0004)  
	float                                              PerfectDefu_DEFUHealth;                                     // 0x0640   (0x0004)  
	int32_t                                            AirType;                                                    // 0x0644   (0x0004)  
	FVector                                            EMPAirZ;                                                    // 0x0648   (0x000C)  
	bool                                               IsMeleePower_;                                              // 0x0654   (0x0001)  
	bool                                               IsSprintAttack_;                                            // 0x0655   (0x0001)  
	unsigned char                                      UnknownData03_6[0x2];                                       // 0x0656   (0x0002)  MISSED
	SDK_UNDEFINED(16,964) /* FMulticastInlineDelegate */ __um(GuLouBoss_Dead);                                     // 0x0658   (0x0010)  
	class AGuLouBoss_Dao_BP_C*                         DaoBP;                                                      // 0x0668   (0x0008)  
	bool                                               IsSky_;                                                     // 0x0670   (0x0001)  
	unsigned char                                      UnknownData04_6[0x7];                                       // 0x0671   (0x0007)  MISSED
	class AGuLouBoss_Hand_C*                           STLB;                                                       // 0x0678   (0x0008)  
	bool                                               JzzBoken_;                                                  // 0x0680   (0x0001)  
	bool                                               AXEIS_;                                                     // 0x0681   (0x0001)  
	bool                                               JZZIS_;                                                     // 0x0682   (0x0001)  
	bool                                               EagleIS_;                                                   // 0x0683   (0x0001)  
	bool                                               SnakeIS_;                                                   // 0x0684   (0x0001)  
	unsigned char                                      UnknownData05_6[0x3];                                       // 0x0685   (0x0003)  MISSED
	int32_t                                            PerfactDefu_Number;                                         // 0x0688   (0x0004)  
	unsigned char                                      UnknownData06_6[0x4];                                       // 0x068C   (0x0004)  MISSED
	class UAIBossHealth_UMG_C*                         BossHealthUI;                                               // 0x0690   (0x0008)  
	SDK_UNDEFINED(16,965) /* FMulticastInlineDelegate */ __um(GuLouBoss_TelePort);                                 // 0x0698   (0x0010)  
	TArray<class UAnimMontage*>                        Montage_to_Play;                                            // 0x06A8   (0x0010)  
	bool                                               CanUseEyeFire_;                                             // 0x06B8   (0x0001)  


	/// Functions
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.AutoAnimPlayerEvent
	// void AutoAnimPlayerEvent();                                                                                              // [0x148e900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.HitEdm
	// void HitEdm();                                                                                                           // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.HitBlood
	// void HitBlood();                                                                                                         // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.LookAtPlayer
	// void LookAtPlayer();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.OnFail_D223664141D41294E9A8E0B66FCD6C7A
	// void OnFail_D223664141D41294E9A8E0B66FCD6C7A(TEnumAsByte<EPathFollowingResult> MovementResult);                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.OnSuccess_D223664141D41294E9A8E0B66FCD6C7A
	// void OnSuccess_D223664141D41294E9A8E0B66FCD6C7A(TEnumAsByte<EPathFollowingResult> MovementResult);                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Completed_4850272540B76A35C104D5AAA9657A0E
	// void Completed_4850272540B76A35C104D5AAA9657A0E(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.OnFailure_5D518A6B4DEAE85F5AF8049C09055620
	// void OnFailure_5D518A6B4DEAE85F5AF8049C09055620(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.OnSuccess_5D518A6B4DEAE85F5AF8049C09055620
	// void OnSuccess_5D518A6B4DEAE85F5AF8049C09055620(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.OnFailure_E98FB37249AABDDB865FBC8B6D9C895E
	// void OnFailure_E98FB37249AABDDB865FBC8B6D9C895E();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.OnSuccess_E98FB37249AABDDB865FBC8B6D9C895E
	// void OnSuccess_E98FB37249AABDDB865FBC8B6D9C895E();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.AIHeadShot
	// void AIHeadShot();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.AIHandRShot
	// void AIHandRShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.AIHandLShot
	// void AIHandLShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.AIFootLShot
	// void AIFootLShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.AIFootRShot
	// void AIFootRShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_ShieldHit
	// void Send_ShieldHit();                                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_HuaChan
	// void Send_HuaChan();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_ShieldHitMeleeOrSword
	// void Send_ShieldHitMeleeOrSword(int32_t Hit);                                                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_AIQYQ
	// void Send_AIQYQ();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_NearDefu
	// void Send_NearDefu(int32_t FireType);                                                                                    // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_PerfectDefu
	// void Send_PerfectDefu(int32_t FireType);                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_AIBoat
	// void Send_AIBoat(class UPrimitiveComponent* HitBox, float Hit);                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_AIDEFUHealths
	// void Send_AIDEFUHealths(float DEFUHealth, float BloddHealth, bool HaveDefu_);                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_DisPlayAIHealthUI
	// void Send_DisPlayAIHealthUI(bool Vis_);                                                                                  // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_BloodHK
	// void Send_BloodHK();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_DefuHK
	// void Send_DefuHK();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_Add_Alerts
	// void Send_Add_Alerts(float DS);                                                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_Dee_Alert
	// void Send_Dee_Alert();                                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_ForwardSeePlayer
	// void Send_ForwardSeePlayer();                                                                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_FootAI_Alert
	// void Send_FootAI_Alert();                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_BackSeePlayer
	// void Send_BackSeePlayer();                                                                                               // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_ShunAI_Alert
	// void Send_ShunAI_Alert();                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_PlayerHitCarAI
	// void Send_PlayerHitCarAI();                                                                                              // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_PlayerQYQAI
	// void Send_PlayerQYQAI(int32_t Number);                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_HealthUIVis
	// void Send_HealthUIVis();                                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x148e900] Event|Protected|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.MoveToPlayer
	// void MoveToPlayer();                                                                                                     // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x148e900] Event|Public|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.NearFire
	// void NearFire();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.RestLDMove
	// void RestLDMove();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.ShunR
	// void ShunR();                                                                                                            // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.ReceiveAnyDamage
	// void ReceiveAnyDamage(float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser); // [0x148e900] BlueprintAuthorityOnly|Event|Public|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.AIHit
	// void AIHit();                                                                                                            // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_HitSword
	// void Send_HitSword(float Hit, int32_t FiretType);                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.-Health
	// void _Health();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_MeleePower
	// void Send_MeleePower(float Hit);                                                                                         // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_UpLightSword
	// void Send_UpLightSword(float Hit);                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.ForceLookPlayer
	// void ForceLookPlayer();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_KanJi
	// void Send_KanJi(float Hit);                                                                                              // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_ZhaDi
	// void Send_ZhaDi();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.BndEvt__Attack_HitTouch_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
	// void BndEvt__Attack_HitTouch_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x148e900] HasOutParms|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Open_Hit01_Event
	// void Open_Hit01_Event();                                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Close_Hit01_Event
	// void Close_Hit01_Event();                                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.AttackTrace
	// void AttackTrace();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.PerfectDefu_HitAnim
	// void PerfectDefu_HitAnim();                                                                                              // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_AIFlyQYQ
	// void Send_AIFlyQYQ();                                                                                                    // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.ShunL
	// void ShunL();                                                                                                            // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.UpDataDEFUHealth
	// void UpDataDEFUHealth();                                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.ForceDEFUAnim
	// void ForceDEFUAnim();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_EMP
	// void Send_EMP(float Hit);                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.ForceFire
	// void ForceFire();                                                                                                        // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.SpawnZhaDiBig
	// void SpawnZhaDiBig();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.ShunF
	// void ShunF();                                                                                                            // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_SprintAttack
	// void Send_SprintAttack(float Hit);                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.ShunB
	// void ShunB();                                                                                                            // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.RandomPlayShun
	// void RandomPlayShun();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.TickRadialForce
	// void TickRadialForce();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.SpawnFarAttackBP
	// void SpawnFarAttackBP();                                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.SpawnFire_Forward
	// void SpawnFire_Forward();                                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.SpawnFarAttackBP2
	// void SpawnFarAttackBP2();                                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.FarFire
	// void FarFire();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_ForceAIHit
	// void Send_ForceAIHit();                                                                                                  // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.SkyStart
	// void SkyStart();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.AXE
	// void AXE();                                                                                                              // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.JZZ
	// void JZZ();                                                                                                              // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.PlayerHaveJzz
	// void PlayerHaveJzz();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Eagle
	// void Eagle();                                                                                                            // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Snake
	// void Snake();                                                                                                            // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_GERFire
	// void Send_GERFire();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Fire-Health
	// void Fire_Health();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.GERFireEvent
	// void GERFireEvent();                                                                                                     // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_XuLiMelee
	// void Send_XuLiMelee(float Hit);                                                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.Send_GuLouHand_Hit
	// void Send_GuLouHand_Hit(float Hit);                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.EyeFire
	// void EyeFire();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.ExecuteUbergraph_NPC_GuLouBoss_AI
	// void ExecuteUbergraph_NPC_GuLouBoss_AI(int32_t EntryPoint);                                                              // [0x148e900] Final|HasDefaults    
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.GuLouBoss_TelePort__DelegateSignature
	// void GuLouBoss_TelePort__DelegateSignature();                                                                            // [0x148e900] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/GuLouBoss/BP/NPC_GuLouBoss_AI.NPC_GuLouBoss_AI_C.GuLouBoss_Dead__DelegateSignature
	// void GuLouBoss_Dead__DelegateSignature();                                                                                // [0x148e900] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C
/// Size: 0x0674 (1652 bytes) (0x0004B8 - 0x000674) align 16 MaxSize: 0x0674
class ANPC_DunArmy_AI_C : public ACharacter
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x04B8   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x04C0   (0x0008)  
	class UParticleSystemComponent*                    PS_FireSmall;                                               // 0x04C8   (0x0008)  
	class UParticleSystemComponent*                    AirEdm;                                                     // 0x04D0   (0x0008)  
	class UStaticMeshComponent*                        NPC_Army_HeadRou;                                           // 0x04D8   (0x0008)  
	class UBoxComponent*                               Attack_EdmHitTouch;                                         // 0x04E0   (0x0008)  
	class UAudioComponent*                             S_DunArmy_DianLiuLoop;                                      // 0x04E8   (0x0008)  
	class UParticleSystemComponent*                    EdmBangZi;                                                  // 0x04F0   (0x0008)  
	class UStaticMeshComponent*                        NPC_BMI_DunArmy_Bang;                                       // 0x04F8   (0x0008)  
	class UStaticMeshComponent*                        NPC_BMI_DunArmy_Dun;                                        // 0x0500   (0x0008)  
	class UWidgetComponent*                            HealthAI;                                                   // 0x0508   (0x0008)  
	class UParticleSystemComponent*                    M_explosionSpark_Air;                                       // 0x0510   (0x0008)  
	class UParticleSystemComponent*                    M_explosionSpark_Normal;                                    // 0x0518   (0x0008)  
	class UPhysicalAnimationComponent*                 PhysicalAnimations;                                         // 0x0520   (0x0008)  
	class UArrowComponent*                             AutoAimPlayer;                                              // 0x0528   (0x0008)  
	class UArrowComponent*                             AttackTraceLoc;                                             // 0x0530   (0x0008)  
	class UBoxComponent*                               Attack_HitTouch_01;                                         // 0x0538   (0x0008)  
	class UBoxComponent*                               Head_Shot;                                                  // 0x0540   (0x0008)  
	class USphereComponent*                            QYQTouch;                                                   // 0x0548   (0x0008)  
	class UParticleSystemComponent*                    QYQPar;                                                     // 0x0550   (0x0008)  
	class UBoxComponent*                               FootR_Shot;                                                 // 0x0558   (0x0008)  
	class UBoxComponent*                               FootL_Shot;                                                 // 0x0560   (0x0008)  
	class UBoxComponent*                               HandL_Shot;                                                 // 0x0568   (0x0008)  
	class UBoxComponent*                               HandR_Shot;                                                 // 0x0570   (0x0008)  
	class UPointLightComponent*                        HitLight;                                                   // 0x0578   (0x0008)  
	class UParticleSystemComponent*                    XChange_Edms;                                               // 0x0580   (0x0008)  
	class UArrowComponent*                             AirZCombo;                                                  // 0x0588   (0x0008)  
	class UArrowComponent*                             LightSwordAirZ;                                             // 0x0590   (0x0008)  
	class UParticleSystemComponent*                    BloodHead;                                                  // 0x0598   (0x0008)  
	class UParticleSystemComponent*                    BloodBody;                                                  // 0x05A0   (0x0008)  
	float                                              JiaSu_Speed_16CE25EC4E3843F0746A538707AFEDE2;               // 0x05A8   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    JiaSu__Direction_16CE25EC4E3843F0746A538707AFEDE2;          // 0x05AC   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x05AD   (0x0003)  MISSED
	class UTimelineComponent*                          JiaSu;                                                      // 0x05B0   (0x0008)  
	float                                              JianSu_Speed_F9A3F67C4F4EDB4356D5EFB7851EF30F;              // 0x05B8   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    JianSu__Direction_F9A3F67C4F4EDB4356D5EFB7851EF30F;         // 0x05BC   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x05BD   (0x0003)  MISSED
	class UTimelineComponent*                          JianSu;                                                     // 0x05C0   (0x0008)  
	float                                              HitPhy_Weight_E76AAD9D4D2BE4443D10A5AA92B4E14D;             // 0x05C8   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    HitPhy__Direction_E76AAD9D4D2BE4443D10A5AA92B4E14D;         // 0x05CC   (0x0001)  
	unsigned char                                      UnknownData03_6[0x3];                                       // 0x05CD   (0x0003)  MISSED
	class UTimelineComponent*                          HitPhy;                                                     // 0x05D0   (0x0008)  
	float                                              AIHealth;                                                   // 0x05D8   (0x0004)  
	float                                              AIMAXHealth;                                                // 0x05DC   (0x0004)  
	FName                                              AirTouchBone;                                               // 0x05E0   (0x0008)  
	bool                                               IsDead_;                                                    // 0x05E8   (0x0001)  
	bool                                               IsFirstLookPlayer;                                          // 0x05E9   (0x0001)  
	bool                                               IsSpawn_;                                                   // 0x05EA   (0x0001)  
	bool                                               IsFireTime;                                                 // 0x05EB   (0x0001)  
	bool                                               IsTouchPlayer;                                              // 0x05EC   (0x0001)  
	bool                                               IsHitTime_;                                                 // 0x05ED   (0x0001)  
	bool                                               HitShield;                                                  // 0x05EE   (0x0001)  
	bool                                               IsAirTime_;                                                 // 0x05EF   (0x0001)  
	bool                                               IsShun_;                                                    // 0x05F0   (0x0001)  
	unsigned char                                      UnknownData04_6[0x7];                                       // 0x05F1   (0x0007)  MISSED
	class UPhysicalAnimationComponent*                 PhysicalAnimation;                                          // 0x05F8   (0x0008)  
	bool                                               IsAirAnimFinish_;                                           // 0x0600   (0x0001)  
	bool                                               CanBoken;                                                   // 0x0601   (0x0001)  
	bool                                               IsKanJiorEMP;                                               // 0x0602   (0x0001)  
	unsigned char                                      UnknownData05_6[0x5];                                       // 0x0603   (0x0005)  MISSED
	class USkeletalMeshComponent*                      RightHand;                                                  // 0x0608   (0x0008)  
	class USkeletalMeshComponent*                      LeftHand;                                                   // 0x0610   (0x0008)  
	class USkeletalMeshComponent*                      LeftFoot;                                                   // 0x0618   (0x0008)  
	class USkeletalMeshComponent*                      RightFoot;                                                  // 0x0620   (0x0008)  
	class USkeletalMeshComponent*                      head;                                                       // 0x0628   (0x0008)  
	bool                                               IsChuJue_;                                                  // 0x0630   (0x0001)  
	bool                                               IsChueJueArea_;                                             // 0x0631   (0x0001)  
	bool                                               IsFarAttack_;                                               // 0x0632   (0x0001)  
	bool                                               IsPlayerAirUseQYQ_;                                         // 0x0633   (0x0001)  
	bool                                               DFHave_;                                                    // 0x0634   (0x0001)  
	bool                                               BaTi_;                                                      // 0x0635   (0x0001)  
	bool                                               IsAirMelee_;                                                // 0x0636   (0x0001)  
	unsigned char                                      UnknownData06_6[0x1];                                       // 0x0637   (0x0001)  MISSED
	float                                              Attack_Hit_01;                                              // 0x0638   (0x0004)  
	float                                              SpawnTime;                                                  // 0x063C   (0x0004)  
	SDK_UNDEFINED(16,966) /* FMulticastInlineDelegate */ __um(AIDEAD);                                             // 0x0640   (0x0010)  
	float                                              FarAttack_Hit;                                              // 0x0650   (0x0004)  
	float                                              NOWDEFUHealth;                                              // 0x0654   (0x0004)  
	float                                              MAXDEFUHealth;                                              // 0x0658   (0x0004)  
	float                                              DEFU_UIProgress;                                            // 0x065C   (0x0004)  
	float                                              PlayerDistance;                                             // 0x0660   (0x0004)  
	float                                              PerfectDefu_DEFUHealth;                                     // 0x0664   (0x0004)  
	int32_t                                            AirType;                                                    // 0x0668   (0x0004)  
	bool                                               IsMeleePower_;                                              // 0x066C   (0x0001)  
	bool                                               ForceAirTime;                                               // 0x066D   (0x0001)  
	bool                                               IsSprintAttack_;                                            // 0x066E   (0x0001)  
	unsigned char                                      UnknownData07_6[0x1];                                       // 0x066F   (0x0001)  MISSED
	int32_t                                            ShieldHealth;                                               // 0x0670   (0x0004)  


	/// Functions
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.HealthUI_Vis?
	// void HealthUI_Vis_();                                                                                                    // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.TraceWall
	// void TraceWall();                                                                                                        // [0x148e900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.ForceLookPlayers
	// void ForceLookPlayers();                                                                                                 // [0x148e900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.HealthUIRotToPlayer
	// void HealthUIRotToPlayer();                                                                                              // [0x148e900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.AutoAnimPlayerEvent
	// void AutoAnimPlayerEvent();                                                                                              // [0x148e900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.HitEdm
	// void HitEdm();                                                                                                           // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.HitBlood
	// void HitBlood();                                                                                                         // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.LookAtPlayer
	// void LookAtPlayer();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.HitPhy__FinishedFunc
	// void HitPhy__FinishedFunc();                                                                                             // [0x148e900] BlueprintEvent       
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.HitPhy__UpdateFunc
	// void HitPhy__UpdateFunc();                                                                                               // [0x148e900] BlueprintEvent       
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.JianSu__FinishedFunc
	// void JianSu__FinishedFunc();                                                                                             // [0x148e900] BlueprintEvent       
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.JianSu__UpdateFunc
	// void JianSu__UpdateFunc();                                                                                               // [0x148e900] BlueprintEvent       
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.JiaSu__FinishedFunc
	// void JiaSu__FinishedFunc();                                                                                              // [0x148e900] BlueprintEvent       
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.JiaSu__UpdateFunc
	// void JiaSu__UpdateFunc();                                                                                                // [0x148e900] BlueprintEvent       
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.OnFail_89FED29C460B7223C8AC968CA3AD11B9
	// void OnFail_89FED29C460B7223C8AC968CA3AD11B9(TEnumAsByte<EPathFollowingResult> MovementResult);                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.OnSuccess_89FED29C460B7223C8AC968CA3AD11B9
	// void OnSuccess_89FED29C460B7223C8AC968CA3AD11B9(TEnumAsByte<EPathFollowingResult> MovementResult);                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Completed_939FFC27496EAE43D9FC3B963A14B7F5
	// void Completed_939FFC27496EAE43D9FC3B963A14B7F5(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_HuaChan
	// void Send_HuaChan();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_NearDefu
	// void Send_NearDefu(int32_t FireType);                                                                                    // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_PerfectDefu
	// void Send_PerfectDefu(int32_t FireType);                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_AIBoat
	// void Send_AIBoat(class UPrimitiveComponent* HitBox, float Hit);                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_AIDEFUHealths
	// void Send_AIDEFUHealths(float DEFUHealth, float BloddHealth, bool HaveDefu_);                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_ForceAIHit
	// void Send_ForceAIHit();                                                                                                  // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_BloodHK
	// void Send_BloodHK();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_DefuHK
	// void Send_DefuHK();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_Add_Alerts
	// void Send_Add_Alerts(float DS);                                                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_Dee_Alert
	// void Send_Dee_Alert();                                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_ForwardSeePlayer
	// void Send_ForwardSeePlayer();                                                                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_FootAI_Alert
	// void Send_FootAI_Alert();                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_BackSeePlayer
	// void Send_BackSeePlayer();                                                                                               // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_ShunAI_Alert
	// void Send_ShunAI_Alert();                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_PlayerHitCarAI
	// void Send_PlayerHitCarAI();                                                                                              // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_PlayerQYQAI
	// void Send_PlayerQYQAI(int32_t Number);                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_GuLouHand_Hit
	// void Send_GuLouHand_Hit(float Hit);                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x148e900] Event|Protected|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.MoveToPlayer
	// void MoveToPlayer();                                                                                                     // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x148e900] Event|Public|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.NearFire
	// void NearFire();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.RestRunToWalk
	// void RestRunToWalk();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.ReceiveAnyDamage
	// void ReceiveAnyDamage(float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser); // [0x148e900] BlueprintAuthorityOnly|Event|Public|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.AIHit
	// void AIHit();                                                                                                            // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_HitSword
	// void Send_HitSword(float Hit, int32_t FiretType);                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.-Health
	// void _Health();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_MeleePower
	// void Send_MeleePower(float Hit);                                                                                         // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_UpLightSword
	// void Send_UpLightSword(float Hit);                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.FallGround
	// void FallGround();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.UpDataAirZ
	// void UpDataAirZ();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.ForceLookPlayer
	// void ForceLookPlayer();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_KanJi
	// void Send_KanJi(float Hit);                                                                                              // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_ZhaDi
	// void Send_ZhaDi();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.AIHandRShot
	// void AIHandRShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.AIHandLShot
	// void AIHandLShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.BokenHandR
	// void BokenHandR();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.BokenHandL
	// void BokenHandL();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.BokenFootL
	// void BokenFootL();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.AIFootLShot
	// void AIFootLShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.BokenFootR
	// void BokenFootR();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.AIFootRShot
	// void AIFootRShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_AIQYQ
	// void Send_AIQYQ();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.RandomBoken
	// void RandomBoken();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.BokenHead
	// void BokenHead();                                                                                                        // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.AIHeadShot
	// void AIHeadShot();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.BndEvt__Attack_HitTouch_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
	// void BndEvt__Attack_HitTouch_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x148e900] HasOutParms|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Open_Hit01_Event
	// void Open_Hit01_Event();                                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Close_Hit01_Event
	// void Close_Hit01_Event();                                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.AttackTrace
	// void AttackTrace();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.PerfectDefu_HitAnim
	// void PerfectDefu_HitAnim();                                                                                              // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_AIFlyQYQ
	// void Send_AIFlyQYQ();                                                                                                    // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Warning
	// void Warning();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.IsAirUp
	// void IsAirUp();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.UpDataDEFUHealth
	// void UpDataDEFUHealth();                                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_DisPlayAIHealthUI
	// void Send_DisPlayAIHealthUI(bool Vis_);                                                                                  // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.ForceDEFUAnim
	// void ForceDEFUAnim();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.ForceAirOff
	// void ForceAirOff();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_EMP
	// void Send_EMP(float Hit);                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.ForceAir
	// void ForceAir();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_SprintAttack
	// void Send_SprintAttack(float Hit);                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_ShieldHit
	// void Send_ShieldHit();                                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_ShieldHitMeleeOrSword
	// void Send_ShieldHitMeleeOrSword(int32_t Hit);                                                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.RestWalkToRun
	// void RestWalkToRun();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.BndEvt__Attack_EdmHitTouch_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
	// void BndEvt__Attack_EdmHitTouch_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x148e900] HasOutParms|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Open_HitEdm_Event
	// void Open_HitEdm_Event();                                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Close_HiEdm_Event
	// void Close_HiEdm_Event();                                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.RestAirTraceZ
	// void RestAirTraceZ();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.PXBodyTraceGround
	// void PXBodyTraceGround();                                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.StopAirMove
	// void StopAirMove();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_GERFire
	// void Send_GERFire();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Fire-Health
	// void Fire_Health();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.GERFireEvent
	// void GERFireEvent();                                                                                                     // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_HealthUIVis
	// void Send_HealthUIVis();                                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.Send_XuLiMelee
	// void Send_XuLiMelee(float Hit);                                                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.ExecuteUbergraph_NPC_DunArmy_AI
	// void ExecuteUbergraph_NPC_DunArmy_AI(int32_t EntryPoint);                                                                // [0x148e900] Final|HasDefaults    
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_DunArmy_AI.NPC_DunArmy_AI_C.AIDEAD__DelegateSignature
	// void AIDEAD__DelegateSignature();                                                                                        // [0x148e900] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C
/// Size: 0x063F (1599 bytes) (0x0004B8 - 0x00063F) align 16 MaxSize: 0x063F
class ANPC_IronArmy2_AI_C : public ACharacter
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x04B8   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x04C0   (0x0008)  
	class UParticleSystemComponent*                    PS_FireSmall;                                               // 0x04C8   (0x0008)  
	class UParticleSystemComponent*                    AirEdm;                                                     // 0x04D0   (0x0008)  
	class UParticleSystemComponent*                    EdmBangZi2;                                                 // 0x04D8   (0x0008)  
	class UParticleSystemComponent*                    EdmBangZi;                                                  // 0x04E0   (0x0008)  
	class UStaticMeshComponent*                        _3D_IronArmy_WP;                                            // 0x04E8   (0x0008)  
	class UWidgetComponent*                            HealthAI;                                                   // 0x04F0   (0x0008)  
	class UParticleSystemComponent*                    M_explosionSpark_Air;                                       // 0x04F8   (0x0008)  
	class UParticleSystemComponent*                    M_explosionSpark_Normal;                                    // 0x0500   (0x0008)  
	class UBoxComponent*                               FarAttack_HitTouch;                                         // 0x0508   (0x0008)  
	class UPhysicalAnimationComponent*                 PhysicalAnimations;                                         // 0x0510   (0x0008)  
	class UArrowComponent*                             AutoAimPlayer;                                              // 0x0518   (0x0008)  
	class UArrowComponent*                             AttackTraceLoc;                                             // 0x0520   (0x0008)  
	class UBoxComponent*                               Attack_HitTouch_01;                                         // 0x0528   (0x0008)  
	class UBoxComponent*                               Head_Shot;                                                  // 0x0530   (0x0008)  
	class USphereComponent*                            QYQTouch;                                                   // 0x0538   (0x0008)  
	class UParticleSystemComponent*                    QYQPar;                                                     // 0x0540   (0x0008)  
	class UBoxComponent*                               FootR_Shot;                                                 // 0x0548   (0x0008)  
	class UBoxComponent*                               FootL_Shot;                                                 // 0x0550   (0x0008)  
	class UBoxComponent*                               HandL_Shot;                                                 // 0x0558   (0x0008)  
	class UBoxComponent*                               HandR_Shot;                                                 // 0x0560   (0x0008)  
	class UPointLightComponent*                        HitLight;                                                   // 0x0568   (0x0008)  
	class UParticleSystemComponent*                    XChange_Edms;                                               // 0x0570   (0x0008)  
	class UArrowComponent*                             AirZCombo;                                                  // 0x0578   (0x0008)  
	class UArrowComponent*                             LightSwordAirZ;                                             // 0x0580   (0x0008)  
	class UParticleSystemComponent*                    BloodHead;                                                  // 0x0588   (0x0008)  
	class UParticleSystemComponent*                    BloodBody;                                                  // 0x0590   (0x0008)  
	float                                              HitPhy_Weight_7DE034254B1C3D3DA23884BDEDE200E6;             // 0x0598   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    HitPhy__Direction_7DE034254B1C3D3DA23884BDEDE200E6;         // 0x059C   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x059D   (0x0003)  MISSED
	class UTimelineComponent*                          HitPhy;                                                     // 0x05A0   (0x0008)  
	float                                              AIHealth;                                                   // 0x05A8   (0x0004)  
	float                                              AIMAXHealth;                                                // 0x05AC   (0x0004)  
	FName                                              AirTouchBone;                                               // 0x05B0   (0x0008)  
	bool                                               IsDead_;                                                    // 0x05B8   (0x0001)  
	bool                                               IsFirstLookPlayer;                                          // 0x05B9   (0x0001)  
	bool                                               IsSpawn_;                                                   // 0x05BA   (0x0001)  
	bool                                               IsFireTime;                                                 // 0x05BB   (0x0001)  
	bool                                               IsTouchPlayer;                                              // 0x05BC   (0x0001)  
	bool                                               IsHitTime_;                                                 // 0x05BD   (0x0001)  
	bool                                               HitShield;                                                  // 0x05BE   (0x0001)  
	bool                                               IsAirTime_;                                                 // 0x05BF   (0x0001)  
	bool                                               IsShun_;                                                    // 0x05C0   (0x0001)  
	unsigned char                                      UnknownData02_6[0x7];                                       // 0x05C1   (0x0007)  MISSED
	class UPhysicalAnimationComponent*                 PhysicalAnimation;                                          // 0x05C8   (0x0008)  
	bool                                               IsAirAnimFinish_;                                           // 0x05D0   (0x0001)  
	bool                                               CanBoken;                                                   // 0x05D1   (0x0001)  
	bool                                               IsKanJiorEMP;                                               // 0x05D2   (0x0001)  
	unsigned char                                      UnknownData03_6[0x5];                                       // 0x05D3   (0x0005)  MISSED
	class USkeletalMeshComponent*                      RightHand;                                                  // 0x05D8   (0x0008)  
	class USkeletalMeshComponent*                      LeftHand;                                                   // 0x05E0   (0x0008)  
	class USkeletalMeshComponent*                      LeftFoot;                                                   // 0x05E8   (0x0008)  
	class USkeletalMeshComponent*                      RightFoot;                                                  // 0x05F0   (0x0008)  
	class USkeletalMeshComponent*                      head;                                                       // 0x05F8   (0x0008)  
	bool                                               IsChuJue_;                                                  // 0x0600   (0x0001)  
	bool                                               IsChueJueArea_;                                             // 0x0601   (0x0001)  
	bool                                               IsFarAttack_;                                               // 0x0602   (0x0001)  
	bool                                               IsPlayerAirUseQYQ_;                                         // 0x0603   (0x0001)  
	bool                                               DFHave_;                                                    // 0x0604   (0x0001)  
	bool                                               BaTi_;                                                      // 0x0605   (0x0001)  
	bool                                               IsAirMelee_;                                                // 0x0606   (0x0001)  
	unsigned char                                      UnknownData04_6[0x1];                                       // 0x0607   (0x0001)  MISSED
	float                                              Attack_Hit_01;                                              // 0x0608   (0x0004)  
	float                                              SpawnTime;                                                  // 0x060C   (0x0004)  
	SDK_UNDEFINED(16,967) /* FMulticastInlineDelegate */ __um(AIDEAD);                                             // 0x0610   (0x0010)  
	float                                              FarAttack_Hit;                                              // 0x0620   (0x0004)  
	float                                              NOWDEFUHealth;                                              // 0x0624   (0x0004)  
	float                                              MAXDEFUHealth;                                              // 0x0628   (0x0004)  
	float                                              DEFU_UIProgress;                                            // 0x062C   (0x0004)  
	float                                              PlayerDistance;                                             // 0x0630   (0x0004)  
	float                                              PerfectDefu_DEFUHealth;                                     // 0x0634   (0x0004)  
	int32_t                                            AirType;                                                    // 0x0638   (0x0004)  
	bool                                               IsMeleePower_;                                              // 0x063C   (0x0001)  
	bool                                               ForceAirTime;                                               // 0x063D   (0x0001)  
	bool                                               IsSprintAttack_;                                            // 0x063E   (0x0001)  


	/// Functions
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.HealthUI_Vis?
	// void HealthUI_Vis_();                                                                                                    // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.TraceWall
	// void TraceWall();                                                                                                        // [0x148e900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.HealthUIRotToPlayer
	// void HealthUIRotToPlayer();                                                                                              // [0x148e900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.AutoAnimPlayerEvent
	// void AutoAnimPlayerEvent();                                                                                              // [0x148e900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.HitEdm
	// void HitEdm();                                                                                                           // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.HitBlood
	// void HitBlood();                                                                                                         // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.LookAtPlayer
	// void LookAtPlayer();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.HitPhy__FinishedFunc
	// void HitPhy__FinishedFunc();                                                                                             // [0x148e900] BlueprintEvent       
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.HitPhy__UpdateFunc
	// void HitPhy__UpdateFunc();                                                                                               // [0x148e900] BlueprintEvent       
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.OnFail_C9E7A056483B69C4D311DD881D213F4B
	// void OnFail_C9E7A056483B69C4D311DD881D213F4B(TEnumAsByte<EPathFollowingResult> MovementResult);                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.OnSuccess_C9E7A056483B69C4D311DD881D213F4B
	// void OnSuccess_C9E7A056483B69C4D311DD881D213F4B(TEnumAsByte<EPathFollowingResult> MovementResult);                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Completed_B3CAB04F4CDF238C855D4A82FF1BBE5A
	// void Completed_B3CAB04F4CDF238C855D4A82FF1BBE5A(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_ShieldHit
	// void Send_ShieldHit();                                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_HuaChan
	// void Send_HuaChan();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_ShieldHitMeleeOrSword
	// void Send_ShieldHitMeleeOrSword(int32_t Hit);                                                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_NearDefu
	// void Send_NearDefu(int32_t FireType);                                                                                    // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_PerfectDefu
	// void Send_PerfectDefu(int32_t FireType);                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_AIBoat
	// void Send_AIBoat(class UPrimitiveComponent* HitBox, float Hit);                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_AIDEFUHealths
	// void Send_AIDEFUHealths(float DEFUHealth, float BloddHealth, bool HaveDefu_);                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_ForceAIHit
	// void Send_ForceAIHit();                                                                                                  // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_BloodHK
	// void Send_BloodHK();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_DefuHK
	// void Send_DefuHK();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_Add_Alerts
	// void Send_Add_Alerts(float DS);                                                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_Dee_Alert
	// void Send_Dee_Alert();                                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_ForwardSeePlayer
	// void Send_ForwardSeePlayer();                                                                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_FootAI_Alert
	// void Send_FootAI_Alert();                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_BackSeePlayer
	// void Send_BackSeePlayer();                                                                                               // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_ShunAI_Alert
	// void Send_ShunAI_Alert();                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_PlayerHitCarAI
	// void Send_PlayerHitCarAI();                                                                                              // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_PlayerQYQAI
	// void Send_PlayerQYQAI(int32_t Number);                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_GuLouHand_Hit
	// void Send_GuLouHand_Hit(float Hit);                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x148e900] Event|Protected|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.MoveToPlayer
	// void MoveToPlayer();                                                                                                     // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x148e900] Event|Public|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.NearFire
	// void NearFire();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.RestLDMove
	// void RestLDMove();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.ShunBack
	// void ShunBack();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.ReceiveAnyDamage
	// void ReceiveAnyDamage(float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser); // [0x148e900] BlueprintAuthorityOnly|Event|Public|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.AIHit
	// void AIHit();                                                                                                            // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_HitSword
	// void Send_HitSword(float Hit, int32_t FiretType);                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.-Health
	// void _Health();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_MeleePower
	// void Send_MeleePower(float Hit);                                                                                         // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_UpLightSword
	// void Send_UpLightSword(float Hit);                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.FallGround
	// void FallGround();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.UpDataAirZ
	// void UpDataAirZ();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.ForceLookPlayer
	// void ForceLookPlayer();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_KanJi
	// void Send_KanJi(float Hit);                                                                                              // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_ZhaDi
	// void Send_ZhaDi();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.AIHandRShot
	// void AIHandRShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.AIHandLShot
	// void AIHandLShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.BokenHandR
	// void BokenHandR();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.BokenHandL
	// void BokenHandL();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.BokenFootL
	// void BokenFootL();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.AIFootLShot
	// void AIFootLShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.BokenFootR
	// void BokenFootR();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.AIFootRShot
	// void AIFootRShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_AIQYQ
	// void Send_AIQYQ();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.RandomBoken
	// void RandomBoken();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.BokenHead
	// void BokenHead();                                                                                                        // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.AIHeadShot
	// void AIHeadShot();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.BndEvt__Attack_HitTouch_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
	// void BndEvt__Attack_HitTouch_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x148e900] HasOutParms|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Open_Hit01_Event
	// void Open_Hit01_Event();                                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Close_Hit01_Event
	// void Close_Hit01_Event();                                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.AttackTrace
	// void AttackTrace();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.PerfectDefu_HitAnim
	// void PerfectDefu_HitAnim();                                                                                              // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_AIFlyQYQ
	// void Send_AIFlyQYQ();                                                                                                    // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Warning
	// void Warning();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.ShunForward
	// void ShunForward();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.SpawnZhaDiBig
	// void SpawnZhaDiBig();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.IsAirUp
	// void IsAirUp();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.UpDataDEFUHealth
	// void UpDataDEFUHealth();                                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.DefuPerfectPlayer
	// void DefuPerfectPlayer();                                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_DisPlayAIHealthUI
	// void Send_DisPlayAIHealthUI(bool Vis_);                                                                                  // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.ForceDEFUAnim
	// void ForceDEFUAnim();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.ForceAirOff
	// void ForceAirOff();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_EMP
	// void Send_EMP(float Hit);                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.ForceAir
	// void ForceAir();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_SprintAttack
	// void Send_SprintAttack(float Hit);                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.ShunL
	// void ShunL();                                                                                                            // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.ShunR
	// void ShunR();                                                                                                            // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.RestAirTraceZ
	// void RestAirTraceZ();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.PXBodyTraceGround
	// void PXBodyTraceGround();                                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.StopAirMove
	// void StopAirMove();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_GERFire
	// void Send_GERFire();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Fire-Health
	// void Fire_Health();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.GERFireEvent
	// void GERFireEvent();                                                                                                     // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_HealthUIVis
	// void Send_HealthUIVis();                                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.Send_XuLiMelee
	// void Send_XuLiMelee(float Hit);                                                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.NearFireForce
	// void NearFireForce();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.ExecuteUbergraph_NPC_IronArmy2_AI
	// void ExecuteUbergraph_NPC_IronArmy2_AI(int32_t EntryPoint);                                                              // [0x148e900] Final|HasDefaults    
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy2_AI.NPC_IronArmy2_AI_C.AIDEAD__DelegateSignature
	// void AIDEAD__DelegateSignature();                                                                                        // [0x148e900] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C
/// Size: 0x0644 (1604 bytes) (0x0004B8 - 0x000644) align 16 MaxSize: 0x0644
class ANPC_IronArmy_AI_C : public ACharacter
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x04B8   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x04C0   (0x0008)  
	class UParticleSystemComponent*                    PS_FireSmall;                                               // 0x04C8   (0x0008)  
	class UArrowComponent*                             AttackTraceLoc;                                             // 0x04D0   (0x0008)  
	class UWidgetComponent*                            ChuJueUI;                                                   // 0x04D8   (0x0008)  
	class UParticleSystemComponent*                    AirEdm;                                                     // 0x04E0   (0x0008)  
	class UWidgetComponent*                            HealthAI;                                                   // 0x04E8   (0x0008)  
	class USphereComponent*                            ChuJueArea;                                                 // 0x04F0   (0x0008)  
	class UParticleSystemComponent*                    M_explosionSpark_Air;                                       // 0x04F8   (0x0008)  
	class UParticleSystemComponent*                    M_explosionSpark_Normal;                                    // 0x0500   (0x0008)  
	class UBoxComponent*                               FarAttack_HitTouch;                                         // 0x0508   (0x0008)  
	SDK_UNDEFINED(8,968) /* nil* */                    __um(PhysicalAnimations);                                   // 0x0510   (0x0008)  
	class UArrowComponent*                             AutoAimPlayer;                                              // 0x0518   (0x0008)  
	class UBoxComponent*                               Attack_HitTouch_01;                                         // 0x0520   (0x0008)  
	class UBoxComponent*                               Head_Shot;                                                  // 0x0528   (0x0008)  
	class USphereComponent*                            QYQTouch;                                                   // 0x0530   (0x0008)  
	class UParticleSystemComponent*                    QYQPar;                                                     // 0x0538   (0x0008)  
	class UBoxComponent*                               FootR_Shot;                                                 // 0x0540   (0x0008)  
	class UBoxComponent*                               FootL_Shot;                                                 // 0x0548   (0x0008)  
	class UBoxComponent*                               HandL_Shot;                                                 // 0x0550   (0x0008)  
	class UBoxComponent*                               HandR_Shot;                                                 // 0x0558   (0x0008)  
	class UPointLightComponent*                        HitLight;                                                   // 0x0560   (0x0008)  
	class UParticleSystemComponent*                    XChange_Edms;                                               // 0x0568   (0x0008)  
	class UArrowComponent*                             AirZCombo;                                                  // 0x0570   (0x0008)  
	class UArrowComponent*                             LightSwordAirZ;                                             // 0x0578   (0x0008)  
	class UParticleSystemComponent*                    BloodHead;                                                  // 0x0580   (0x0008)  
	class UParticleSystemComponent*                    BloodBody;                                                  // 0x0588   (0x0008)  
	float                                              HitPhy_Weight_AF9CB90F4960E24F9DFA3D8CBD884BA2;             // 0x0590   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    HitPhy__Direction_AF9CB90F4960E24F9DFA3D8CBD884BA2;         // 0x0594   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0595   (0x0003)  MISSED
	class UTimelineComponent*                          HitPhy;                                                     // 0x0598   (0x0008)  
	float                                              AIHealth;                                                   // 0x05A0   (0x0004)  
	float                                              AIMAXHealth;                                                // 0x05A4   (0x0004)  
	FName                                              AirTouchBone;                                               // 0x05A8   (0x0008)  
	bool                                               IsDead_;                                                    // 0x05B0   (0x0001)  
	bool                                               IsFirstLookPlayer;                                          // 0x05B1   (0x0001)  
	bool                                               IsSpawn_;                                                   // 0x05B2   (0x0001)  
	bool                                               IsFireTime;                                                 // 0x05B3   (0x0001)  
	bool                                               IsTouchPlayer;                                              // 0x05B4   (0x0001)  
	bool                                               IsHitTime_;                                                 // 0x05B5   (0x0001)  
	bool                                               HitShield;                                                  // 0x05B6   (0x0001)  
	bool                                               IsAirTime_;                                                 // 0x05B7   (0x0001)  
	bool                                               IsShun_;                                                    // 0x05B8   (0x0001)  
	unsigned char                                      UnknownData02_6[0x7];                                       // 0x05B9   (0x0007)  MISSED
	class UPhysicalAnimationComponent*                 PhysicalAnimation;                                          // 0x05C0   (0x0008)  
	bool                                               IsAirAnimFinish_;                                           // 0x05C8   (0x0001)  
	bool                                               CanBoken;                                                   // 0x05C9   (0x0001)  
	bool                                               IsKanJiorEMP;                                               // 0x05CA   (0x0001)  
	unsigned char                                      UnknownData03_6[0x5];                                       // 0x05CB   (0x0005)  MISSED
	class USkeletalMeshComponent*                      RightHand;                                                  // 0x05D0   (0x0008)  
	class USkeletalMeshComponent*                      LeftHand;                                                   // 0x05D8   (0x0008)  
	class USkeletalMeshComponent*                      LeftFoot;                                                   // 0x05E0   (0x0008)  
	class USkeletalMeshComponent*                      RightFoot;                                                  // 0x05E8   (0x0008)  
	class USkeletalMeshComponent*                      head;                                                       // 0x05F0   (0x0008)  
	bool                                               IsChuJue_;                                                  // 0x05F8   (0x0001)  
	bool                                               IsChueJueArea_;                                             // 0x05F9   (0x0001)  
	bool                                               IsFarAttack_;                                               // 0x05FA   (0x0001)  
	bool                                               IsPlayerAirUseQYQ_;                                         // 0x05FB   (0x0001)  
	bool                                               DFHave_;                                                    // 0x05FC   (0x0001)  
	bool                                               BaTi_;                                                      // 0x05FD   (0x0001)  
	bool                                               IsAirMelee_;                                                // 0x05FE   (0x0001)  
	unsigned char                                      UnknownData04_6[0x1];                                       // 0x05FF   (0x0001)  MISSED
	float                                              Attack_Hit_01;                                              // 0x0600   (0x0004)  
	float                                              SpawnTime;                                                  // 0x0604   (0x0004)  
	SDK_UNDEFINED(16,969) /* FMulticastInlineDelegate */ __um(AIDEAD);                                             // 0x0608   (0x0010)  
	float                                              FarAttack_Hit;                                              // 0x0618   (0x0004)  
	float                                              NOWDEFUHealth;                                              // 0x061C   (0x0004)  
	float                                              MAXDEFUHealth;                                              // 0x0620   (0x0004)  
	float                                              DEFU_UIProgress;                                            // 0x0624   (0x0004)  
	float                                              PlayerDistance;                                             // 0x0628   (0x0004)  
	float                                              PerfectDefu_DEFUHealth;                                     // 0x062C   (0x0004)  
	int32_t                                            AirType;                                                    // 0x0630   (0x0004)  
	FVector                                            EMPAirZ;                                                    // 0x0634   (0x000C)  
	bool                                               IsMeleePower_;                                              // 0x0640   (0x0001)  
	bool                                               JumpDownSpawn_;                                             // 0x0641   (0x0001)  
	bool                                               IsSprintAttack_;                                            // 0x0642   (0x0001)  
	bool                                               AirPlaneSpawn_;                                             // 0x0643   (0x0001)  


	/// Functions
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.HealthUI_Vis?
	// void HealthUI_Vis_();                                                                                                    // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.TraceGroundRot
	// void TraceGroundRot();                                                                                                   // [0x148e900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.TraceWall
	// void TraceWall();                                                                                                        // [0x148e900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.HealthUIRotToPlayer
	// void HealthUIRotToPlayer();                                                                                              // [0x148e900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.AutoAnimPlayerEvent
	// void AutoAnimPlayerEvent();                                                                                              // [0x148e900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.HitEdm
	// void HitEdm();                                                                                                           // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.HitBlood
	// void HitBlood();                                                                                                         // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.LookAtPlayer
	// void LookAtPlayer();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.HitPhy__FinishedFunc
	// void HitPhy__FinishedFunc();                                                                                             // [0x148e900] BlueprintEvent       
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.HitPhy__UpdateFunc
	// void HitPhy__UpdateFunc();                                                                                               // [0x148e900] BlueprintEvent       
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.OnFail_14D61C3F42CF8DD5F717C2A001F7F61B
	// void OnFail_14D61C3F42CF8DD5F717C2A001F7F61B(TEnumAsByte<EPathFollowingResult> MovementResult);                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.OnSuccess_14D61C3F42CF8DD5F717C2A001F7F61B
	// void OnSuccess_14D61C3F42CF8DD5F717C2A001F7F61B(TEnumAsByte<EPathFollowingResult> MovementResult);                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Completed_C3E563B74A140202D706F0A612F0647D
	// void Completed_C3E563B74A140202D706F0A612F0647D(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_ShieldHit
	// void Send_ShieldHit();                                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_HuaChan
	// void Send_HuaChan();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_ShieldHitMeleeOrSword
	// void Send_ShieldHitMeleeOrSword(int32_t Hit);                                                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_NearDefu
	// void Send_NearDefu(int32_t FireType);                                                                                    // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_PerfectDefu
	// void Send_PerfectDefu(int32_t FireType);                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_AIBoat
	// void Send_AIBoat(class UPrimitiveComponent* HitBox, float Hit);                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_AIDEFUHealths
	// void Send_AIDEFUHealths(float DEFUHealth, float BloddHealth, bool HaveDefu_);                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_ForceAIHit
	// void Send_ForceAIHit();                                                                                                  // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_BloodHK
	// void Send_BloodHK();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_DefuHK
	// void Send_DefuHK();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_Add_Alerts
	// void Send_Add_Alerts(float DS);                                                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_Dee_Alert
	// void Send_Dee_Alert();                                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_ForwardSeePlayer
	// void Send_ForwardSeePlayer();                                                                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_FootAI_Alert
	// void Send_FootAI_Alert();                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_BackSeePlayer
	// void Send_BackSeePlayer();                                                                                               // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_ShunAI_Alert
	// void Send_ShunAI_Alert();                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_PlayerHitCarAI
	// void Send_PlayerHitCarAI();                                                                                              // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_PlayerQYQAI
	// void Send_PlayerQYQAI(int32_t Number);                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_GuLouHand_Hit
	// void Send_GuLouHand_Hit(float Hit);                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x148e900] Event|Protected|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.MoveToPlayer
	// void MoveToPlayer();                                                                                                     // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x148e900] Event|Public|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.NearFire
	// void NearFire();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.RestLDMove
	// void RestLDMove();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.ShunBack
	// void ShunBack();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.ReceiveAnyDamage
	// void ReceiveAnyDamage(float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser); // [0x148e900] BlueprintAuthorityOnly|Event|Public|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.AIHit
	// void AIHit();                                                                                                            // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_HitSword
	// void Send_HitSword(float Hit, int32_t FiretType);                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.-Health
	// void _Health();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_MeleePower
	// void Send_MeleePower(float Hit);                                                                                         // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_UpLightSword
	// void Send_UpLightSword(float Hit);                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.FallGround
	// void FallGround();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.UpDataAirZ
	// void UpDataAirZ();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.ForceLookPlayer
	// void ForceLookPlayer();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.RestAirTraceZ
	// void RestAirTraceZ();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_KanJi
	// void Send_KanJi(float Hit);                                                                                              // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_ZhaDi
	// void Send_ZhaDi();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.AIHandRShot
	// void AIHandRShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.AIHandLShot
	// void AIHandLShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.BokenHandR
	// void BokenHandR();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.BokenHandL
	// void BokenHandL();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.BokenFootL
	// void BokenFootL();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.AIFootLShot
	// void AIFootLShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.BokenFootR
	// void BokenFootR();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.AIFootRShot
	// void AIFootRShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_AIQYQ
	// void Send_AIQYQ();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.RandomBoken
	// void RandomBoken();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.BokenHead
	// void BokenHead();                                                                                                        // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.AIHeadShot
	// void AIHeadShot();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.BndEvt__Attack_HitTouch_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
	// void BndEvt__Attack_HitTouch_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x148e900] HasOutParms|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Open_Hit01_Event
	// void Open_Hit01_Event();                                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Close_Hit01_Event
	// void Close_Hit01_Event();                                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.AttackTrace
	// void AttackTrace();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.PerfectDefu_HitAnim
	// void PerfectDefu_HitAnim();                                                                                              // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.SpawnZhaDi
	// void SpawnZhaDi();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_AIFlyQYQ
	// void Send_AIFlyQYQ();                                                                                                    // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Warning
	// void Warning();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.ShunLeft
	// void ShunLeft();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.ShunRight
	// void ShunRight();                                                                                                        // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.SpawnFarAttackBP
	// void SpawnFarAttackBP();                                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.FarFire
	// void FarFire();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.SpawnZhaDiBig
	// void SpawnZhaDiBig();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.IsAirUp
	// void IsAirUp();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.BndEvt__FarAttack_HitTouch_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
	// void BndEvt__FarAttack_HitTouch_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x148e900] HasOutParms|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.BndEvt__ChuJueArea_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature
	// void BndEvt__ChuJueArea_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x148e900] HasOutParms|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.BndEvt__ChuJueArea_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature
	// void BndEvt__ChuJueArea_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // [0x148e900] BlueprintEvent       
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.KillOver
	// void KillOver();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.StartKillAnim
	// void StartKillAnim();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.UpDataDEFUHealth
	// void UpDataDEFUHealth();                                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.DefuPerfectPlayer
	// void DefuPerfectPlayer();                                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_DisPlayAIHealthUI
	// void Send_DisPlayAIHealthUI(bool Vis_);                                                                                  // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.ForceDEFUAnim
	// void ForceDEFUAnim();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.ForceAirOff
	// void ForceAirOff();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_EMP
	// void Send_EMP(float Hit);                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.ForceAir
	// void ForceAir();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_SprintAttack
	// void Send_SprintAttack(float Hit);                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.PXBodyTraceGround
	// void PXBodyTraceGround();                                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_GERFire
	// void Send_GERFire();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Fire-Health
	// void Fire_Health();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.GERFireEvent
	// void GERFireEvent();                                                                                                     // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.StopAirMove
	// void StopAirMove();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_HealthUIVis
	// void Send_HealthUIVis();                                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.Send_XuLiMelee
	// void Send_XuLiMelee(float Hit);                                                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.ExecuteUbergraph_NPC_IronArmy_AI
	// void ExecuteUbergraph_NPC_IronArmy_AI(int32_t EntryPoint);                                                               // [0x148e900] Final|HasDefaults    
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI.NPC_IronArmy_AI_C.AIDEAD__DelegateSignature
	// void AIDEAD__DelegateSignature();                                                                                        // [0x148e900] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_AI_ChuJue.NPC_IronArmy_AI_ChuJue_C
/// Size: 0x0644 (1604 bytes) (0x000644 - 0x000644) align 16 MaxSize: 0x0644
class ANPC_IronArmy_AI_ChuJue_C : public ANPC_IronArmy_AI_C
{ 
public:
};

/// Class /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C
/// Size: 0x0611 (1553 bytes) (0x0004B8 - 0x000611) align 16 MaxSize: 0x0611
class ANPC_IronArmy_NewPlayer_C : public ACharacter
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x04B8   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x04C0   (0x0008)  
	class UParticleSystemComponent*                    AirEdm;                                                     // 0x04C8   (0x0008)  
	class UParticleSystemComponent*                    M_explosionSpark_Air;                                       // 0x04D0   (0x0008)  
	class UParticleSystemComponent*                    M_explosionSpark_Normal;                                    // 0x04D8   (0x0008)  
	class UBoxComponent*                               FarAttack_HitTouch;                                         // 0x04E0   (0x0008)  
	class UPhysicalAnimationComponent*                 PhysicalAnimations;                                         // 0x04E8   (0x0008)  
	class UArrowComponent*                             AutoAimPlayer;                                              // 0x04F0   (0x0008)  
	class UArrowComponent*                             AttackTraceLoc;                                             // 0x04F8   (0x0008)  
	class UBoxComponent*                               Attack_HitTouch_01;                                         // 0x0500   (0x0008)  
	class UBoxComponent*                               Head_Shot;                                                  // 0x0508   (0x0008)  
	class USphereComponent*                            QYQTouch;                                                   // 0x0510   (0x0008)  
	class UParticleSystemComponent*                    QYQPar;                                                     // 0x0518   (0x0008)  
	class UBoxComponent*                               FootR_Shot;                                                 // 0x0520   (0x0008)  
	class UBoxComponent*                               FootL_Shot;                                                 // 0x0528   (0x0008)  
	class UBoxComponent*                               HandL_Shot;                                                 // 0x0530   (0x0008)  
	class UBoxComponent*                               HandR_Shot;                                                 // 0x0538   (0x0008)  
	class UPointLightComponent*                        HitLight;                                                   // 0x0540   (0x0008)  
	class UParticleSystemComponent*                    XChange_Edms;                                               // 0x0548   (0x0008)  
	class UArrowComponent*                             AirZCombo;                                                  // 0x0550   (0x0008)  
	class UArrowComponent*                             AirZ;                                                       // 0x0558   (0x0008)  
	class UParticleSystemComponent*                    BloodHead;                                                  // 0x0560   (0x0008)  
	class UParticleSystemComponent*                    BloodBody;                                                  // 0x0568   (0x0008)  
	float                                              HitPhy_Weight_AE9D3ECB42466C89898631AD4DBFB101;             // 0x0570   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    HitPhy__Direction_AE9D3ECB42466C89898631AD4DBFB101;         // 0x0574   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0575   (0x0003)  MISSED
	class UTimelineComponent*                          HitPhy;                                                     // 0x0578   (0x0008)  
	float                                              PlayerDistance;                                             // 0x0580   (0x0004)  
	bool                                               IsDead_;                                                    // 0x0584   (0x0001)  
	bool                                               IsFirstLookPlayer;                                          // 0x0585   (0x0001)  
	bool                                               IsSpawn_;                                                   // 0x0586   (0x0001)  
	bool                                               IsFireTime;                                                 // 0x0587   (0x0001)  
	bool                                               IsTouchPlayer;                                              // 0x0588   (0x0001)  
	bool                                               IsHitTime_;                                                 // 0x0589   (0x0001)  
	bool                                               HitShield;                                                  // 0x058A   (0x0001)  
	bool                                               IsAirTime_;                                                 // 0x058B   (0x0001)  
	bool                                               IsShun_;                                                    // 0x058C   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x058D   (0x0003)  MISSED
	float                                              AIHealth;                                                   // 0x0590   (0x0004)  
	int32_t                                            AIMAXHealth;                                                // 0x0594   (0x0004)  
	FName                                              AirTouchBone;                                               // 0x0598   (0x0008)  
	class UPhysicalAnimationComponent*                 PhysicalAnimation;                                          // 0x05A0   (0x0008)  
	bool                                               IsAirAnimFinish_;                                           // 0x05A8   (0x0001)  
	bool                                               CanBoken;                                                   // 0x05A9   (0x0001)  
	bool                                               IsKanJi;                                                    // 0x05AA   (0x0001)  
	unsigned char                                      UnknownData03_6[0x5];                                       // 0x05AB   (0x0005)  MISSED
	class USkeletalMeshComponent*                      RightHand;                                                  // 0x05B0   (0x0008)  
	class USkeletalMeshComponent*                      LeftHand;                                                   // 0x05B8   (0x0008)  
	class USkeletalMeshComponent*                      LeftFoot;                                                   // 0x05C0   (0x0008)  
	class USkeletalMeshComponent*                      RightFoot;                                                  // 0x05C8   (0x0008)  
	class USkeletalMeshComponent*                      head;                                                       // 0x05D0   (0x0008)  
	float                                              Attack_Hit_01;                                              // 0x05D8   (0x0004)  
	bool                                               IsPlayerAirUseQYQ_;                                         // 0x05DC   (0x0001)  
	unsigned char                                      UnknownData04_6[0x3];                                       // 0x05DD   (0x0003)  MISSED
	float                                              SpawnTime;                                                  // 0x05E0   (0x0004)  
	unsigned char                                      UnknownData05_6[0x4];                                       // 0x05E4   (0x0004)  MISSED
	SDK_UNDEFINED(16,970) /* FMulticastInlineDelegate */ __um(AIDEAD);                                             // 0x05E8   (0x0010)  
	bool                                               DFOver_;                                                    // 0x05F8   (0x0001)  
	bool                                               IsFarAttack_;                                               // 0x05F9   (0x0001)  
	unsigned char                                      UnknownData06_6[0x2];                                       // 0x05FA   (0x0002)  MISSED
	float                                              FarAttack_Hit;                                              // 0x05FC   (0x0004)  
	bool                                               StartNewPlayerEvent;                                        // 0x0600   (0x0001)  
	unsigned char                                      UnknownData07_6[0x7];                                       // 0x0601   (0x0007)  MISSED
	class UBMI_NewPlayerTip_BaseUMG_C*                 NewPlayerUI;                                                // 0x0608   (0x0008)  
	bool                                               FinishLightSword;                                           // 0x0610   (0x0001)  


	/// Functions
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.AutoAnimPlayerEvent
	// void AutoAnimPlayerEvent();                                                                                              // [0x148e900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.HitEdm
	// void HitEdm();                                                                                                           // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.HitBlood
	// void HitBlood();                                                                                                         // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.LookAtPlayer
	// void LookAtPlayer();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.HitPhy__FinishedFunc
	// void HitPhy__FinishedFunc();                                                                                             // [0x148e900] BlueprintEvent       
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.HitPhy__UpdateFunc
	// void HitPhy__UpdateFunc();                                                                                               // [0x148e900] BlueprintEvent       
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.OnFail_8717361048AB0F4FF7A233A422C3003F
	// void OnFail_8717361048AB0F4FF7A233A422C3003F(TEnumAsByte<EPathFollowingResult> MovementResult);                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.OnSuccess_8717361048AB0F4FF7A233A422C3003F
	// void OnSuccess_8717361048AB0F4FF7A233A422C3003F(TEnumAsByte<EPathFollowingResult> MovementResult);                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_ShieldHit
	// void Send_ShieldHit();                                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_HuaChan
	// void Send_HuaChan();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_ShieldHitMeleeOrSword
	// void Send_ShieldHitMeleeOrSword(int32_t Hit);                                                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_NearDefu
	// void Send_NearDefu(int32_t FireType);                                                                                    // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_PerfectDefu
	// void Send_PerfectDefu(int32_t FireType);                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_AIBoat
	// void Send_AIBoat(class UPrimitiveComponent* HitBox, float Hit);                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_AIDEFUHealths
	// void Send_AIDEFUHealths(float DEFUHealth, float BloddHealth, bool HaveDefu_);                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_DisPlayAIHealthUI
	// void Send_DisPlayAIHealthUI(bool Vis_);                                                                                  // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_ForceAIHit
	// void Send_ForceAIHit();                                                                                                  // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_BloodHK
	// void Send_BloodHK();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_DefuHK
	// void Send_DefuHK();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_Add_Alerts
	// void Send_Add_Alerts(float DS);                                                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_Dee_Alert
	// void Send_Dee_Alert();                                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_ForwardSeePlayer
	// void Send_ForwardSeePlayer();                                                                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_FootAI_Alert
	// void Send_FootAI_Alert();                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_BackSeePlayer
	// void Send_BackSeePlayer();                                                                                               // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_ShunAI_Alert
	// void Send_ShunAI_Alert();                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_SprintAttack
	// void Send_SprintAttack(float Hit);                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_PlayerHitCarAI
	// void Send_PlayerHitCarAI();                                                                                              // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_PlayerQYQAI
	// void Send_PlayerQYQAI(int32_t Number);                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_GERFire
	// void Send_GERFire();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_HealthUIVis
	// void Send_HealthUIVis();                                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_XuLiMelee
	// void Send_XuLiMelee(float Hit);                                                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_GuLouHand_Hit
	// void Send_GuLouHand_Hit(float Hit);                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x148e900] Event|Protected|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.MoveToPlayer
	// void MoveToPlayer();                                                                                                     // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x148e900] Event|Public|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.NearFire
	// void NearFire();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.ReceiveAnyDamage
	// void ReceiveAnyDamage(float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser); // [0x148e900] BlueprintAuthorityOnly|Event|Public|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.AIHit
	// void AIHit();                                                                                                            // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_HitSword
	// void Send_HitSword(float Hit, int32_t FiretType);                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.-Health
	// void _Health();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_EMP
	// void Send_EMP(float Hit);                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_MeleePower
	// void Send_MeleePower(float Hit);                                                                                         // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_UpLightSword
	// void Send_UpLightSword(float Hit);                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.FallGround
	// void FallGround();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.UpDataAirZ
	// void UpDataAirZ();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.ForceLookPlayer
	// void ForceLookPlayer();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.RestAirZ
	// void RestAirZ();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_KanJi
	// void Send_KanJi(float Hit);                                                                                              // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_ZhaDi
	// void Send_ZhaDi();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.AIHandRShot
	// void AIHandRShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.AIHandLShot
	// void AIHandLShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.BokenHandR
	// void BokenHandR();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.BokenHandL
	// void BokenHandL();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.BokenFootL
	// void BokenFootL();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.AIFootLShot
	// void AIFootLShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.BokenFootR
	// void BokenFootR();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.AIFootRShot
	// void AIFootRShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_AIQYQ
	// void Send_AIQYQ();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.RandomBoken
	// void RandomBoken();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.BokenHead
	// void BokenHead();                                                                                                        // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.AIHeadShot
	// void AIHeadShot();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.BndEvt__Attack_HitTouch_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
	// void BndEvt__Attack_HitTouch_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x148e900] HasOutParms|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Open_Hit01_Event
	// void Open_Hit01_Event();                                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Close_Hit01_Event
	// void Close_Hit01_Event();                                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.AttackTrace
	// void AttackTrace();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.PerfectDefu_HitAnim
	// void PerfectDefu_HitAnim();                                                                                              // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.SpawnZhaDi
	// void SpawnZhaDi();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Send_AIFlyQYQ
	// void Send_AIFlyQYQ();                                                                                                    // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.SpawnFarAttackBP
	// void SpawnFarAttackBP();                                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.SpawnZhaDiBig
	// void SpawnZhaDiBig();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.IsAirUp
	// void IsAirUp();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.BndEvt__FarAttack_HitTouch_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
	// void BndEvt__FarAttack_HitTouch_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x148e900] HasOutParms|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.DFIsBreak
	// void DFIsBreak();                                                                                                        // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.NewPlayer_PerfectDefu
	// void NewPlayer_PerfectDefu();                                                                                            // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Finish_PerFectDefu
	// void Finish_PerFectDefu();                                                                                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.NewPlayer_UpLightSword
	// void NewPlayer_UpLightSword();                                                                                           // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Finish_UpLightSword
	// void Finish_UpLightSword();                                                                                              // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.NewPlayer_LightSword
	// void NewPlayer_LightSword();                                                                                             // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.Finish_LightSword
	// void Finish_LightSword();                                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.AutoAnimNewPlayerIronArmyAI
	// void AutoAnimNewPlayerIronArmyAI();                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.RestAirTraceZ
	// void RestAirTraceZ();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.ExecuteUbergraph_NPC_IronArmy_NewPlayer
	// void ExecuteUbergraph_NPC_IronArmy_NewPlayer(int32_t EntryPoint);                                                        // [0x148e900] Final|HasDefaults    
	// Function /Game/NPC_AIBMI/IronArmy/BP/NPC_IronArmy_NewPlayer.NPC_IronArmy_NewPlayer_C.AIDEAD__DelegateSignature
	// void AIDEAD__DelegateSignature();                                                                                        // [0x148e900] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C
/// Size: 0x05C4 (1476 bytes) (0x0004B8 - 0x0005C4) align 16 MaxSize: 0x05C4
class ANPC_Pig_AI_C : public ACharacter
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x04B8   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x04C0   (0x0008)  
	class UParticleSystemComponent*                    PS_FireSmall;                                               // 0x04C8   (0x0008)  
	class UWidgetComponent*                            HealthAI;                                                   // 0x04D0   (0x0008)  
	class UArrowComponent*                             AirZCombo;                                                  // 0x04D8   (0x0008)  
	class UArrowComponent*                             AutoAimPlayer;                                              // 0x04E0   (0x0008)  
	class UArrowComponent*                             AttackTraceLoc;                                             // 0x04E8   (0x0008)  
	class UBoxComponent*                               Attack_HitTouch_01;                                         // 0x04F0   (0x0008)  
	class UBoxComponent*                               Head_Shot;                                                  // 0x04F8   (0x0008)  
	class UParticleSystemComponent*                    QYQPar;                                                     // 0x0500   (0x0008)  
	class UPointLightComponent*                        HitLight;                                                   // 0x0508   (0x0008)  
	class UPhysicalAnimationComponent*                 PhysicalAnimations;                                         // 0x0510   (0x0008)  
	class UParticleSystemComponent*                    XChange_Edms;                                               // 0x0518   (0x0008)  
	class UArrowComponent*                             LightSwordAirZ;                                             // 0x0520   (0x0008)  
	class UParticleSystemComponent*                    BloodHead;                                                  // 0x0528   (0x0008)  
	class UParticleSystemComponent*                    BloodBody;                                                  // 0x0530   (0x0008)  
	float                                              PlayerDistance;                                             // 0x0538   (0x0004)  
	bool                                               IsDead_;                                                    // 0x053C   (0x0001)  
	bool                                               IsFirstLookPlayer;                                          // 0x053D   (0x0001)  
	bool                                               IsSpawn_;                                                   // 0x053E   (0x0001)  
	bool                                               IsFireTime;                                                 // 0x053F   (0x0001)  
	bool                                               IsTouchPlayer;                                              // 0x0540   (0x0001)  
	bool                                               IsHitTime_;                                                 // 0x0541   (0x0001)  
	bool                                               HitShield;                                                  // 0x0542   (0x0001)  
	bool                                               IsAirTime_;                                                 // 0x0543   (0x0001)  
	bool                                               IsShun_;                                                    // 0x0544   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0545   (0x0003)  MISSED
	float                                              AIHealth;                                                   // 0x0548   (0x0004)  
	float                                              AIMAXHealth;                                                // 0x054C   (0x0004)  
	FName                                              AirTouchBone;                                               // 0x0550   (0x0008)  
	class UPhysicalAnimationComponent*                 PhysicalAnimation;                                          // 0x0558   (0x0008)  
	bool                                               IsAirAnimFinish_;                                           // 0x0560   (0x0001)  
	bool                                               CanBoken;                                                   // 0x0561   (0x0001)  
	bool                                               IsKanJiorEMP;                                               // 0x0562   (0x0001)  
	unsigned char                                      UnknownData02_6[0x5];                                       // 0x0563   (0x0005)  MISSED
	class USkeletalMeshComponent*                      RightHand;                                                  // 0x0568   (0x0008)  
	class USkeletalMeshComponent*                      LeftHand;                                                   // 0x0570   (0x0008)  
	class USkeletalMeshComponent*                      LeftFoot;                                                   // 0x0578   (0x0008)  
	class USkeletalMeshComponent*                      RightFoot;                                                  // 0x0580   (0x0008)  
	class USkeletalMeshComponent*                      head;                                                       // 0x0588   (0x0008)  
	float                                              Attack_HitT_01;                                             // 0x0590   (0x0004)  
	bool                                               IsPlayerAirUseQYQ_;                                         // 0x0594   (0x0001)  
	unsigned char                                      UnknownData03_6[0x3];                                       // 0x0595   (0x0003)  MISSED
	float                                              SpawnTime;                                                  // 0x0598   (0x0004)  
	unsigned char                                      UnknownData04_6[0x4];                                       // 0x059C   (0x0004)  MISSED
	SDK_UNDEFINED(16,971) /* FMulticastInlineDelegate */ __um(AIDEAD);                                             // 0x05A0   (0x0010)  
	FVector                                            EMPAirZ;                                                    // 0x05B0   (0x000C)  
	int32_t                                            AirType;                                                    // 0x05BC   (0x0004)  
	bool                                               IsSprintAttack_;                                            // 0x05C0   (0x0001)  
	bool                                               IsKing_;                                                    // 0x05C1   (0x0001)  
	bool                                               IsEatA_;                                                    // 0x05C2   (0x0001)  
	bool                                               IsEatB_;                                                    // 0x05C3   (0x0001)  


	/// Functions
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.HealthUI_Vis?
	// void HealthUI_Vis_();                                                                                                    // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.ForceLookPlayers
	// void ForceLookPlayers();                                                                                                 // [0x148e900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.HealthUIRotToPlayer
	// void HealthUIRotToPlayer();                                                                                              // [0x148e900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.AirMaterial
	// void AirMaterial();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.AutoAnimPlayerEvent
	// void AutoAnimPlayerEvent();                                                                                              // [0x148e900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.HitEdm
	// void HitEdm();                                                                                                           // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.HitBlood
	// void HitBlood();                                                                                                         // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.LookAtPlayer
	// void LookAtPlayer();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.OnFail_A6B80EBA45DC7365AB4CAEBB46419797
	// void OnFail_A6B80EBA45DC7365AB4CAEBB46419797(TEnumAsByte<EPathFollowingResult> MovementResult);                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.OnSuccess_A6B80EBA45DC7365AB4CAEBB46419797
	// void OnSuccess_A6B80EBA45DC7365AB4CAEBB46419797(TEnumAsByte<EPathFollowingResult> MovementResult);                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.OnFail_192D692D42AC7C10E36F8BA1E4A7FAFD
	// void OnFail_192D692D42AC7C10E36F8BA1E4A7FAFD(TEnumAsByte<EPathFollowingResult> MovementResult);                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.OnSuccess_192D692D42AC7C10E36F8BA1E4A7FAFD
	// void OnSuccess_192D692D42AC7C10E36F8BA1E4A7FAFD(TEnumAsByte<EPathFollowingResult> MovementResult);                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Completed_BDEB670E428CC04F06EDB495DC5F27B0
	// void Completed_BDEB670E428CC04F06EDB495DC5F27B0(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.AIHeadShot
	// void AIHeadShot();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.AIHandRShot
	// void AIHandRShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.AIHandLShot
	// void AIHandLShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.AIFootLShot
	// void AIFootLShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.AIFootRShot
	// void AIFootRShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_ShieldHit
	// void Send_ShieldHit();                                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_HuaChan
	// void Send_HuaChan();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_ShieldHitMeleeOrSword
	// void Send_ShieldHitMeleeOrSword(int32_t Hit);                                                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_NearDefu
	// void Send_NearDefu(int32_t FireType);                                                                                    // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_PerfectDefu
	// void Send_PerfectDefu(int32_t FireType);                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_AIBoat
	// void Send_AIBoat(class UPrimitiveComponent* HitBox, float Hit);                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_AIDEFUHealths
	// void Send_AIDEFUHealths(float DEFUHealth, float BloddHealth, bool HaveDefu_);                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_ForceAIHit
	// void Send_ForceAIHit();                                                                                                  // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_BloodHK
	// void Send_BloodHK();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_DefuHK
	// void Send_DefuHK();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_Add_Alerts
	// void Send_Add_Alerts(float DS);                                                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_Dee_Alert
	// void Send_Dee_Alert();                                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_ForwardSeePlayer
	// void Send_ForwardSeePlayer();                                                                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_FootAI_Alert
	// void Send_FootAI_Alert();                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_BackSeePlayer
	// void Send_BackSeePlayer();                                                                                               // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_ShunAI_Alert
	// void Send_ShunAI_Alert();                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_PlayerHitCarAI
	// void Send_PlayerHitCarAI();                                                                                              // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_PlayerQYQAI
	// void Send_PlayerQYQAI(int32_t Number);                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_GuLouHand_Hit
	// void Send_GuLouHand_Hit(float Hit);                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x148e900] Event|Protected|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.MoveToPlayer
	// void MoveToPlayer();                                                                                                     // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x148e900] Event|Public|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.NearFire
	// void NearFire();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.ReceiveAnyDamage
	// void ReceiveAnyDamage(float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser); // [0x148e900] BlueprintAuthorityOnly|Event|Public|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.AIHit
	// void AIHit();                                                                                                            // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_HitSword
	// void Send_HitSword(float Hit, int32_t FiretType);                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.-Health
	// void _Health();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_MeleePower
	// void Send_MeleePower(float Hit);                                                                                         // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_UpLightSword
	// void Send_UpLightSword(float Hit);                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.ForceLookPlayer
	// void ForceLookPlayer();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_KanJi
	// void Send_KanJi(float Hit);                                                                                              // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_ZhaDi
	// void Send_ZhaDi();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_AIQYQ
	// void Send_AIQYQ();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.BndEvt__Attack_HitTouch_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
	// void BndEvt__Attack_HitTouch_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x148e900] HasOutParms|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Open_Hit01_Event
	// void Open_Hit01_Event();                                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Close_Hit01_Event
	// void Close_Hit01_Event();                                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.AttackTrace
	// void AttackTrace();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.PerfectDefu_HitAnim
	// void PerfectDefu_HitAnim();                                                                                              // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.SpawnZhaDi
	// void SpawnZhaDi();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_AIFlyQYQ
	// void Send_AIFlyQYQ();                                                                                                    // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.UpDataDEFUHealth
	// void UpDataDEFUHealth();                                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_DisPlayAIHealthUI
	// void Send_DisPlayAIHealthUI(bool Vis_);                                                                                  // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_EMP
	// void Send_EMP(float Hit);                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.ForceAir
	// void ForceAir();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_SprintAttack
	// void Send_SprintAttack(float Hit);                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.ForceFindPlayer
	// void ForceFindPlayer();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.ForceDead
	// void ForceDead();                                                                                                        // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_GERFire
	// void Send_GERFire();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Fire-Health
	// void Fire_Health();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.GERFireEvent
	// void GERFireEvent();                                                                                                     // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_HealthUIVis
	// void Send_HealthUIVis();                                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.Send_XuLiMelee
	// void Send_XuLiMelee(float Hit);                                                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.ExecuteUbergraph_NPC_Pig_AI
	// void ExecuteUbergraph_NPC_Pig_AI(int32_t EntryPoint);                                                                    // [0x148e900] Final|HasDefaults    
	// Function /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI.NPC_Pig_AI_C.AIDEAD__DelegateSignature
	// void AIDEAD__DelegateSignature();                                                                                        // [0x148e900] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/NPC_AIBMI/Pig/BP/NPC_Pig_AI_Car.NPC_Pig_AI_Car_C
/// Size: 0x05C4 (1476 bytes) (0x0005C4 - 0x0005C4) align 16 MaxSize: 0x05C4
class ANPC_Pig_AI_Car_C : public ANPC_Pig_AI_C
{ 
public:
};

/// Class /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C
/// Size: 0x05DA (1498 bytes) (0x0004B8 - 0x0005DA) align 16 MaxSize: 0x05DA
class ANPC_RockLion_AI_C : public ACharacter
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x04B8   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x04C0   (0x0008)  
	class USphereComponent*                            Sphere;                                                     // 0x04C8   (0x0008)  
	class UParticleSystemComponent*                    FX_Knight_Back;                                             // 0x04D0   (0x0008)  
	class USphereComponent*                            QYQTouch;                                                   // 0x04D8   (0x0008)  
	class UPointLightComponent*                        BodyLight;                                                  // 0x04E0   (0x0008)  
	class UWidgetComponent*                            HealthAI;                                                   // 0x04E8   (0x0008)  
	class UArrowComponent*                             AirZCombo;                                                  // 0x04F0   (0x0008)  
	class UArrowComponent*                             AutoAimPlayer;                                              // 0x04F8   (0x0008)  
	class UArrowComponent*                             AttackTraceLoc;                                             // 0x0500   (0x0008)  
	class UBoxComponent*                               Attack_HitTouch_01;                                         // 0x0508   (0x0008)  
	class UBoxComponent*                               Head_Shot;                                                  // 0x0510   (0x0008)  
	class UParticleSystemComponent*                    QYQPar;                                                     // 0x0518   (0x0008)  
	class UPointLightComponent*                        HitLight;                                                   // 0x0520   (0x0008)  
	class UPhysicalAnimationComponent*                 PhysicalAnimations;                                         // 0x0528   (0x0008)  
	class UParticleSystemComponent*                    XChange_Edms;                                               // 0x0530   (0x0008)  
	class UArrowComponent*                             LightSwordAirZ;                                             // 0x0538   (0x0008)  
	class UParticleSystemComponent*                    BloodHead;                                                  // 0x0540   (0x0008)  
	class UParticleSystemComponent*                    BloodBody;                                                  // 0x0548   (0x0008)  
	float                                              PlayerDistance;                                             // 0x0550   (0x0004)  
	bool                                               IsDead_;                                                    // 0x0554   (0x0001)  
	bool                                               IsFirstLookPlayer;                                          // 0x0555   (0x0001)  
	bool                                               IsSpawn_;                                                   // 0x0556   (0x0001)  
	bool                                               IsFireTime;                                                 // 0x0557   (0x0001)  
	bool                                               IsTouchPlayer;                                              // 0x0558   (0x0001)  
	bool                                               IsHitTime_;                                                 // 0x0559   (0x0001)  
	bool                                               HitShield;                                                  // 0x055A   (0x0001)  
	bool                                               IsShun_;                                                    // 0x055B   (0x0001)  
	float                                              AIHealth;                                                   // 0x055C   (0x0004)  
	float                                              AIMAXHealth;                                                // 0x0560   (0x0004)  
	FName                                              AirTouchBone;                                               // 0x0564   (0x0008)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x056C   (0x0004)  MISSED
	class UPhysicalAnimationComponent*                 PhysicalAnimation;                                          // 0x0570   (0x0008)  
	bool                                               IsAirAnimFinish_;                                           // 0x0578   (0x0001)  
	bool                                               CanBoken;                                                   // 0x0579   (0x0001)  
	bool                                               IsKanJiorEMP;                                               // 0x057A   (0x0001)  
	unsigned char                                      UnknownData02_6[0x5];                                       // 0x057B   (0x0005)  MISSED
	class USkeletalMeshComponent*                      RightHand;                                                  // 0x0580   (0x0008)  
	class USkeletalMeshComponent*                      LeftHand;                                                   // 0x0588   (0x0008)  
	class USkeletalMeshComponent*                      LeftFoot;                                                   // 0x0590   (0x0008)  
	class USkeletalMeshComponent*                      RightFoot;                                                  // 0x0598   (0x0008)  
	class USkeletalMeshComponent*                      head;                                                       // 0x05A0   (0x0008)  
	float                                              Attack_HitT_01;                                             // 0x05A8   (0x0004)  
	bool                                               IsPlayerAirUseQYQ_;                                         // 0x05AC   (0x0001)  
	unsigned char                                      UnknownData03_6[0x3];                                       // 0x05AD   (0x0003)  MISSED
	float                                              SpawnTime;                                                  // 0x05B0   (0x0004)  
	unsigned char                                      UnknownData04_6[0x4];                                       // 0x05B4   (0x0004)  MISSED
	SDK_UNDEFINED(16,972) /* FMulticastInlineDelegate */ __um(AIDEAD);                                             // 0x05B8   (0x0010)  
	FVector                                            EMPAirZ;                                                    // 0x05C8   (0x000C)  
	int32_t                                            AirType;                                                    // 0x05D4   (0x0004)  
	bool                                               IsSprintAttack_;                                            // 0x05D8   (0x0001)  
	bool                                               TypeA_;                                                     // 0x05D9   (0x0001)  


	/// Functions
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.HealthUI_Vis?
	// void HealthUI_Vis_();                                                                                                    // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.ForceLookPlayers
	// void ForceLookPlayers();                                                                                                 // [0x148e900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.HealthUIRotToPlayer
	// void HealthUIRotToPlayer();                                                                                              // [0x148e900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.AirMaterial
	// void AirMaterial();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.AutoAnimPlayerEvent
	// void AutoAnimPlayerEvent();                                                                                              // [0x148e900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.HitEdm
	// void HitEdm();                                                                                                           // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.HitBlood
	// void HitBlood();                                                                                                         // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.LookAtPlayer
	// void LookAtPlayer();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.OnFail_B455AEFA4D1529DE7C3DA0A1A678D706
	// void OnFail_B455AEFA4D1529DE7C3DA0A1A678D706(TEnumAsByte<EPathFollowingResult> MovementResult);                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.OnSuccess_B455AEFA4D1529DE7C3DA0A1A678D706
	// void OnSuccess_B455AEFA4D1529DE7C3DA0A1A678D706(TEnumAsByte<EPathFollowingResult> MovementResult);                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Completed_1C415C3E4C12DC2CAA33329B64E4F281
	// void Completed_1C415C3E4C12DC2CAA33329B64E4F281(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.AIHeadShot
	// void AIHeadShot();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.AIHandRShot
	// void AIHandRShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.AIHandLShot
	// void AIHandLShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.AIFootLShot
	// void AIFootLShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.AIFootRShot
	// void AIFootRShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_ShieldHit
	// void Send_ShieldHit();                                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_HuaChan
	// void Send_HuaChan();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_ShieldHitMeleeOrSword
	// void Send_ShieldHitMeleeOrSword(int32_t Hit);                                                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_NearDefu
	// void Send_NearDefu(int32_t FireType);                                                                                    // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_PerfectDefu
	// void Send_PerfectDefu(int32_t FireType);                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_AIBoat
	// void Send_AIBoat(class UPrimitiveComponent* HitBox, float Hit);                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_AIDEFUHealths
	// void Send_AIDEFUHealths(float DEFUHealth, float BloddHealth, bool HaveDefu_);                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_ForceAIHit
	// void Send_ForceAIHit();                                                                                                  // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_BloodHK
	// void Send_BloodHK();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_DefuHK
	// void Send_DefuHK();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_Add_Alerts
	// void Send_Add_Alerts(float DS);                                                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_Dee_Alert
	// void Send_Dee_Alert();                                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_ForwardSeePlayer
	// void Send_ForwardSeePlayer();                                                                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_FootAI_Alert
	// void Send_FootAI_Alert();                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_BackSeePlayer
	// void Send_BackSeePlayer();                                                                                               // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_ShunAI_Alert
	// void Send_ShunAI_Alert();                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_PlayerHitCarAI
	// void Send_PlayerHitCarAI();                                                                                              // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_PlayerQYQAI
	// void Send_PlayerQYQAI(int32_t Number);                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_GuLouHand_Hit
	// void Send_GuLouHand_Hit(float Hit);                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x148e900] Event|Protected|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.MoveToPlayer
	// void MoveToPlayer();                                                                                                     // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x148e900] Event|Public|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.NearFire
	// void NearFire();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.AIHit
	// void AIHit();                                                                                                            // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_HitSword
	// void Send_HitSword(float Hit, int32_t FiretType);                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.-Health
	// void _Health();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_MeleePower
	// void Send_MeleePower(float Hit);                                                                                         // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_UpLightSword
	// void Send_UpLightSword(float Hit);                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.ForceLookPlayer
	// void ForceLookPlayer();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_KanJi
	// void Send_KanJi(float Hit);                                                                                              // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_ZhaDi
	// void Send_ZhaDi();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_AIQYQ
	// void Send_AIQYQ();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.BndEvt__Attack_HitTouch_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
	// void BndEvt__Attack_HitTouch_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x148e900] HasOutParms|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Open_Hit01_Event
	// void Open_Hit01_Event();                                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Close_Hit01_Event
	// void Close_Hit01_Event();                                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.AttackTrace
	// void AttackTrace();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.PerfectDefu_HitAnim
	// void PerfectDefu_HitAnim();                                                                                              // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.SpawnZhaDi
	// void SpawnZhaDi();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_AIFlyQYQ
	// void Send_AIFlyQYQ();                                                                                                    // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.UpDataDEFUHealth
	// void UpDataDEFUHealth();                                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_DisPlayAIHealthUI
	// void Send_DisPlayAIHealthUI(bool Vis_);                                                                                  // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_EMP
	// void Send_EMP(float Hit);                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.ForceAir
	// void ForceAir();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_SprintAttack
	// void Send_SprintAttack(float Hit);                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.ForceDead
	// void ForceDead();                                                                                                        // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.ReceiveAnyDamage
	// void ReceiveAnyDamage(float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser); // [0x148e900] BlueprintAuthorityOnly|Event|Public|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_GERFire
	// void Send_GERFire();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.TickRadialForce
	// void TickRadialForce();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.BndEvt__NPC_RockLion_AI_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
	// void BndEvt__NPC_RockLion_AI_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x148e900] HasOutParms|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_HealthUIVis
	// void Send_HealthUIVis();                                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.Send_XuLiMelee
	// void Send_XuLiMelee(float Hit);                                                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.ExecuteUbergraph_NPC_RockLion_AI
	// void ExecuteUbergraph_NPC_RockLion_AI(int32_t EntryPoint);                                                               // [0x148e900] Final|HasDefaults    
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI.NPC_RockLion_AI_C.AIDEAD__DelegateSignature
	// void AIDEAD__DelegateSignature();                                                                                        // [0x148e900] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C
/// Size: 0x05E1 (1505 bytes) (0x0004B8 - 0x0005E1) align 16 MaxSize: 0x05E1
class ANPC_RockLion_AI2_C : public ACharacter
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x04B8   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x04C0   (0x0008)  
	class UArrowComponent*                             FarFireAutoAnimPlayer;                                      // 0x04C8   (0x0008)  
	class USphereComponent*                            Sphere;                                                     // 0x04D0   (0x0008)  
	class UParticleSystemComponent*                    FX_Knight_Back;                                             // 0x04D8   (0x0008)  
	class USphereComponent*                            QYQTouch;                                                   // 0x04E0   (0x0008)  
	class UPointLightComponent*                        BodyLight;                                                  // 0x04E8   (0x0008)  
	class UWidgetComponent*                            HealthAI;                                                   // 0x04F0   (0x0008)  
	class UArrowComponent*                             AirZCombo;                                                  // 0x04F8   (0x0008)  
	class UArrowComponent*                             AutoAimPlayer;                                              // 0x0500   (0x0008)  
	class UArrowComponent*                             AttackTraceLoc;                                             // 0x0508   (0x0008)  
	class UBoxComponent*                               Attack_HitTouch_01;                                         // 0x0510   (0x0008)  
	class UBoxComponent*                               Head_Shot;                                                  // 0x0518   (0x0008)  
	class UParticleSystemComponent*                    QYQPar;                                                     // 0x0520   (0x0008)  
	class UPointLightComponent*                        HitLight;                                                   // 0x0528   (0x0008)  
	class UPhysicalAnimationComponent*                 PhysicalAnimations;                                         // 0x0530   (0x0008)  
	class UParticleSystemComponent*                    XChange_Edms;                                               // 0x0538   (0x0008)  
	class UArrowComponent*                             LightSwordAirZ;                                             // 0x0540   (0x0008)  
	class UParticleSystemComponent*                    BloodHead;                                                  // 0x0548   (0x0008)  
	class UParticleSystemComponent*                    BloodBody;                                                  // 0x0550   (0x0008)  
	float                                              PlayerDistance;                                             // 0x0558   (0x0004)  
	bool                                               IsDead_;                                                    // 0x055C   (0x0001)  
	bool                                               IsFirstLookPlayer;                                          // 0x055D   (0x0001)  
	bool                                               IsSpawn_;                                                   // 0x055E   (0x0001)  
	bool                                               IsFireTime;                                                 // 0x055F   (0x0001)  
	bool                                               IsTouchPlayer;                                              // 0x0560   (0x0001)  
	bool                                               IsHitTime_;                                                 // 0x0561   (0x0001)  
	bool                                               HitShield;                                                  // 0x0562   (0x0001)  
	bool                                               IsShun_;                                                    // 0x0563   (0x0001)  
	float                                              AIHealth;                                                   // 0x0564   (0x0004)  
	float                                              AIMAXHealth;                                                // 0x0568   (0x0004)  
	FName                                              AirTouchBone;                                               // 0x056C   (0x0008)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0574   (0x0004)  MISSED
	class UPhysicalAnimationComponent*                 PhysicalAnimation;                                          // 0x0578   (0x0008)  
	bool                                               IsAirAnimFinish_;                                           // 0x0580   (0x0001)  
	bool                                               CanBoken;                                                   // 0x0581   (0x0001)  
	bool                                               IsKanJiorEMP;                                               // 0x0582   (0x0001)  
	unsigned char                                      UnknownData02_6[0x5];                                       // 0x0583   (0x0005)  MISSED
	class USkeletalMeshComponent*                      RightHand;                                                  // 0x0588   (0x0008)  
	class USkeletalMeshComponent*                      LeftHand;                                                   // 0x0590   (0x0008)  
	class USkeletalMeshComponent*                      LeftFoot;                                                   // 0x0598   (0x0008)  
	class USkeletalMeshComponent*                      RightFoot;                                                  // 0x05A0   (0x0008)  
	class USkeletalMeshComponent*                      head;                                                       // 0x05A8   (0x0008)  
	float                                              Attack_HitT_01;                                             // 0x05B0   (0x0004)  
	bool                                               IsPlayerAirUseQYQ_;                                         // 0x05B4   (0x0001)  
	unsigned char                                      UnknownData03_6[0x3];                                       // 0x05B5   (0x0003)  MISSED
	float                                              SpawnTime;                                                  // 0x05B8   (0x0004)  
	unsigned char                                      UnknownData04_6[0x4];                                       // 0x05BC   (0x0004)  MISSED
	SDK_UNDEFINED(16,973) /* FMulticastInlineDelegate */ __um(AIDEAD);                                             // 0x05C0   (0x0010)  
	FVector                                            EMPAirZ;                                                    // 0x05D0   (0x000C)  
	int32_t                                            AirType;                                                    // 0x05DC   (0x0004)  
	bool                                               IsSprintAttack_;                                            // 0x05E0   (0x0001)  


	/// Functions
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.HealthUI_Vis?
	// void HealthUI_Vis_();                                                                                                    // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.ForceLookPlayers
	// void ForceLookPlayers();                                                                                                 // [0x148e900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.HealthUIRotToPlayer
	// void HealthUIRotToPlayer();                                                                                              // [0x148e900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.AirMaterial
	// void AirMaterial();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.AutoAnimPlayerEvent
	// void AutoAnimPlayerEvent();                                                                                              // [0x148e900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.HitEdm
	// void HitEdm();                                                                                                           // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.HitBlood
	// void HitBlood();                                                                                                         // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.LookAtPlayer
	// void LookAtPlayer();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.OnFail_E226D72E4FAF6F4F2D76EE8F9DCB75A5
	// void OnFail_E226D72E4FAF6F4F2D76EE8F9DCB75A5(TEnumAsByte<EPathFollowingResult> MovementResult);                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.OnSuccess_E226D72E4FAF6F4F2D76EE8F9DCB75A5
	// void OnSuccess_E226D72E4FAF6F4F2D76EE8F9DCB75A5(TEnumAsByte<EPathFollowingResult> MovementResult);                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Completed_5D90792B4D3B75F43F4380A230C06345
	// void Completed_5D90792B4D3B75F43F4380A230C06345(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.AIHeadShot
	// void AIHeadShot();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.AIHandRShot
	// void AIHandRShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.AIHandLShot
	// void AIHandLShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.AIFootLShot
	// void AIFootLShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.AIFootRShot
	// void AIFootRShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_ShieldHit
	// void Send_ShieldHit();                                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_HuaChan
	// void Send_HuaChan();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_ShieldHitMeleeOrSword
	// void Send_ShieldHitMeleeOrSword(int32_t Hit);                                                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_NearDefu
	// void Send_NearDefu(int32_t FireType);                                                                                    // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_PerfectDefu
	// void Send_PerfectDefu(int32_t FireType);                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_AIBoat
	// void Send_AIBoat(class UPrimitiveComponent* HitBox, float Hit);                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_AIDEFUHealths
	// void Send_AIDEFUHealths(float DEFUHealth, float BloddHealth, bool HaveDefu_);                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_ForceAIHit
	// void Send_ForceAIHit();                                                                                                  // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_BloodHK
	// void Send_BloodHK();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_DefuHK
	// void Send_DefuHK();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_Add_Alerts
	// void Send_Add_Alerts(float DS);                                                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_Dee_Alert
	// void Send_Dee_Alert();                                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_ForwardSeePlayer
	// void Send_ForwardSeePlayer();                                                                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_FootAI_Alert
	// void Send_FootAI_Alert();                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_BackSeePlayer
	// void Send_BackSeePlayer();                                                                                               // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_ShunAI_Alert
	// void Send_ShunAI_Alert();                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_PlayerHitCarAI
	// void Send_PlayerHitCarAI();                                                                                              // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_PlayerQYQAI
	// void Send_PlayerQYQAI(int32_t Number);                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_GuLouHand_Hit
	// void Send_GuLouHand_Hit(float Hit);                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x148e900] Event|Protected|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.MoveToPlayer
	// void MoveToPlayer();                                                                                                     // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x148e900] Event|Public|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.NearFire
	// void NearFire();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.AIHit
	// void AIHit();                                                                                                            // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_HitSword
	// void Send_HitSword(float Hit, int32_t FiretType);                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.-Health
	// void _Health();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_MeleePower
	// void Send_MeleePower(float Hit);                                                                                         // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_UpLightSword
	// void Send_UpLightSword(float Hit);                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.ForceLookPlayer
	// void ForceLookPlayer();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_KanJi
	// void Send_KanJi(float Hit);                                                                                              // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_ZhaDi
	// void Send_ZhaDi();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_AIQYQ
	// void Send_AIQYQ();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.BndEvt__Attack_HitTouch_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
	// void BndEvt__Attack_HitTouch_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x148e900] HasOutParms|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Open_Hit01_Event
	// void Open_Hit01_Event();                                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Close_Hit01_Event
	// void Close_Hit01_Event();                                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.AttackTrace
	// void AttackTrace();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.PerfectDefu_HitAnim
	// void PerfectDefu_HitAnim();                                                                                              // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.SpawnZhaDi
	// void SpawnZhaDi();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_AIFlyQYQ
	// void Send_AIFlyQYQ();                                                                                                    // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.UpDataDEFUHealth
	// void UpDataDEFUHealth();                                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_DisPlayAIHealthUI
	// void Send_DisPlayAIHealthUI(bool Vis_);                                                                                  // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_EMP
	// void Send_EMP(float Hit);                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.ForceAir
	// void ForceAir();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_SprintAttack
	// void Send_SprintAttack(float Hit);                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.ForceDead
	// void ForceDead();                                                                                                        // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.ReceiveAnyDamage
	// void ReceiveAnyDamage(float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser); // [0x148e900] BlueprintAuthorityOnly|Event|Public|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_GERFire
	// void Send_GERFire();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.TickRadialForce
	// void TickRadialForce();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.BndEvt__NPC_RockLion_AI_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
	// void BndEvt__NPC_RockLion_AI_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x148e900] HasOutParms|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_HealthUIVis
	// void Send_HealthUIVis();                                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.Send_XuLiMelee
	// void Send_XuLiMelee(float Hit);                                                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.FarFire
	// void FarFire();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.FarFireEvent
	// void FarFireEvent();                                                                                                     // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.RestFire
	// void RestFire();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.ExecuteUbergraph_NPC_RockLion_AI2
	// void ExecuteUbergraph_NPC_RockLion_AI2(int32_t EntryPoint);                                                              // [0x148e900] Final|HasDefaults    
	// Function /Game/NPC_AIBMI/RockLion/BP/NPC_RockLion_AI2.NPC_RockLion_AI2_C.AIDEAD__DelegateSignature
	// void AIDEAD__DelegateSignature();                                                                                        // [0x148e900] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C
/// Size: 0x06CA (1738 bytes) (0x0004B8 - 0x0006CA) align 16 MaxSize: 0x06CA
class ANPC_SiMiao_AI_C : public ACharacter
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x04B8   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x04C0   (0x0008)  
	class UAudioComponent*                             Audio_ChaoFeng;                                             // 0x04C8   (0x0008)  
	class UAudioComponent*                             Audio_HitGround;                                            // 0x04D0   (0x0008)  
	class UParticleSystemComponent*                    PS_FireSmall;                                               // 0x04D8   (0x0008)  
	class UParticleSystemComponent*                    SiMiao_Teleport_TuoWei;                                     // 0x04E0   (0x0008)  
	class UParticleSystemComponent*                    SiMiao_Teleport;                                            // 0x04E8   (0x0008)  
	class UArrowComponent*                             TelePortC;                                                  // 0x04F0   (0x0008)  
	class UArrowComponent*                             TelePortB;                                                  // 0x04F8   (0x0008)  
	class UArrowComponent*                             TelePortA;                                                  // 0x0500   (0x0008)  
	class UWidgetComponent*                            ChuJueUI;                                                   // 0x0508   (0x0008)  
	class UParticleSystemComponent*                    AirEdm;                                                     // 0x0510   (0x0008)  
	class USphereComponent*                            ChuJueArea;                                                 // 0x0518   (0x0008)  
	class UStaticMeshComponent*                        NPC_BMI_SiMiaoBossHeadKui;                                  // 0x0520   (0x0008)  
	class UParticleSystemComponent*                    M_explosionSpark_Normal;                                    // 0x0528   (0x0008)  
	class UBoxComponent*                               Attack_HitTouch_02;                                         // 0x0530   (0x0008)  
	class UParticleSystemComponent*                    SiMiao_WPFire;                                              // 0x0538   (0x0008)  
	class UArrowComponent*                             FarFireLoc;                                                 // 0x0540   (0x0008)  
	class UPointLightComponent*                        BodyLight;                                                  // 0x0548   (0x0008)  
	class UPointLightComponent*                        FireParLight;                                               // 0x0550   (0x0008)  
	class UArrowComponent*                             AirZCombo;                                                  // 0x0558   (0x0008)  
	class UParticleSystemComponent*                    DeadPar;                                                    // 0x0560   (0x0008)  
	class UArrowComponent*                             AutoAimPlayer;                                              // 0x0568   (0x0008)  
	class UParticleSystemComponent*                    WeaponFire;                                                 // 0x0570   (0x0008)  
	class UArrowComponent*                             AttackTraceLoc;                                             // 0x0578   (0x0008)  
	class UBoxComponent*                               Attack_HitTouch_01;                                         // 0x0580   (0x0008)  
	class UBoxComponent*                               Head_Shot;                                                  // 0x0588   (0x0008)  
	class USphereComponent*                            QYQTouch;                                                   // 0x0590   (0x0008)  
	class UParticleSystemComponent*                    QYQPar;                                                     // 0x0598   (0x0008)  
	class UProceduralMeshComponent*                    ProceduralMesh;                                             // 0x05A0   (0x0008)  
	class UPointLightComponent*                        HitLight;                                                   // 0x05A8   (0x0008)  
	class UPhysicalAnimationComponent*                 PhysicalAnimations;                                         // 0x05B0   (0x0008)  
	class UParticleSystemComponent*                    XChange_Edms;                                               // 0x05B8   (0x0008)  
	class UArrowComponent*                             LightSwordAirZ;                                             // 0x05C0   (0x0008)  
	class UParticleSystemComponent*                    BloodHead;                                                  // 0x05C8   (0x0008)  
	class UParticleSystemComponent*                    BloodBody;                                                  // 0x05D0   (0x0008)  
	class UStaticMeshComponent*                        NPC_WarriorWeapon;                                          // 0x05D8   (0x0008)  
	float                                              Timeline_0_Weight_05C6B793441A0B275920FD9669F24EB8;         // 0x05E0   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline_0__Direction_05C6B793441A0B275920FD9669F24EB8;     // 0x05E4   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x05E5   (0x0003)  MISSED
	class UTimelineComponent*                          Timeline;                                                   // 0x05E8   (0x0008)  
	float                                              PlayerDistance;                                             // 0x05F0   (0x0004)  
	bool                                               IsDead_;                                                    // 0x05F4   (0x0001)  
	bool                                               IsFirstLookPlayer;                                          // 0x05F5   (0x0001)  
	bool                                               IsSpawn_;                                                   // 0x05F6   (0x0001)  
	bool                                               IsFireTime;                                                 // 0x05F7   (0x0001)  
	bool                                               IsTouchPlayer;                                              // 0x05F8   (0x0001)  
	bool                                               IsHitTime_;                                                 // 0x05F9   (0x0001)  
	bool                                               IsAirTime_;                                                 // 0x05FA   (0x0001)  
	bool                                               IsShun_;                                                    // 0x05FB   (0x0001)  
	float                                              AIHealth;                                                   // 0x05FC   (0x0004)  
	int32_t                                            ShieldHealth;                                               // 0x0600   (0x0004)  
	float                                              AIMAXHealth;                                                // 0x0604   (0x0004)  
	FName                                              AirTouchBone;                                               // 0x0608   (0x0008)  
	class UPhysicalAnimationComponent*                 PhysicalAnimation;                                          // 0x0610   (0x0008)  
	bool                                               IsAirAnimFinish_;                                           // 0x0618   (0x0001)  
	bool                                               CanBoken;                                                   // 0x0619   (0x0001)  
	bool                                               IsKanJiorEMP;                                               // 0x061A   (0x0001)  
	unsigned char                                      UnknownData02_6[0x5];                                       // 0x061B   (0x0005)  MISSED
	class USkeletalMeshComponent*                      RightHand;                                                  // 0x0620   (0x0008)  
	class USkeletalMeshComponent*                      LeftHand;                                                   // 0x0628   (0x0008)  
	class USkeletalMeshComponent*                      LeftFoot;                                                   // 0x0630   (0x0008)  
	class USkeletalMeshComponent*                      RightFoot;                                                  // 0x0638   (0x0008)  
	class USkeletalMeshComponent*                      head;                                                       // 0x0640   (0x0008)  
	float                                              Attack_HitT_01;                                             // 0x0648   (0x0004)  
	bool                                               IsPlayerAirUseQYQ_;                                         // 0x064C   (0x0001)  
	bool                                               IsHaveShield_;                                              // 0x064D   (0x0001)  
	unsigned char                                      UnknownData03_6[0x2];                                       // 0x064E   (0x0002)  MISSED
	float                                              SpawnTime;                                                  // 0x0650   (0x0004)  
	bool                                               IsSequencePlay_;                                            // 0x0654   (0x0001)  
	unsigned char                                      UnknownData04_6[0x3];                                       // 0x0655   (0x0003)  MISSED
	FVector                                            WeaponHandIK;                                               // 0x0658   (0x000C)  
	bool                                               IsMeleeTime;                                                // 0x0664   (0x0001)  
	bool                                               BaTi_;                                                      // 0x0665   (0x0001)  
	bool                                               DFHave_;                                                    // 0x0666   (0x0001)  
	unsigned char                                      UnknownData05_6[0x1];                                       // 0x0667   (0x0001)  MISSED
	float                                              DEFU_UIProgress;                                            // 0x0668   (0x0004)  
	float                                              NOWDEFUHealth;                                              // 0x066C   (0x0004)  
	float                                              PerfectDefu_DEFUHealth;                                     // 0x0670   (0x0004)  
	float                                              MAXDEFUHealth;                                              // 0x0674   (0x0004)  
	float                                              RestDEFUTime;                                               // 0x0678   (0x0004)  
	bool                                               IsAirTraceGround;                                           // 0x067C   (0x0001)  
	bool                                               IsAirMelee_;                                                // 0x067D   (0x0001)  
	unsigned char                                      UnknownData06_6[0x2];                                       // 0x067E   (0x0002)  MISSED
	SDK_UNDEFINED(16,974) /* FMulticastInlineDelegate */ __um(AITelePortAttack);                                   // 0x0680   (0x0010)  
	int32_t                                            AirType;                                                    // 0x0690   (0x0004)  
	bool                                               IsChueJueArea_;                                             // 0x0694   (0x0001)  
	bool                                               PartTimeNoAirs;                                             // 0x0695   (0x0001)  
	bool                                               IsSprintAttack_;                                            // 0x0696   (0x0001)  
	bool                                               FinalBossFighting_;                                         // 0x0697   (0x0001)  
	SDK_UNDEFINED(16,975) /* FMulticastInlineDelegate */ __um(PlaySecordSequence);                                 // 0x0698   (0x0010)  
	bool                                               IsTelePort_;                                                // 0x06A8   (0x0001)  
	unsigned char                                      UnknownData07_6[0x3];                                       // 0x06A9   (0x0003)  MISSED
	int32_t                                            PerfactDefu_Number;                                         // 0x06AC   (0x0004)  
	class UAIBossHealth_UMG_C*                         BossHealthUI;                                               // 0x06B0   (0x0008)  
	SDK_UNDEFINED(16,976) /* FMulticastInlineDelegate */ __um(OneKill);                                            // 0x06B8   (0x0010)  
	bool                                               ChaoFengSoundPlay_;                                         // 0x06C8   (0x0001)  
	bool                                               BeginTalkFinish_;                                           // 0x06C9   (0x0001)  


	/// Functions
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.TraceTelePortWall
	// void TraceTelePortWall();                                                                                                // [0x148e900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.TraceWall
	// void TraceWall();                                                                                                        // [0x148e900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.AirMaterial
	// void AirMaterial();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.AutoAnimPlayerEvent
	// void AutoAnimPlayerEvent();                                                                                              // [0x148e900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.HitBlood
	// void HitBlood();                                                                                                         // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.HitEdm
	// void HitEdm();                                                                                                           // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.LookAtPlayer
	// void LookAtPlayer();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Timeline_0__FinishedFunc
	// void Timeline_0__FinishedFunc();                                                                                         // [0x148e900] BlueprintEvent       
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Timeline_0__UpdateFunc
	// void Timeline_0__UpdateFunc();                                                                                           // [0x148e900] BlueprintEvent       
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.OnFail_184594FB40D7429BF49425BF5FBCF836
	// void OnFail_184594FB40D7429BF49425BF5FBCF836(TEnumAsByte<EPathFollowingResult> MovementResult);                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.OnSuccess_184594FB40D7429BF49425BF5FBCF836
	// void OnSuccess_184594FB40D7429BF49425BF5FBCF836(TEnumAsByte<EPathFollowingResult> MovementResult);                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Completed_60EACDFF419C285CC1A1349B406E5ADE
	// void Completed_60EACDFF419C285CC1A1349B406E5ADE(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.OnFailure_5E17B8B04182C724B6A24290CDEFDC72
	// void OnFailure_5E17B8B04182C724B6A24290CDEFDC72(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.OnSuccess_5E17B8B04182C724B6A24290CDEFDC72
	// void OnSuccess_5E17B8B04182C724B6A24290CDEFDC72(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.OnFailure_0EDF36684FA099D432C56393409D6D27
	// void OnFailure_0EDF36684FA099D432C56393409D6D27();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.OnSuccess_0EDF36684FA099D432C56393409D6D27
	// void OnSuccess_0EDF36684FA099D432C56393409D6D27();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.OnFailure_DCE138BA4933D27AEF7839B3C2061389
	// void OnFailure_DCE138BA4933D27AEF7839B3C2061389(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.OnSuccess_DCE138BA4933D27AEF7839B3C2061389
	// void OnSuccess_DCE138BA4933D27AEF7839B3C2061389(FName WrittenAchievementName, float WrittenProgress, int32_t WrittenUserTag); // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.OnFailure_227BB3A849C78D13A2049DA5D402565D
	// void OnFailure_227BB3A849C78D13A2049DA5D402565D();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.OnSuccess_227BB3A849C78D13A2049DA5D402565D
	// void OnSuccess_227BB3A849C78D13A2049DA5D402565D();                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.AIHeadShot
	// void AIHeadShot();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.AIHandRShot
	// void AIHandRShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.AIHandLShot
	// void AIHandLShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.AIFootLShot
	// void AIFootLShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.AIFootRShot
	// void AIFootRShot();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_ShieldHit
	// void Send_ShieldHit();                                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_ShieldHitMeleeOrSword
	// void Send_ShieldHitMeleeOrSword(int32_t Hit);                                                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_NearDefu
	// void Send_NearDefu(int32_t FireType);                                                                                    // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_PerfectDefu
	// void Send_PerfectDefu(int32_t FireType);                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_AIBoat
	// void Send_AIBoat(class UPrimitiveComponent* HitBox, float Hit);                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_AIDEFUHealths
	// void Send_AIDEFUHealths(float DEFUHealth, float BloddHealth, bool HaveDefu_);                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_BloodHK
	// void Send_BloodHK();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_DefuHK
	// void Send_DefuHK();                                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_Add_Alerts
	// void Send_Add_Alerts(float DS);                                                                                          // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_Dee_Alert
	// void Send_Dee_Alert();                                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_ForwardSeePlayer
	// void Send_ForwardSeePlayer();                                                                                            // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_FootAI_Alert
	// void Send_FootAI_Alert();                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_BackSeePlayer
	// void Send_BackSeePlayer();                                                                                               // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_ShunAI_Alert
	// void Send_ShunAI_Alert();                                                                                                // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_PlayerHitCarAI
	// void Send_PlayerHitCarAI();                                                                                              // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_PlayerQYQAI
	// void Send_PlayerQYQAI(int32_t Number);                                                                                   // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_HealthUIVis
	// void Send_HealthUIVis();                                                                                                 // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_GuLouHand_Hit
	// void Send_GuLouHand_Hit(float Hit);                                                                                      // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x148e900] Event|Protected|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.MoveToPlayer
	// void MoveToPlayer();                                                                                                     // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.LeftMove
	// void LeftMove();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.RightMove
	// void RightMove();                                                                                                        // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x148e900] Event|Public|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.FarFire
	// void FarFire();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.NearFire
	// void NearFire();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.RestLDMove
	// void RestLDMove();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.ShunLeft
	// void ShunLeft();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.ShunRight
	// void ShunRight();                                                                                                        // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.ShunBack
	// void ShunBack();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.ReceiveAnyDamage
	// void ReceiveAnyDamage(float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser); // [0x148e900] BlueprintAuthorityOnly|Event|Public|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.AIHit
	// void AIHit();                                                                                                            // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_HitSword
	// void Send_HitSword(float Hit, int32_t FiretType);                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.-Health
	// void _Health();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_MeleePower
	// void Send_MeleePower(float Hit);                                                                                         // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_UpLightSword
	// void Send_UpLightSword(float Hit);                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.FallGround
	// void FallGround();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.UpDataAirZ
	// void UpDataAirZ();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_HuaChan
	// void Send_HuaChan();                                                                                                     // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.ForceLookPlayer
	// void ForceLookPlayer();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_KanJi
	// void Send_KanJi(float Hit);                                                                                              // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_ZhaDi
	// void Send_ZhaDi();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_AIQYQ
	// void Send_AIQYQ();                                                                                                       // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.BndEvt__Attack_HitTouch_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
	// void BndEvt__Attack_HitTouch_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x148e900] HasOutParms|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Open_Hit01_Event
	// void Open_Hit01_Event();                                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Close_Hit01_Event
	// void Close_Hit01_Event();                                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.AttackTrace
	// void AttackTrace();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.PerfectDefu_HitAnim
	// void PerfectDefu_HitAnim();                                                                                              // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.SpawnFarAttackBP
	// void SpawnFarAttackBP();                                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.SpawnZhaDi
	// void SpawnZhaDi();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_AIFlyQYQ
	// void Send_AIFlyQYQ();                                                                                                    // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.IsAirUp
	// void IsAirUp();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.ShunForward
	// void ShunForward();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.DefuPerfectPlayer
	// void DefuPerfectPlayer();                                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.SPFire
	// void SPFire();                                                                                                           // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.DefuAmmo
	// void DefuAmmo();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.UpDataDEFUHealth
	// void UpDataDEFUHealth();                                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.RestDEFUONAnim
	// void RestDEFUONAnim();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_DisPlayAIHealthUI
	// void Send_DisPlayAIHealthUI(bool Vis_);                                                                                  // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.ForceDEFUAnim
	// void ForceDEFUAnim();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.SpawnFarAttackBP2
	// void SpawnFarAttackBP2();                                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.SpawnFarAttackBP3
	// void SpawnFarAttackBP3();                                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_ForceAIHit
	// void Send_ForceAIHit();                                                                                                  // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Open_Hit02_Event
	// void Open_Hit02_Event();                                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Close_Hit02_Event
	// void Close_Hit02_Event();                                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.BndEvt__Attack_HitTouch_02_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature
	// void BndEvt__Attack_HitTouch_02_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x148e900] HasOutParms|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.ForceAirOff
	// void ForceAirOff();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.TelePortHouse
	// void TelePortHouse();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/NPC_AIBMI/SiMiaoBoss/BP/NPC_SiMiao_AI.NPC_SiMiao_AI_C.Send_EMP
