
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: CoreUObject
/// dependency: Engine
/// dependency: LevelSequence
/// dependency: UISystem_BMI

#pragma pack(push, 0x1)

/// Class /Game/Sequence/BMI/Level1/Moon/Moon_ActiveEngine.SequenceDirector_C
/// Size: 0x0038 (56 bytes) (0x000030 - 0x000038) align 8 MaxSize: 0x0038
class USequenceDirector_C : public ULevelSequenceDirector
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0030   (0x0008)  


	/// Functions
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_ActiveEngine.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector
	// void SequenceEvent__ENTRYPOINTSequenceDirector();                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_ActiveEngine.SequenceDirector_C.Completed_FEA6EC4E49DCB71F62863AA170AAEDFE
	// void Completed_FEA6EC4E49DCB71F62863AA170AAEDFE(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_ActiveEngine.SequenceDirector_C.Completed_BB35384546F889D62FD7108C9CBABEF8
	// void Completed_BB35384546F889D62FD7108C9CBABEF8(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_ActiveEngine.SequenceDirector_C.Completed_F736E1114B0A137F461A099395F4ECC5
	// void Completed_F736E1114B0A137F461A099395F4ECC5(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_ActiveEngine.SequenceDirector_C.ActiveEngine_FeedBack
	// void ActiveEngine_FeedBack();                                                                                            // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_ActiveEngine.SequenceDirector_C.ActiveEngine2_FeedBack
	// void ActiveEngine2_FeedBack();                                                                                           // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_ActiveEngine.SequenceDirector_C.ShipFly_FeedBack
	// void ShipFly_FeedBack();                                                                                                 // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_ActiveEngine.SequenceDirector_C.InGuiLinAir
	// void InGuiLinAir();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_ActiveEngine.SequenceDirector_C.Chen_Notwory
	// void Chen_Notwory();                                                                                                     // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_ActiveEngine.SequenceDirector_C.SequenceEvent
	// void SequenceEvent();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_ActiveEngine.SequenceDirector_C.ExecuteUbergraph_SequenceDirector
	// void ExecuteUbergraph_SequenceDirector(int32_t EntryPoint);                                                              // [0x148e900] Final                
};

/// Class /Game/Sequence/BMI/Level1/Moon/Moon_Begin.SequenceDirector_C
/// Size: 0x0038 (56 bytes) (0x000030 - 0x000038) align 8 MaxSize: 0x0038
class USequenceDirector_Cdup_0 : public ULevelSequenceDirector
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0030   (0x0008)  


	/// Functions
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_Begin.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector
	// void SequenceEvent__ENTRYPOINTSequenceDirector();                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_Begin.SequenceDirector_C.FlyInter_Loc_BP_Event
	// void FlyInter_Loc_BP_Event(class AFlyInter_Loc_BP_C* FlyInter_Loc_BP);                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_Begin.SequenceDirector_C.Chen_01
	// void Chen_01();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_Begin.SequenceDirector_C.ShuYa_01
	// void ShuYa_01();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_Begin.SequenceDirector_C.Chen_02
	// void Chen_02();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_Begin.SequenceDirector_C.Chen_03
	// void Chen_03();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_Begin.SequenceDirector_C.Chen_04
	// void Chen_04();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_Begin.SequenceDirector_C.Chen_05
	// void Chen_05();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_Begin.SequenceDirector_C.Chen_06
	// void Chen_06();                                                                                                          // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_Begin.SequenceDirector_C.ExecuteUbergraph_SequenceDirector
	// void ExecuteUbergraph_SequenceDirector(int32_t EntryPoint);                                                              // [0x148e900] Final                
};

/// Class /Game/Sequence/BMI/Level1/Moon/Moon_DogeCableCar.SequenceDirector_C
/// Size: 0x0038 (56 bytes) (0x000030 - 0x000038) align 8 MaxSize: 0x0038
class USequenceDirector_Cdup_1 : public ULevelSequenceDirector
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0030   (0x0008)  


	/// Functions
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_DogeCableCar.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector
	// void SequenceEvent__ENTRYPOINTSequenceDirector();                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_DogeCableCar.SequenceDirector_C.Completed_2DC305C1428BB08535C81F84578744CE
	// void Completed_2DC305C1428BB08535C81F84578744CE(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_DogeCableCar.SequenceDirector_C.Completed_E901029A4AFDE8EDC7BC9C9E381A7BAE
	// void Completed_E901029A4AFDE8EDC7BC9C9E381A7BAE(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_DogeCableCar.SequenceDirector_C.Completed_9505AF654EAA73B2563207854B77FA9F
	// void Completed_9505AF654EAA73B2563207854B77FA9F(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_DogeCableCar.SequenceDirector_C.ShipFly3_FeedBack
	// void ShipFly3_FeedBack();                                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_DogeCableCar.SequenceDirector_C.Boom_FeedBack
	// void Boom_FeedBack();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_DogeCableCar.SequenceDirector_C.Boom_FeedBack2
	// void Boom_FeedBack2();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_DogeCableCar.SequenceDirector_C.ShipFly4_FeedBack
	// void ShipFly4_FeedBack();                                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_DogeCableCar.SequenceDirector_C.ShuYa_Oh1
	// void ShuYa_Oh1();                                                                                                        // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_DogeCableCar.SequenceDirector_C.Chen_What
	// void Chen_What();                                                                                                        // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_DogeCableCar.SequenceDirector_C.ShuYa_GlassJump
	// void ShuYa_GlassJump();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_DogeCableCar.SequenceDirector_C.ExecuteUbergraph_SequenceDirector
	// void ExecuteUbergraph_SequenceDirector(int32_t EntryPoint);                                                              // [0x148e900] Final                
};

/// Class /Game/Sequence/BMI/Level1/Moon/Moon_End.SequenceDirector_C
/// Size: 0x0038 (56 bytes) (0x000030 - 0x000038) align 8 MaxSize: 0x0038
class USequenceDirector_Cdup_2 : public ULevelSequenceDirector
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0030   (0x0008)  


	/// Functions
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_End.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector
	// void SequenceEvent__ENTRYPOINTSequenceDirector();                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_End.SequenceDirector_C.Completed_A8E60AC7448D602130AE6985CA6AEF92
	// void Completed_A8E60AC7448D602130AE6985CA6AEF92(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_End.SequenceDirector_C.Completed_EF586E384D2D9ED12724038F0011A249
	// void Completed_EF586E384D2D9ED12724038F0011A249(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_End.SequenceDirector_C.Completed_3B98D7EB4F9610D2D41B66B97B874234
	// void Completed_3B98D7EB4F9610D2D41B66B97B874234(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_End.SequenceDirector_C.Completed_0E15957B4210A46386EA6C9513354907
	// void Completed_0E15957B4210A46386EA6C9513354907(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_End.SequenceDirector_C.Completed_99AD39234158A7D44989AAB39D23954B
	// void Completed_99AD39234158A7D44989AAB39D23954B(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_End.SequenceDirector_C.ShipFlyJump
	// void ShipFlyJump();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_End.SequenceDirector_C.TanShe_FeedBack
	// void TanShe_FeedBack();                                                                                                  // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_End.SequenceDirector_C.Boom_FeedBack
	// void Boom_FeedBack();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_End.SequenceDirector_C.DangQiuQian
	// void DangQiuQian();                                                                                                      // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_End.SequenceDirector_C.JiangLuoSanFly
	// void JiangLuoSanFly();                                                                                                   // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_End.SequenceDirector_C.ShuYa_Jump
	// void ShuYa_Jump();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_End.SequenceDirector_C.ShuYa_End
	// void ShuYa_End();                                                                                                        // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_End.SequenceDirector_C.Chen_End
	// void Chen_End();                                                                                                         // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_End.SequenceDirector_C.ShuYa_End2
	// void ShuYa_End2();                                                                                                       // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_End.SequenceDirector_C.ExecuteUbergraph_SequenceDirector
	// void ExecuteUbergraph_SequenceDirector(int32_t EntryPoint);                                                              // [0x148e900] Final                
};

/// Class /Game/Sequence/BMI/Level1/Moon/Moon_IntoGorund.SequenceDirector_C
/// Size: 0x0038 (56 bytes) (0x000030 - 0x000038) align 8 MaxSize: 0x0038
class USequenceDirector_Cdup_3 : public ULevelSequenceDirector
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0030   (0x0008)  


	/// Functions
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_IntoGorund.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector
	// void SequenceEvent__ENTRYPOINTSequenceDirector();                                                                        // [0x148e900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_IntoGorund.SequenceDirector_C.Completed_725CEE4343C1E1A30478E89AA434245E
	// void Completed_725CEE4343C1E1A30478E89AA434245E(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_IntoGorund.SequenceDirector_C.Completed_E505866644E1DB212CBA628CC1465EBE
	// void Completed_E505866644E1DB212CBA628CC1465EBE(class USaveGame* SaveGame, bool bSuccess);                               // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_IntoGorund.SequenceDirector_C.ShipFly2_FeedBack
	// void ShipFly2_FeedBack();                                                                                                // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_IntoGorund.SequenceDirector_C.Boom_FeedBack
	// void Boom_FeedBack();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_IntoGorund.SequenceDirector_C.SequenceEvent
	// void SequenceEvent();                                                                                                    // [0x148e900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Sequence/BMI/Level1/Moon/Moon_IntoGorund.SequenceDirector_C.ExecuteUbergraph_SequenceDirector
	// void ExecuteUbergraph_SequenceDirector(int32_t EntryPoint);                                                              // [0x148e900] Final                
};

#pragma pack(pop)


static_assert(sizeof(USequenceDirector_C) == 0x0038); // 56 bytes (0x000030 - 0x000038)
static_assert(sizeof(USequenceDirector_Cdup_0) == 0x0038); // 56 bytes (0x000030 - 0x000038)
static_assert(sizeof(USequenceDirector_Cdup_1) == 0x0038); // 56 bytes (0x000030 - 0x000038)
static_assert(sizeof(USequenceDirector_Cdup_2) == 0x0038); // 56 bytes (0x000030 - 0x000038)
static_assert(sizeof(USequenceDirector_Cdup_3) == 0x0038); // 56 bytes (0x000030 - 0x000038)
static_assert(offsetof(USequenceDirector_C, UberGraphFrame) == 0x0030);
static_assert(offsetof(USequenceDirector_Cdup_0, UberGraphFrame) == 0x0030);
static_assert(offsetof(USequenceDirector_Cdup_1, UberGraphFrame) == 0x0030);
static_assert(offsetof(USequenceDirector_Cdup_2, UberGraphFrame) == 0x0030);
static_assert(offsetof(USequenceDirector_Cdup_3, UberGraphFrame) == 0x0030);
